{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","canon":true,"lodges":"?\nCAPE TOWN\nWINE ROUTE\nWHALE ROUTE\nGARDEN ROUTE\nEASTERN CAPE\nMADIKWE GAME RESERVE\nPILANESBERG NATIONAL PARK\nWELGEVONDEN GAME RESERVE\nMAURITIUS\nSEYCHELLES\n"},"content":"<p>CHOOSE MALARIA-FREE</p>\n<p>Everyone will agree that Africa is a bucket list destination – even if you are pregnant or travelling with young kids.<br>Malaria-free is the way to go!  This means that you can still go on safari, visit an island or explore a city without missing out on anything.  After all – having kids is a blessing, so travelling with them to Africa should be a joy too.<br>Journey with us as we share our favourite malaria-free regions with you.  Remember though, now you have no excuse!</p>\n<ol>\n<li>Cape Town – South Africa<br>Nestled between the Indian &amp; Atlantic Oceans with iconic Table Mountain as backdrop, lies one of the world’s most vibrant &amp; breathtaking cities.  Cape Town is a multi-faceted destination that deserves to be explored by everyone – from romantics &amp; honeymooners who will love the luxurious accommodation &amp; idyllic views to adventure lovers &amp; families looking for an action-packed holiday.</li>\n<li>Wine Route – South Africa<br>Nestled between sun-kissed vineyards &amp; majestic mountains, the picturesque valleys of the Wine Route (also referred to as the Cape Winelands) are renowned for its exquisite wines, grand old estates, pretty towns &amp; award-winning restaurants.  Within only a 60-minute drive from vibrant Cape Town, you reach one of the most breathtaking regions in South Africa where Alpine-style views, art galleries &amp; quaint side-walk cafes are seen from almost every street.</li>\n<li>Whale Route – South Africa<br>The scenic Whale Route is the Overberg region’s Indian Ocean coastline - &amp; also considered one of the most breathtaking drives in the country.  The Whale Route’s claim to fame is that it offers the best land-based whale watching in the world!  Each year between July &amp; November, Southern Right whales &amp; Humpback whales migrate here to calve &amp; mate, so visitors can marvel at these gentle giants from one of the walking paths overlooking the ocean or from the comfort of a boat.</li>\n<li>Garden Route – South Africa<br>South Africa’s world-renowned Garden Route is a sunny stretch of coastline that lies just a few hours’ drive from the vibrant city of Cape Town, featuring a wonderful blend of beautiful beaches, lush forests, tranquil lagoons &amp; bustling seaside towns.  The malaria-free Garden Route is a big drawcard to independent families who prefer to do self-drive holidays &amp; explore at their own pace as well as nature lovers &amp; outdoor enthusiasts who are eager to tick off a list of exciting activities.</li>\n<li>Eastern Cape – South Africa<br>Just around the corner from the popular beaches &amp; seaside towns of the Garden Route lies South Africa’s Eastern Cape Province, a place of abundant wildlife, friendly service &amp; plenty of fun-filled activities.  A focal point of the Eastern Cape is its game reserves, most of which is home to the famous Big 5 – lion, leopard, elephant, buffalo &amp; rhino.  Moreover, this malaria-free region is a wonderful option for families who are looking for child-friendly activities that can keep the little ones active.</li>\n<li>Madikwe Game Reserve – South Africa<br>The 75,000-hectare Madikwe Private Game Reserve is one of South Africa’s largest Big 5 reserves.  Lying on the edge of the Kalahari &amp; close to the Botswana border, Madikwe is home to the coveted Big 5 – lion, leopard, elephant, buffalo &amp; rhino – as well as an abundance of other wildlife.  The reserve is malaria-free &amp; is, therefore, the perfect choice for families with young children.  Guests can choose from a wide selection of family-friendly safari lodges that offer exciting children’s activities, meals &amp; even babysitting services.</li>\n<li>Pilanesberg Game Reserve – South Africa<br>Only a stone’s throw from the famous Sun City resort &amp; a 2-hour drive from Johannesburg, the easily accessible Pilanesberg National Park offers its guests an abundance of wildlife &amp; a wide selection of activities for the whole family.  Located in a malaria-free region, Pilanesberg National Park is the top choice for families, particularly knowing that the adventure-packed Sun City is right next door!  </li>\n<li>Welgevonden Game Reserve – South Africa<br>Welgevonden Game Reserve is a 36,000-hectare private game reserve in the Waterberg District of the Limpopo Province of South Africa.  The reserve is one of the most accessible premier malaria-free wilderness reserves in the country.  After a pleasant 2,5-hour drive from Johannesburg, guests will arrive in Big 5 territory.</li>\n<li>Mauritius<br>Ask anyone who has been to Mauritius &amp; soon you will discover why this Indian Ocean island remains a worldwide favourite.  Not only are the beaches magnificently beautiful, but Mauritius offers an amazing year-round climate, world-class diving &amp; a long list of activities that can keep you busy for days.  What makes Mauritius so special, is that is appeals to absolutely everyone.  Families, couples, honeymooners &amp; friends are all catered for.  Some resorts even have family-friendly pools &amp; ‘adult-only’ wings.  Kids Clubs will keep the little ones entertained from morning to evening, so parents can put up their feet &amp; relax!</li>\n<li>Seychelles<br>A beautiful island republic in the western Indian Ocean boasts 115 islands with lush tropical vegetation, postcard-perfect beaches, and a wide variety of marine life.  Seychelles, the combined name for all these islands, remains one of the world’s most beautiful &amp; secluded beach destinations, offering visitors only the best in barefoot luxury.</li>\n</ol>\n","images":["optimized-images/family-travel/5choose-malaria-free/1ChooseMalaria-Free-large.webp","optimized-images/family-travel/5choose-malaria-free/2ChooseMalaria-Free-large.webp","optimized-images/family-travel/5choose-malaria-free/3ChooseMalaria-Free-large.webp","optimized-images/family-travel/5choose-malaria-free/4ChooseMalaria-Free-large.webp","optimized-images/family-travel/5choose-malaria-free/5ChooseMalaria-Free-large.webp","optimized-images/family-travel/5choose-malaria-free/6ChooseMalaria-Free-large.webp","optimized-images/family-travel/5choose-malaria-free/7ChooseMalaria-Free-large.webp","optimized-images/family-travel/5choose-malaria-free/8ChooseMalaria-Free-large.webp"],"subfolders":[{"title":"1Witness Fascinating Animal Encounters","description":"WITNESS FASCINATING ANIMAL ENCOUNTERS All children love animals, &amp; in Africa – there is a lot of love going around!  ","image":"optimized-images/family-travel/1witness-fascinating-animal-encounters/1WitnessFascinatingAnimalEncounters-small.webp","folderName":"family-travel/1witness-fascinating-animal-encounters"},{"title":"2Stay In Private Villas","description":"STAY IN PRIVATE VILLAS Let’s be honest – although hotels are luxurious &amp; amazing, spending a lot of time in a hotel room with (small) children, is not quite what Mum &amp; Dad had in mind when planning a family holiday!","image":"optimized-images/family-travel/2stay-in-private-villas/1StayInPrivateVillas-small.webp","folderName":"family-travel/2stay-in-private-villas"},{"title":"3Have Fun At The Kids Club","description":"HAVE FUN AT THE KIDS CLUB Holidays are supposed to be fun!  But often ‘fun for Mum &amp; Dad’, doesn’t necessarily mean ‘fun for the kids!’ (&amp; vice versa) But when your family travels to Africa, we’ll make sure that ‘fun’ is indeed for the whole family.","image":"optimized-images/family-travel/3have-fun-at-the-kids-club/1HaveFunAtTheKidsClub-small.webp","folderName":"family-travel/3have-fun-at-the-kids-club"},{"title":"4Explore At Your Own Pace","description":"EXPLORE AT YOUR OWN PACE Travelling with kids &amp; adhering to set schedules can be challenging for some, so if you are an independent family who loves to explore at your own pace – why not rent a car &amp; self-drive through South Africa or Nambia?","image":"optimized-images/family-travel/4explore-at-your-own-pace/1ExploreAtYourOwnPace-small.webp","folderName":"family-travel/4explore-at-your-own-pace"},{"title":"5Choose Malaria-Free","description":"CHOOSE MALARIA-FREE Everyone will agree that Africa is a bucket list destination – even if you are pregnant or travelling with young kids.","image":"optimized-images/family-travel/5choose-malaria-free/1ChooseMalaria-Free-small.webp","folderName":"family-travel/5choose-malaria-free"},{"title":"6Enjoy Family-Friendly Activities","description":"ENJOY FAMILY-FRIENDLY ACTIVITIES There are certain countries in the world that, as parents, we simply won’t dare to visit with our kids.  They are simply not child-friendly.","image":"optimized-images/family-travel/6enjoy-family-friendly-activities/1EnjoyFamily-FriendlyActivities-small.webp","folderName":"family-travel/6enjoy-family-friendly-activities"}],"parentCards":[{"title":"Bucket List","image":"optimized-images/bucket-list/1thebucketlist-small.webp","folderName":"bucket-list","isCurrentFolder":false},{"title":"Family Travel","image":"optimized-images/family-travel/1familytravel-small.webp","folderName":"family-travel","isCurrentFolder":true},{"title":"Africa Unwind","image":"","folderName":"index","isCurrentFolder":false},{"title":"Our Story","image":"optimized-images/our-story/1ourstory-small.webp","folderName":"our-story","isCurrentFolder":false},{"title":"Top Destinations","image":"optimized-images/top-destinations/11-small.webp","folderName":"top-destinations","isCurrentFolder":false},{"title":"What To Expect","image":"optimized-images/what-to-expect/1whattoexpect-small.webp","folderName":"what-to-expect","isCurrentFolder":false}],"h1Title":"5Choose Malaria-Free","h2Title":"Family Travel","h3Title":"5Choose Malaria-Free","whatWeLoveItems":[],"params":{"slug":["family-travel","5choose-malaria-free"]},"level":2},"__N_SSG":true}