{"pageProps":{"frontmatter":{"title":"SWANKY ZIMBABWE","subtitle":"","article_title":"","canon":true,"lodges":"Matetsi Victoria Falls\nSomalisa Camp\nNyamatusi Camp\n"},"content":"<p style=\"visibility: collapse !important; margin-top: -10px;\">\n\n<p></p>\n</p>\n\n<h4>RATE</h4>\n<p><Rate>USD $ 6,000 – USD $ 12,000 per person</Rate></p>\n<h4>AREAS</h4>\n<p>Vic Falls, Hwange, Mana Pools (9 nights)</p>\n<h4>Trip Summary</h4>\n<ul>\n<li>3 nights:  Matetsi Victoria Falls, Victoria Falls – Zimbabwe</li>\n<li>3 nights:  Somalisa Camp, Hwange – Zimbabwe</li>\n<li>3 nights:  Nyamatusi Camp, Mana Pools – Zimbabwe</li>\n</ul>\n<h4>Trip Overview</h4>\n<h1></h1>\n<h4>Day 1:</h4>\n<p>Upon arrival at Victoria Falls International Airport, you will be transferred by road to Matetsi Victoria Falls in Victoria Falls, Zimbabwe.</p>\n<h1></h1>\n<h4>Day 1 – 4:</h4>\n<p>Spend 3 nights at Matetsi Victoria Falls in a luxury suite on a fully inclusive basis.</p>\n<p>(Activities include game drives, walks, birdwatching, boating, fishing, canoeing &amp; a Guided Tour of Victoria Falls.)</p>\n<h1></h1>\n<h4>Day 4:</h4>\n<p>Road transfer from Matetsi Victoria Falls to Victoria Falls International Airport.</p>\n<p>Light air transfer from Victoria Falls International Airport to Somalisa Camp in Hwange, Zimbabwe.</p>\n<h1></h1>\n<h4>Day 4 – 7:</h4>\n<p>Spend 3 nights at Somalisa Camp in a luxury tent on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 7:</h4>\n<p>Light air transfer from Somalisa Camp to Nyamatusi Camp in Mana Pools, Zimbabwe.</p>\n<h1></h1>\n<h4>Day 7 – 10:</h4>\n<p>Spend 3 nights at Nyamatusi Camp in a luxury tent on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 10:</h4>\n<p>Light air transfer from Nyamatusi Camp to Victoria Falls International Airport.</p>\n<p>Depart Victoria Falls International Airport as per own arrangements.</p>\n<p>End of trip.</p>\n<h4>Inclusions</h4>\n<ul>\n<li>All road transfers</li>\n<li>All light air transfers</li>\n<li>All mentioned accommodations</li>\n<li>All meals, drinks (soft &amp;amp; alcoholic) &amp;amp; activities</li>\n</ul>\n<h4>Exclusions</h4>\n<ul>\n<li>International flights</li>\n<li>Visas (if necessary)</li>\n<li>Travel Insurance</li>\n</ul>\n","images":["optimized-images/favourite/2stylish/3swanky-zimbabwe/1swanky-zimbabwe-large.webp","optimized-images/favourite/2stylish/3swanky-zimbabwe/2swanky-zimbabwe-large.webp","optimized-images/favourite/2stylish/3swanky-zimbabwe/3swanky-zimbabwe-large.webp","optimized-images/favourite/2stylish/3swanky-zimbabwe/4swanky-zimbabwe-large.webp","optimized-images/favourite/2stylish/3swanky-zimbabwe/5swanky-zimbabwe-large.webp","optimized-images/favourite/2stylish/3swanky-zimbabwe/6swanky-zimbabwe-large.webp","optimized-images/favourite/2stylish/3swanky-zimbabwe/7swanky-zimbabwe-large.webp","optimized-images/favourite/2stylish/3swanky-zimbabwe/8swankyzimbabwe-large.webp"],"subfolders":[{"title":"MATETSI VICTORIA FALLS","description":"Matetsi Victoria Falls is set on the banks of the mighty Zambezi River within a private game reserve on the Zimbabwean side of the Falls.\nMatetsi allows guests to combine an action-packed visit to Victoria Falls with a luxurious safari.  \nThe lodge is located an hour’s drive from the majestic Vic Falls, so after a morning out visiting the Falls, guests can enjoy the tranquility, beautiful scenery &amp; excellent game viewing of Matetsi Victoria Falls.\nThe discerning traveler looking for a refined vacation will love Matetsi.  And because there are 2 large inter-leading suites, it is also ideal for family getaways.\n\nMatetsi Victoria Falls comprises 16 suites, 2 family suite &amp; 1 villa, each equipped with air-conditioning &amp; en-suite bathroom.\nThe suites have generous bathtubs, indoor &amp; outdoor rain showers as well as a private deck with plunge pool boasting magnificent views over the bush.\nThe family suites have the same amenities as the suites, but consists of 2 bedrooms, with adjoining passageway via a secure courtyard.\nThe villa is for exclusive use &amp; comes with 4 bedrooms, kitchen, indoor &amp; outdoor dining areas leading to a spacious veranda with swimming pool &amp; fire pit bowl.  The villa also includes a private chef, butler, guide &amp; safari vehicle.\nThe main lodge area at Matetsi includes a bar, dining room, lounge, gym, spa, library &amp; Kids Club.\n\nZimbabwe is not called the adventure capital of Africa for nothing!  There are a wide range of activities available to travelers that can either be pre-booked through us or directly at the lodge.\nOn-site activities include open 4x4 game drives, guided walks, boating safaris, canoeing &amp; fishing.  Guests can also enjoy relaxing massages at the river-side spa.","image":"optimized-images/default.webp","folderName":"cities/victoria-falls/matetsi-victoria-falls","created":null},{"title":"SOMALISA CAMP","description":"The award-winning Somalisa Camp is a stylish tented safari camp that lies in Zimbabwe’s flagship Hwange National Park &amp; overlooks a busy waterhole.\nThe camp is built along the Kennedy vlei line, which means guests can expect plenty of wildlife action on game drives.\nHwange National Park offers superb year-round game viewing with frequent sightings of lion, elephant &amp; white rhino as well as a wide variety of antelope.  Excellent birding can also be expected as well as fantastic photographic opportunities.\nOverlooking a busy elephant drinking waterhole, Somalisa guests can have an ‘armchair’ experience from the comfort of the camps’ viewing deck or swimming pool.\n\nRemote &amp; romantic, there are only 7 customised tents, each with a private viewing deck, luxurious en-suite bathroom &amp; lounge as well as a glass wood-burning fireplace for chilly winter evenings.\nSomalisa is a leading eco-friendly safari lodge using solar-powered energy &amp; a water recycling plant.\n\nSafari activities at Somalisa Camp include big game safaris in open 4x4 vehicles, guided walking safaris, birding as well as cultural village tours &amp; game viewing from one of the many secret hides on the reserve.","image":"optimized-images/default.webp","folderName":"safaris/zimbabwe/hwange-national-park/somalisa-camp","created":null},{"title":"NYAMATUSI CAMP","description":"Nestled between a grove of large mahogany &amp; sausage trees lies Nyamatusi Camp – one of Mana Pool National Park’s most luxurious safari camps.\nWith air-conditioning &amp; private plunge pools in every suite, guests can experience this wildlife-rich area in style, while still adhering to an eco-friendly &amp; sustainable design.\nMana Pools’ complex ecosystem supports a wealth of game, including cheetah, wild dog, lion &amp; leopard, which makes this area attractive to safari enthusiasts.  \nBecause the Zambezi River’s banks swell during the summer rains, Nyamatusi is a seasonal camp that only operates between April &amp; November – the best time to go on safari!\n\nBoasting 6 spacious tented suites, Nyamatusi Camp is small &amp; intimate – offering a remote safari experience in a pristine wilderness setting.\nEach of the suites has uninterrupted views of the Zambezi River &amp; includes an en-suite bathroom with indoor &amp; outdoor shower, air-conditioning, a pilates mat &amp; weights as well as a private deck with a plunge pool where lazy days are spent.\nThe double-story main area features a library, dining room, bar &amp; viewing deck with splash pool.\n\nNyamatusi Camp has a variety of exciting safari activities on the menu.  Some of these include open 4x4 game drives, walking safaris &amp; catch-&amp;-release fishing.\nThe Lower Zambezi River is the ideal setting for an adventurous canoe safari.  Guests can paddle along the tranquil waters &amp; look for wildlife such as hippos, crocodiles, elephants &amp; a variety of birds.","image":"optimized-images/default.webp","folderName":"safaris/zimbabwe/mana-pools-national-park/nyamatusi-camp","created":null}],"parentCards":[{"title":"Charming","image":"optimized-images/favourite/1charming/1charming-small.webp","folderName":"favourite/1charming","isCurrentFolder":false},{"title":"2Stylish","image":"optimized-images/favourite/2stylish/1stylish-small.webp","folderName":"favourite/2stylish","isCurrentFolder":true},{"title":"3Exclusive","image":"optimized-images/favourite/3exclusive/1exclusive-small.webp","folderName":"favourite/3exclusive","isCurrentFolder":false}],"h1Title":"Swanky Zimbabwe","h2Title":"Stylish","h3Title":"Swanky Zimbabwe","whatWeLoveItems":["Experience Zimbabwe’s best regions","Enjoy spectacular views over the Zambezi River","Witness the majestic Vic Falls","Go on game drives, guided walks, canoe trips, boat safaris & fishing expeditions","Experience luxury at its best – private pool, outdoor shower & copper bath","Stay in stylish safari tents"],"params":{"slug":["favourite","2stylish","3swanky-zimbabwe"]},"level":3},"__N_SSG":true}