{"pageProps":{"frontmatter":{"title":"SOUTH AFRICA IN STYLE","subtitle":"","article_title":"","canon":true,"lodges":"Tintwalo Atlantic\nLa Cle Des Montagnes\nLion Sands River Lodge\nTanda Tula Safari Camp\n"},"content":"<p style=\"visibility: collapse !important; margin-top: -10px;\">\n\n<p></p>\n</p>\n\n<h4>RATE</h4>\n<p><Rate>USD $ 6,000 – USD $ 12,000 per person</Rate></p>\n<h4>AREAS</h4>\n<p>Cape Town, Wine Route, Kruger (12 nights)</p>\n<h4>Trip Summary</h4>\n<ul>\n<li>4 nights:  Tintswalo Atlantic, Cape Town – South Africa</li>\n<li>2 nights:  La Cle des Montagnes, Wine Route – South Africa</li>\n<li>3 nights:  Lion Sands River Lodge, Sabi Sand/Kruger – South Africa</li>\n<li>3 nights:  Tanda Tula Safari Camp, Timbavati/Kruger – South Africa</li>\n</ul>\n<h4>Trip Overview</h4>\n<h1></h1>\n<h4>Day 1:</h4>\n<p>Upon arrival at Cape Town International Airport, you will be transferred by road to Tintswalo Atlantic in Cape Town, South Africa.</p>\n<h1></h1>\n<h4>Day 1 – 5:</h4>\n<p>Spend 4 nights at Tintswalo Atlantic in a luxury island suite on a bed &amp; breakfast basis.</p>\n<p>During your stay, you will depart on a Full Day Cape Point &amp; Peninsula Tour &amp; a Half Day City &amp; Table Mountain Tour. (private vehicle &amp; guide)</p>\n<h1></h1>\n<h4>Day 5:</h4>\n<p>Road transfer from Tintswalo Atlantic to La Cle des Montagne in Franschhoek, Wine Route.</p>\n<h1></h1>\n<h4>Day 5 – 8:</h4>\n<p>Spend 3 nights at La Cle des Montagnes in a luxury villa suite on a bed &amp; breakfast basis.</p>\n<p>During your stay, you will depart on a Full Day Wine Route Tour. </p>\n<p>(private vehicle &amp; guide)</p>\n<h1></h1>\n<h4>Day 8:</h4>\n<p>Road transfer from La Cles des Montagne to Cape Town International Airport.</p>\n<p>Scheduled flight from Cape Town to Skukuza with South African Airways – economy.</p>\n<p>Road transfer from Skukuza Airport to Lion Sands River Lodge in the Sabi Sand Reserve, Kruger.</p>\n<h1></h1>\n<h4>Day 8 – 11:</h4>\n<p>Spend 3 nights at Lion Sands River Lodge in a superior luxury room on a fully inclusive basis.</p>\n<p>During your stay, you will spend 1 of the 3 nights in the iconic Lion Sands Chalkley Treehouse.</p>\n<h1></h1>\n<h4>Day 11:</h4>\n<p>Light air transfer from Lion Sands River Lodge to Tanda Tula Safari Camp in the Timbavati Reserve.</p>\n<h1></h1>\n<h4>Day 11 – 14:</h4>\n<p>Spend 3 nights at Tanda Tula Safari Camp in a luxury tent on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 14:</h4>\n<p>Light air transfer from Tanda Tula Safari Camp to Johannesburg International Airport.</p>\n<p>Depart Johannesburg International Airport as per own arrangements.</p>\n<p>End of trip.</p>\n<h4>Inclusions</h4>\n<ul>\n<li>All regional flights</li>\n<li>All road transfers</li>\n<li>All light air transfers</li>\n<li>All mentioned private tours &amp;amp; activities</li>\n<li>All mentioned accommodations</li>\n<li>On safari&#58;  All meals, drinks (soft &amp;amp; alcoholic) &amp;amp; activities</li>\n<li>Elsewhere&#58;  Bed &amp;amp; breakfast basis</li>\n</ul>\n<h4>Exclusions</h4>\n<ul>\n<li>International flights from home</li>\n<li>Visas (if necessary)</li>\n<li>Travel Insurance</li>\n</ul>\n","images":["optimized-images/favourite/2stylish/4south-africa-in-style/1south-africa-in-style-large.webp","optimized-images/favourite/2stylish/4south-africa-in-style/2south-africa-in-style-large.webp","optimized-images/favourite/2stylish/4south-africa-in-style/3south-africa-in-style-large.webp","optimized-images/favourite/2stylish/4south-africa-in-style/4south-africa-in-style-large.webp","optimized-images/favourite/2stylish/4south-africa-in-style/5south-africa-in-style-large.webp","optimized-images/favourite/2stylish/4south-africa-in-style/6south-africa-in-style-large.webp","optimized-images/favourite/2stylish/4south-africa-in-style/7south-africa-in-style-large.webp","optimized-images/favourite/2stylish/4south-africa-in-style/8south-africa-in-style-large.webp"],"subfolders":[{"title":"TINTWALO ATLANTIC","description":"Perched above the Atlantic Ocean at the base of Chapman’s Peak, Tintswalo Atlantic offers a luxurious beachfront retreat with uninterrupted ocean views.  \nSet just outside Cape Town, the lodge is built in a secluded cranny, offering romantics &amp; honeymooners a true ocean paradise.\nLocated only 20 minutes from Cape Town’s city centre, this boutique hotel is the perfect base from which to explore the city, as well as Camps Bay, Clifton &amp; Llandudno beaches.  \nThe lodge is built to blend seamlessly with the natural environment, ensuring optimum views of the sea &amp; natural surroundings.  Right in front of the lodge, guests can take a stroll down a pebbled beach – or drive out to the nearby sandy, main beach in the quaint fishing town of Hout Bay.\n\nTintswalo Atlantic boasts 11 suites, each authentically designed &amp; decorated to reflect elements of different well-known islands around the world, keeping to the lodge’s relaxed, yet sophisticated beach theme.\nSuites all enjoy incredible views of the Atlantic Ocean &amp; offer supreme comfort &amp; privacy.  All suites are equipped with air-conditioning &amp; lavish furnishes.  En-suite bathrooms boast double basins &amp; showers.\nThe long wooden deck offers spectacular views of the ocean.  It is here where guests enjoy a meal, watch the sunset with a cocktail in hand, or unwind in the jacuzzi with a glass of bubbly.  \nDeep sofas &amp; comfortable chairs in the lounge invite you to relax after dinner.  The lodge is also home to a cocktail bar &amp; wine cellar that offers an extensive range of local wines.\n\nAt Tintswalo Atlantic, dining is a much-deserved treat.  Chefs are more than happy to cook according to your taste as all meals are catered to your needs &amp; preferences.  Dinner can be served in the dining room or kitchen, outside on the deck or in the privacy of your suite.\nExciting day tours can also be arranged.  Highlights include Cape Point, Boulders Beach &amp; its adorable penguins, Table Mountain, the Winelands, Robben Island &amp; visiting a local township.","image":"optimized-images/default.webp","folderName":"cities/cape-town/tintswalo-atlantic","created":null},{"title":"LA CLE DES MONTAGNES","description":"La Cle des Montagne offers luxurious villa-style living in the heart of the Franschhoek valley in the Cape Winelands District.  \nSophisticated, stylish &amp; breathtakingly beautiful – these opulent villas &amp; suites are located on a working wine estate, surrounded by picturesque vineyards, plum orchards &amp; spectacular mountains.\nLa Cle is the ideal destination for the discerning traveller who is after an intimate &amp; luxurious villa experience.  The villas offer an idyllic setting a short stroll from the historic village of Franschhoek, with its award-winning restaurants, cafes &amp; art galleries.\n\nConsisting of 2 properties in 2 different locations, La Cle gives guests the choice of staying at The Village or The Lodge.\nThe Village is home to 4 villas (Grange, Manoir, Galerie &amp; Colonial), while The Lodge is split into 5 rooms, boasting captivating views of the Franschhoek Valley.\nGuests can book all accommodation on a per-room or exclusive-use basis (apart from the Galerie villa, which can only be booked exclusively.)  \nEach of The Village’s 4 elegant villas has been individually styled &amp; comes complete with an interactive kitchen, a lounge &amp; dining room as well as an outdoor deck area with a swimming pool.\nLa Cle Lodge offers expansive views, a tennis court, putt &amp; chip lawn &amp; helipad.\n\nThe Winelands can keep one busy for a few days! \nActivities include cheese &amp; wine tasting tours, horse riding, hiking &amp; visits to the beautiful town of Stellenbosch, only a 20-minute drive away.  \nA highlight is taking a stroll through the charming village of Franschhoek with its many award-winning restaurants, shops &amp; art galleries.","image":"optimized-images/default.webp","folderName":"cities/wine-route/la-cle-des-montagnes","created":null},{"title":"LION SANDS RIVER LODGE","description":"Lion Sands River Lodge is the heart &amp; soul of Lion Sands &amp; is built on the banks of the Sabie River in the Southern section of the Sabi Sand Reserve, adjacent to the Kruger National Park.\nThis area is well known for its spectacular game viewing.  In fact, guests don’t have to leave the lodge for excellent sightings – it is not uncommon to spot animals wandering by while relaxing in a lounger by the swimming pool.\n\nLion Sands River Lodge features 8 luxury rooms, 6 superior luxury suites, 3 river suites &amp; 1 family river suite.\nEach of the 8 luxury rooms has an en-suite bathroom, lounge &amp; wooden deck with bush views.\nThe 6 superior luxury rooms are larger &amp; have ample open-plan bathrooms &amp; outdoor showers – 2 sets are inter-leading, making them ideal for families.\nEach of the 3 river suites is located further away from the main lodge &amp; enjoy a more private setting.  The river views from these suites are fantastic &amp; best appreciated from the expansive decks.  The river suites also have romantic outdoor showers.\nThe family river suite has 2 bedrooms with inter-leading doors &amp; therefore an ideal choice for families travelling with young children.\nThe main lodge area features a spa, bar, large deck with pool, gym, library &amp; computer facilities.\n\nExciting activities are available at Lion Sands River Lodge.  \nSome of these include open 4x4 day &amp; night drives, guided walking safaris, spa treatments, astronomy evenings, bush dinners &amp; picnics &amp; romantic sleep-outs in Kingston or Chalkley Treehouse not too far from camp.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/kruger-national-park/sabi-sand-private-game-reserve/lion-sands-river-lodge","created":null},{"title":"TANDA TULA SAFARI CAMP","description":"The Tanda Tula Camps are set within the game-packed private Timbavati Nature Reserve in the Greater Kruger Region &amp; is home to the Big 5 – lion, leopard, elephant, buffalo &amp; rhino.\nTanda Tula in the Timbavati features 4 camps – Tanda Tula Safari Camp, Tanda Tula Field Camp, Tanda Tula Plains Camp &amp; Tanda Tula Nkarhi Homestead.  \nSafari Camp is renowned as one of the most luxurious tented camps in South Africa &amp; Field Camp is an exclusive mobile tented eco-camp with an emphasis on walking safaris.  Plains Camp boasts private plunge pools &amp; spectacular views while Nkarhi Homestead offers guests an off-the-grid experience with total exclusivity.\nTanda Tula promises an unforgettable experience in game viewing, warm hospitality &amp; award-winning cuisine.\n\nAccommodation at Tanda Tula Safari Camp consists of 12 luxury tents overlooking the Nhlaralumi River, each with an en-suite bathroom with a bath &amp; outdoor shower as well as a private deck with gorgeous river views.\nThe main lodge area includes a bar, lounge, dining room, swimming pool overlooking a waterhole, large viewing deck &amp; bird hide.\n\nDaily safari activities at Tanda Tula includes open 4x4 game drives &amp; guided bush walks for those wishing to get closer to nature.\nThe Timbavati Reserve is home to Africa’s Big 5 (lion, leopard, elephant, buffalo &amp; rhino) as well as plenty of other game such as giraffe, zebra, impala, jackal, wild dog, cheetah, hippo &amp; hyena.\nThere is also a romantic Star Bed situated away from camp for guests wishing to sleep out under the African skies.  This experience can be booked at an additional cost.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/kruger-national-park/timbavati-private-game-reserve/tanda-tula-safari-camp","created":null}],"parentCards":[{"title":"Charming","image":"optimized-images/favourite/1charming/1charming-small.webp","folderName":"favourite/1charming","isCurrentFolder":false},{"title":"2Stylish","image":"optimized-images/favourite/2stylish/1stylish-small.webp","folderName":"favourite/2stylish","isCurrentFolder":true},{"title":"3Exclusive","image":"optimized-images/favourite/3exclusive/1exclusive-small.webp","folderName":"favourite/3exclusive","isCurrentFolder":false}],"h1Title":"South Africa In Style","h2Title":"Stylish","h3Title":"South Africa In Style","whatWeLoveItems":["Experience the best of South African luxury","Enjoy uninterrupted ocean views & world-class service","Taste fine dining cuisine & award-winning wines","Sleep in style – from an ocean-front retreat to a luxury safari tent","Spend the night in a luxury treehouse","Encounter Africa’s Big 5 from an open 4x4 jeep"],"params":{"slug":["favourite","2stylish","4south-africa-in-style"]},"level":3},"__N_SSG":true}