{"pageProps":{"frontmatter":{"title":"TEMPTING TANZANIA","subtitle":"","article_title":"","canon":true,"lodges":"Legendary Lodge\nSanctuary Swala Camp\nNeptune Ngorongoro Luxury Lodge\nSanctuary Kichakani\n"},"content":"<p style=\"visibility: collapse !important; margin-top: -10px;\">\n\n<p></p>\n</p>\n\n<h4>RATE</h4>\n<p><Rate>USD $ 6,000 – USD $ 12,000 per person</Rate></p>\n<h4>AREAS</h4>\n<p>Arusha, Tarangire, Ngorongoro Crater, Serengeti (9 nights)</p>\n<h4>Trip Summary</h4>\n<ul>\n<li>1 night:  Legendary Lodge, Arusha – Tanzania</li>\n<li>2 nights:  Sanctuary Swala Camp, Tarangire – Tanzania</li>\n<li>3 nights:  Neptune Ngorongoro Luxury Lodge, Ngorongoro Crater – Tanzania</li>\n<li>3 nights:  Sanctuary Kichakani, Serengeti – Tanzania</li>\n</ul>\n<h4>Trip Overview</h4>\n<h1></h1>\n<h4>Day 1:</h4>\n<p>Upon arrival at Kilimanjaro International Airport, you will be transferred by road to Legendary Lodge in Arusha, Tanzania.</p>\n<p>Overnight at Legendary Lodge in a garden cottage on a bed &amp; breakfast basis.</p>\n<h1></h1>\n<h4>Day 2:</h4>\n<p>Road transfer from Legendary Lodge to Arusha Airport.</p>\n<p>Light air transfer from Arusha Airport to Sanctuary Swala in Tarangire National Park, Tanzania.</p>\n<h1></h1>\n<h4>Day 2 – 4:</h4>\n<p>Spend 2 nights at Sanctuary Swala in a luxury-suite tent on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 4:</h4>\n<p>Game drive road transfer from Sanctuary Swala through Tarangire National Park &amp; Lake Manyara National Park to Neptune Ngorongoro Luxury Lodge in the Ngorongoro Crater, Tanzania.</p>\n<h1></h1>\n<h4>Day 4 – 7:</h4>\n<p>Spend 3 nights at Neptune Ngorongoro Luxury Lodge in a luxury suite on a fully in inclusive basis.</p>\n<h1></h1>\n<h4>Day 7:</h4>\n<p>Light air transfer from Neptune Ngorongoro Luxury Lodge to Sanctuary Kichakani (Mobile Camp) in the Serengeti, Tanzania.</p>\n<h1></h1>\n<h4>Day 7 – 10:</h4>\n<p>Spend 3 nights at Sanctuary Kichakani in a luxury tent on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 10:</h4>\n<p>Light air transfer from Sanctuary Kichakani to Kilimanjaro International Airport.</p>\n<p>Depart Kilimanjaro International Airport as per own arrangements.</p>\n<p>End of trip.</p>\n<h4>Inclusions</h4>\n<ul>\n<li>All road transfers</li>\n<li>All light air transfers</li>\n<li>All mentioned accommodations</li>\n<li>On safari&#58;  All meals, drinks (soft &amp;amp; alcoholic) &amp;amp; activities</li>\n<li>Elsewhere&#58;  Bed &amp;amp; breakfast basis</li>\n</ul>\n<h4>Exclusions</h4>\n<ul>\n<li>International flights</li>\n<li>Visas (if necessary)</li>\n<li>Travel Insurance</li>\n</ul>\n","images":["optimized-images/favourite/2stylish/5tempting-tanzania/1tempting-tanzania-large.webp","optimized-images/favourite/2stylish/5tempting-tanzania/2tempting-tanzania-large.webp","optimized-images/favourite/2stylish/5tempting-tanzania/3tempting-tanzania-large.webp","optimized-images/favourite/2stylish/5tempting-tanzania/4tempting-tanzania-large.webp","optimized-images/favourite/2stylish/5tempting-tanzania/5tempting-tanzania-large.webp","optimized-images/favourite/2stylish/5tempting-tanzania/6tempting-tanzania-large.webp","optimized-images/favourite/2stylish/5tempting-tanzania/7tempting-tanzania-large.webp","optimized-images/favourite/2stylish/5tempting-tanzania/8tempting-tanzania-large.webp"],"subfolders":[{"title":"LEGENDARY LODGE","description":"Legendary Lodge boasts a beautiful setting on a fragrant working coffee farm among lush tropical gardens on the outskirts of Arusha.\nThis tranquil retreat offers a home-away-from-home experience, sublime cuisine &amp; exceptional service.\nIdeal as a stopover point before or after a Tanzania safari or while hiking Kilimanjaro, the lodge is also a wonderful base from which to explore the nearby Arusha National Park &amp; Ngurdoto Crater.\n\nThere are 10 elegant garden cottages, each featuring an en-suite bathroom with bathtub &amp; rain shower as well as a private veranda overlooking the gardens with stunning views of Mount Meru.\nEach cottage also boasts a cozy lounge with fireplace.\nThe central lodge area includes a dining room, a covered veranda, beautiful gardens as well as a swimming pool &amp; spa providing a range of relaxing treatments.\nThere is also a nearby recreation centre with gym, steam room, pool, tennis &amp; squash courts &amp; running track.\n\nLegendary Lodge offers a range of exciting activities.\nThese include coffee tours, golf, cycling, hiking, running, swimming, shopping, garden lunches, sundowner excursions &amp; helicopter trips.\nOthers include day trips to Arusha, Mount Kilimanjaro, Tarangire, Manyara National Parks or Ngorongoro Conservation Area.","image":"optimized-images/default.webp","folderName":"cities/arusha/legendary-lodge","created":null},{"title":"SANCTUARY SWALA CAMP","description":"The secluded &amp; luxurious Sanctuary Swala Camp is situated under a canopy of large acacia trees at the edge of the Gurusi wetlands in Tarangire National Park.\nWith sweeping views of the rolling savannah beyond, Swala is the only camp in this part of Tarangire &amp; therefore offers an exclusive safari to discerning travellers who seek the best in wilderness luxury.\nThe park is home to large herds of elephants &amp; it is not surprising to see these amazing creatures pass through camp &amp; give birth nearby.  In fact, the record for elephant bulls at Swala is an astonishing 92 animals!\nIn the dry season, the Tarangire River becomes the area’s main lifeline, attracting an abundance of wildlife, including predators &amp; birds.  Guests can sit on the viewing deck &amp; enjoy excellent armchair game viewing without ever having to leave camp.\n\nThe camp boasts 12 luxury-suite tents, all overlooking a popular waterhole where animals frequently come to quench their thirst.  \nEach tent has a dedicated butler that will take care of your every need.\nThe open-plan tents feature en-suite bathrooms with indoor &amp; outdoor bush-view showers for guests to connect with wildlife as well a private deck – the perfect place to relax after a day of exploration.\nCommunal areas at Sanctuary Swala Camp comprises a lounge, dining room, café-style bar &amp; sparkling swimming pool.\n\nA range of exciting safari activities is available at Swala.\nThese include open 4x4 day &amp; night drives with qualified guides, guided walking safaris, bush picnics &amp; getting involved in the beekeeping project in the village of Mwika.","image":"optimized-images/default.webp","folderName":"safaris/tanzania/tarangire-national-park/sanctuary-swala-camp","created":null},{"title":"NEPTUNE NGORONGORO LUXURY LODGE","description":"Neptune Ngorongoro Luxury Lodge is situated on the edge of the Ngorongoro Conservation Area, a short drive from the game-rich Ngorongoro Crater as well as the rewarding Lake Manyara National Park – famed for its tree-climbing lions.\nOverlooking a dramatic landscape of volcanic peaks &amp; coffee plantations, Neptune Ngorongoro Luxury Lodge is a tranquil haven for safari-goers in search of superb wildlife viewing &amp; interesting day excursions.\nThe Ngorongoro Crater is known to have the densest concentration of wildlife in Africa &amp; Lake Manyara is home to an abundance of wildlife, so Neptune’s guests will be able to experience the best of both worlds.\n\nAccommodation comprises 20 spacious cottages with en-suite bathrooms. \nEach cottage features a private lounge with an open fireplace &amp; a large deck offering beautiful views over the surrounding landscape.\nThe main lodge area consists of a restaurant, bar, library, swimming pool &amp; wellness spa where relaxing post-safari treatments can be enjoyed.\n\nNeptune Ngorongoro Luxury Lodge offers a range of exciting safari activities.\nThese include open 4x4 game drives in Ngorongoro Crater &amp; Lake Manyara, archaeological excursions to Olduvai Gorge as well as sundowner trips, guided nature walks &amp; visits to coffee farms &amp; local Maasai villages.","image":"optimized-images/default.webp","folderName":"safaris/tanzania/ngorongoro-crater/neptune-ngorongoro-luxury-lodge","created":null},{"title":"SANCTUARY KICHAKANI","description":"Witnessing the annual Wildebeest Migration is on everyone’s bucket list - &amp; rightly so!  Sanctuary Kichakani moves between 3 different locations in the iconic Serengeti, in pursuit of Earth’s greatest wildlife spectacle.\nKichakani guests will be included in some of the most dramatic events in Migration season – be it seeing millions of antelope on the move, witnessing wildebeest &amp; their young during calving season or the cherry on top:  the river crossings.\nThe wildebeest have to move back to the Masai Mara in Kenya &amp; therefore is forced to cross various crocodile-infested rivers – an East African highlight!\nApart from witnessing this amazing annual wildlife event, the central Serengeti is also famous for its reliable predator sightings, so guests can be on the lookout for lions, leopards, cheetah &amp; wild dog.\nHoneymooners or couples who want to immerse themselves in the Migration experience, without compromising on modern comforts, will fall in love with Sanctuary Kichakani.\n\nSanctuary Kichakani boasts 10 contemporary, stylish en-suite tents complete with authentic safari bucket showers &amp; private viewing decks.\nDesigned to leave minimal impact on the environment, Kichakani forsakes unnecessary grand facilities of some of the permanent lodges &amp; features a central tent with lounge &amp; dining areas.\nGuests can order a drink from the safari bar or share interesting safari stories around the crackling campfire.\n\nCompletely unfenced to the wilderness, Sanctuary Kichakani offers an authentic safari experience.\nActivities include open 4x4 safari drives with a qualified guide &amp; romantic sundowner excursions.","image":"optimized-images/default.webp","folderName":"safaris/tanzania/serengeti-national-park/sanctuary-kichakani","created":null}],"parentCards":[{"title":"Charming","image":"optimized-images/favourite/1charming/1charming-small.webp","folderName":"favourite/1charming","isCurrentFolder":false},{"title":"2Stylish","image":"optimized-images/favourite/2stylish/1stylish-small.webp","folderName":"favourite/2stylish","isCurrentFolder":true},{"title":"3Exclusive","image":"optimized-images/favourite/3exclusive/1exclusive-small.webp","folderName":"favourite/3exclusive","isCurrentFolder":false}],"h1Title":"Tempting Tanzania","h2Title":"Stylish","h3Title":"Tempting Tanzania","whatWeLoveItems":["Witness the Great Wildebeest Migration (July – October)","Enjoy excellent Big 5 wildlife viewing year-round","Spot the iconic tree-climbing lions at TarangireGo on open 4x4 day & night drives – searching for nocturnal animals","Enjoy dramatic landscapes & all-day game viewing in the crater","Cycle to a nearby Masai village & meet the locals"],"params":{"slug":["favourite","2stylish","5tempting-tanzania"]},"level":3},"__N_SSG":true}