{"pageProps":{"frontmatter":{"title":"FUN FOR FAMILIES","subtitle":"","article_title":"","canon":true,"lodges":"Cape Grace\nMorukuru Owner’s House\nTROU AUX BICHES BEACHCOMBER GOLF RESORT &amp;amp; SPA\n"},"content":"<p style=\"visibility: collapse !important; margin-top: -10px;\">\n\n<p></p>\n</p>\n\n<h4>RATE</h4>\n<p><Rate>USD $ 6,000 – USD $ 12,000 per person</Rate></p>\n<h4>AREAS</h4>\n<p>Cape Town, Madikwe, Mauritius (12 nights)</p>\n<h4>Trip Summary</h4>\n<ul>\n<li>3 nights:  Cape Grace, Cape Town – South Africa</li>\n<li>4 nights:  Morukuru Owner’s House, Madikwe – South Africa</li>\n<li>5 nights:  Trou aux Biches, Mauritius</li>\n</ul>\n<h4>Trip Overview</h4>\n<h1></h1>\n<h4>Day 1:</h4>\n<p>Upon arrival at Cape Town International Airport, you will be transferred by road to Cape Grace in Cape Town, South Africa.</p>\n<h1></h1>\n<h4>Day 1 – 4:</h4>\n<p>Spend 3 nights at Cape Grace in a luxury room on a bed &amp; breakfast basis.</p>\n<p>During your stay, you will depart on a Full Day Cape Point &amp; Peninsula Tour &amp; a Half Day City &amp; Table Mountain Tour. (private vehicle &amp; guide)</p>\n<h1></h1>\n<h4>Day 4:</h4>\n<p>Road transfer from Cape Grace to Cape Town International Airport.</p>\n<p>Scheduled flight from Cape Town to Johannesburg with South African Airways – economy.</p>\n<p>Light air transfer from Johannesburg International Airport to Morukuru Owner’s House in Madikwe Game Reserve, South Africa.</p>\n<h1></h1>\n<h4>Day 4 - 8:</h4>\n<p>Spend 4 nights at Morukuru Owner’s House (exclusive-use) on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 8:</h4>\n<p>Light air transfer from Morukuru Owner’s House to Johannesburg International Airport.</p>\n<p>Scheduled flight from Johannesburg to Mauritius with South African Airways – economy.</p>\n<p>Road transfer from Mauritius International Airport to Trou aux Biches in Mauritius.</p>\n<h1></h1>\n<h4>Day 8 – 13:</h4>\n<p>Spend 5 nights at Trou aux Biches in a beachfront suite with pool on an all-inclusive basis.</p>\n<p>(Unlimited water sports are included: water-skiing, sailing, windsurfing, snorkelling, kayaking, glass-bottom boats &amp; pedal boats.)</p>\n<h1></h1>\n<h4>Day 13:</h4>\n<p>Road transfer from Trou aux Biches to Mauritius International Airport.</p>\n<p>Scheduled flight from Mauritius to Johannesburg with South African Airways – economy.</p>\n<p>Depart Johannesburg International Airport as per own arrangements.</p>\n<p>End of trip.</p>\n<h4>Inclusions</h4>\n<ul>\n<li>All regional flights</li>\n<li>All road transfers</li>\n<li>All light air transfers</li>\n<li>All mentioned private tours &amp;amp; activities</li>\n<li>All mentioned accommodations</li>\n<li>On safari &amp;amp; in Mauritius&#58;  All meals, drinks (soft &amp;amp; alcoholic) &amp;amp; activities</li>\n<li>Elsewhere&#58;  Bed &amp;amp; breakfast basis</li>\n</ul>\n<h4>Exclusions</h4>\n<ul>\n<li>International flights from home</li>\n<li>Visas (if necessary)</li>\n<li>Travel Insurance</li>\n</ul>\n","images":["optimized-images/favourite/2stylish/6fun-for-families/1fun-for-families-large.webp","optimized-images/favourite/2stylish/6fun-for-families/2fun-for-families-large.webp","optimized-images/favourite/2stylish/6fun-for-families/3fun-for-families-large.webp","optimized-images/favourite/2stylish/6fun-for-families/4fun-for-families-large.webp","optimized-images/favourite/2stylish/6fun-for-families/5fun-for-families-large.webp","optimized-images/favourite/2stylish/6fun-for-families/6fun-for-families-large.webp","optimized-images/favourite/2stylish/6fun-for-families/7fun-for-families-large.webp","optimized-images/favourite/2stylish/6fun-for-families/8fun-for-families-large.webp"],"subfolders":[{"title":"CAPE GRACE","description":"The luxurious Cape Grace boasts an excellent location in Cape Town’s V&amp;A Waterfront, overlooking Table Mountain &amp; the harbour.  \nThis 5-star hotel is a gracious sanctuary of sophistication &amp; contemporary comfort.\nLoyalty to guests is paramount at Cape Grace.  This is reflected in the luxurious spaciousness of guests’ rooms as well as the diverse spectrum of amenities &amp; world-class service, ensuring an unforgettable stay.\nRight on the hotel’s doorstep, guests can take their pick between browsing the shops, enjoying delicious food at one of Cape Town’s top restaurants or taking photos from the top of Table Mountain, the city’s most popular icon.\n\nThe Cape Grace consists of 120 individually decorated rooms &amp; suites, reflecting a blend of modern luxury &amp; traditional Cape culture.  \nEach room or suite is elegant in style &amp; generous in size, boasting iPod docking stations, fully stocked private bars &amp; mini-delis as well as personally selected books from the library.  Elegant marble bathrooms are kitted out with luxurious Charlotte Rhys toiletries, a range exclusive to Cape Grace.\nFamilies travelling with children can enjoy X-Box 360s in all the suites &amp; penthouses.  The hotel’s restaurant, Signal brings you cuisine that is fresh &amp; creative.  Besides the clear waters of the marina, The Bascule Bar provides the largest selection of whiskies south of the equator.\nCape Grace boasts a luxurious spa, a well-stocked library &amp; a swimming pool where guests can relax after a busy day out.\n\nPopular day-trips include visits to Camps Bay or Clifton beaches, V&amp;A Waterfront, The Winelands, Cape Point, Robben Island, Boulders Beach’s penguin colony or Kirstenbosch Gardens.\nOther options like shark-cage diving or whale watching can be arranged.  Cape Town also offers a variety of nature trails, hikes, picnic spots &amp; adventure sports like kite surfing, windsurfing, stand-up paddleboarding, paragliding, sandboarding, horse riding &amp; much more.","image":"optimized-images/default.webp","folderName":"cities/cape-town/cape-grace","created":null},{"title":"MORUKURU OWNER’S HOUSE","description":"Morukuru Family consists of 3 exclusive bush villas located in the malaria-free Madikwe Private Game Reserve in South Africa.\nThese private villas include Morukuru Farm House, Morukuru Owner’s House &amp; Morukuru River House - each villa complete with a dedicated hosting couple, butler, cleaning staff, ranger &amp; tracker.   \nThe villas are truly unique.  Guests staying here will be guaranteed to have a bush experience like no other.  Private, intimate &amp; secluded – Morukuru Family offers an exclusive safari to the discerning traveller.\n\nMorukuru Owner’s House is the epitome of luxury.  \nBuilt on the banks of the Marico River, this intimate family lodge includes 2 en-suite bedrooms, a comfortable lounge with fireplace, dining room, private viewing deck &amp; reading sala.  \nThere is also a heated swimming pool, an outdoor bath &amp; an extensive wine cellar.\n\nDaily activities include safari drives in open 4x4 vehicles &amp; bush walks.  The Morukuru Hide is set next to the water’s edge &amp; invites guests for adventurous sleep-outs surrounded by the African wilderness.\nRelaxing massage treatments can also be booked at an additional cost.\nIn summer, guests staying at Morukuru can also enjoy fishing or waterskiing on the nearby dam as well as picnic barbeques.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/madikwe-game-reserve/morukuru-owners-house","created":null},{"title":"TROU AUX BICHES BEACHCOMBER GOLF RESORT &amp;amp; SPA","description":"Located on one of the finest resort sites on the island, Trou aux Biches unfolds its magnificent suites &amp; villas along 2km of beach on the northwest coast of Mauritius.\nTrou aux Biches Beachcomber has undergone a R1 billion re-vamp, unmatched anywhere in Mauritius, ensuring that they are always at the forefront of the luxury resort industry.\nKnown for its year-round fabulous weather, the location of Trou aux Biches makes it a highly coveted Mauritian island destination.\nA staggering 100 swimming pools, some of them are private, make this hotel the first choice for the discerning traveller; with world-class service, spectacular sunsets &amp; a relaxed atmosphere to complete the experience.\n\nTrou aux Biches includes a variety of well-appointed suites – designed with maximum peace &amp; privacy in mind.  Each air-conditioned suite or villa has a lavish en-suite bathroom with a bath &amp; shower.\nResort facilities include the largest variety of swimming pools in Mauritius, 6 restaurants &amp; 2 bars, a wellness spa, gym, sauna &amp; Kids Club.\n\nTrou aux Biches offers a variety of exciting island activities.\nWater activities including swimming, snorkelling, diving, waterskiing, wakeboarding, windsurfing &amp; sailing.  Others are pedalos or glass-bottom boating, aqua aerobics, Hobie cats &amp; kayaking. \nGuests can also try deep-sea fishing or speed boat trips.\nLand activities include tennis, gym, volleyball, table tennis, aerobics, bocci ball, cycling or golf.","image":"optimized-images/default.webp","folderName":"islands/mauritius/trou-aux-biches-beachcomber-golf-resort-spa","created":null}],"parentCards":[{"title":"Charming","image":"optimized-images/favourite/1charming/1charming-small.webp","folderName":"favourite/1charming","isCurrentFolder":false},{"title":"2Stylish","image":"optimized-images/favourite/2stylish/1stylish-small.webp","folderName":"favourite/2stylish","isCurrentFolder":true},{"title":"3Exclusive","image":"optimized-images/favourite/3exclusive/1exclusive-small.webp","folderName":"favourite/3exclusive","isCurrentFolder":false}],"h1Title":"Fun For Families","h2Title":"Stylish","h3Title":"Fun For Families","whatWeLoveItems":["Enjoy views over Cape Town’s iconic Waterfront","Explore Cape Town’s highlights – Table Mountain & penguins at Boulders beach","Stay in a private villa while on safari – dedicated ranger, tracker & butler","See Africa’s famous Big 5","Experience sea-facing suites & villas on a private beach","Enjoy a wide range of land & water-based island activities (& a Kids Club)"],"params":{"slug":["favourite","2stylish","6fun-for-families"]},"level":3},"__N_SSG":true}