{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","created":"1 June 2022","category":"We Say","canon":true},"content":"<p>“Wow, I am excited about this trip!” I thought while packing.</p>\n<p>Safari outfits?  Check.  Camera?  Check.  Swim gear?  Check.  After I have packed these three essentials, I almost felt like the rest of the things on my list were suddenly not so important anymore.  (But with kids, you always need to pack more!  So I did.)<br>We were staying along the scenic Garden Route &amp; already experienced a bag full of family fun – ziplining through the forest, hiking, water park thrills &amp; elephant encounters – so it was time for our bush adventure!<br>Kariega Game Reserve is not only a malaria-free safari region (ideal for families or pregnant travellers), but is also home to the coveted Big 5 – lion, leopard, elephant, buffalo &amp; rhino.  Two rivers flow through the reserve:  the Kariega &amp; Bushman’s Rivers – attracting an abundance of wildlife &amp; offering travellers both land &amp; water-based activities. (subject to water-levels)<br>We chose this location, because it is a wonderful add-on to a self-drive Garden Route holiday – but you can also catch a quick flight from Cape Town to Port Elizabeth &amp; get transferred by road to your safari lodge.<br>So, after a short 2-hour drive from Port Elizabeth, we reached our safari home for the next few nights:  Settlers Drift, a luxury tented lodge with exceptional views.<br>Upon arrival, we were met by a friendly member of staff &amp; transported to the jetty overlooking the river, where we enjoyed a welcome drink before our boat arrived.  “Yay!” we all thought as the boat approached us.  “What a grand entrance!”<br>After a beautiful 20-minute boat ride, we met our friendly guide, Michael, &amp; then hopped onto an open 4x4 jeep that took us straight to the lodge.  On our way, we saw a wide variety of wildlife – including so many giraffes – we could hardly count them all!<br>When we arrived at Settlers Drift, we were already relaxed!  The lodge boasts amazing décor, spectacular views, large open-plan areas, a gorgeous boma &amp; an infinity pool overlooking the vast bushveld below.<br>The staff showed us around &amp; escorted us to our tent.  (There are only 9 tents at Settlers Drift, so the experience is intimate &amp; private.)  “Wow,” we thought when we reached our room.  “Spacious, was, perhaps an understatement.”  Beautifully designed, each tent has an opulent bedroom, a living area, a full bathroom with an indoor &amp; outdoor shower, a mini bar &amp; a private deck with gorgeous views.  The tents are so spacious, our kids didn’t need their own room – but slept on their own, comfortable beds in the living area.<br>A tent ‘highlight’ for us, are the sliding glass doors in the bathroom!  They can slide open so that the large bathtub &amp; shower are completely exposed to the lush bush outside!  Indoor-outdoor magic!<br>Game drives were plenty of fun!  We saw so many animals during our afternoon &amp; morning drives, including one of my favourite elephant encounters yet!  On our second day, just before the sun set, a herd of about 30 elephants approached our vehicle. (Don’t worry, safety is always first!)  Our guide switched the engine off &amp; we sat in silence as the herd moved closer to us.  They were so close, if we were to reach out (don’t ever do this, it is not allowed) – we could have touched them!  They were super relaxed &amp; very curious.  Then we heard a few elephants trumpeting &amp; watched as some of the little ones played with one another next to our vehicle…A magical sighting, indeed!<br>We also loved the sundowner stops in the bush.  “Kids, time to stretch your legs!”  Nothing beats feeling the African bushveld underneath your feet while sipping a delicious drink &amp; watching the sun set over the horizon.<br>I feel like I must pause for a moment &amp; comment about the food.  Because – let’s be honest – food is a very important part of a safari holiday.  We ate our hearts out!  Not only did the chef take our dietary requirements into consideration (we have quite the list!), he spoiled us by serving meals in different locations each day.  Lunched was often served on the deck overlooking the bush &amp; dinner was served next to a roaring fireplace or in the outdoor boma.  We also loved the breakfast spot…You have guessed it – with even more views!<br>In-between game drives, we enjoyed cooling off in the infinity pool, sunbathing or reading…&amp; of course, taking a much-needed afternoon siesta! (We are not used to those early morning wake-up calls!)  Spa treatments can also be enjoyed in the comfort of your tent.<br>Settlers Drift was a wonderful option for our family, but I think an even better choice for honeymooners or couples wanting to experience a slice of bushveld paradise.<br>When it was time to leave, we were a little devastated, to say the least.  Settlers Drift made a huge impression on me…on us.  But we will most definitely be back for another sunny safari!<br>Shall I start packing?</p>\n","images":["optimized-images/blog/we-say/sunny-safari/1sunnysafari-large.webp","optimized-images/blog/we-say/sunny-safari/2sunnysafari-large.webp","optimized-images/blog/we-say/sunny-safari/3sunnysafari-large.webp","optimized-images/blog/we-say/sunny-safari/4sunnysafari-large.webp","optimized-images/blog/we-say/sunny-safari/5sunnysafari-large.webp","optimized-images/blog/we-say/sunny-safari/6sunnysafari-large.webp","optimized-images/blog/we-say/sunny-safari/7sunnysafari-large.webp","optimized-images/blog/we-say/sunny-safari/8sunnysafari-large.webp"],"subfolders":[{"title":"Mother City","description":"Everyone loves Cape Town.  Full stop.  This article is finished. The only reason I continue to write, is because there is so much to say about South Africa’s most beautiful city.  You may think I am biased since I was born here & grew up here – but then I meet people from other countries around the world who agree with me - & I realise, I am right! (She said humbly.)","image":"optimized-images/blog/we-say/mother-city/1mothercity-small.webp","folderName":"blog/we-say/mother-city","created":"1 February 2023"},{"title":"Spa Surprise","description":"If you know me well, you’ll know that I get excited about these 3 things:  People, travel &amp; spa treatments! So, when our friends decided to spoil us with a spa day, we could not refuse.  (Everyone needs friends like ours!)","image":"optimized-images/blog/we-say/spa-surprise/1spasurprise-small.webp","folderName":"blog/we-say/spa-surprise","created":"1 October 2022"},{"title":"Wine & Whales","description":"Apart from seeing the Big 5 on safari, there are 2 things that get most travellers excited:  Wine &amp; Whales – in no particular order! But we are not most people.  My husband &amp; I don’t even drink wine (please don’t judge us!) – but we decided to investigate 2 of the most popular self-drive routes in South Africa to see if they are truly as spectacular as everyone says.","image":"optimized-images/blog/we-say/wine-whales/1wine-whales-small.webp","folderName":"blog/we-say/wine-whales","created":"1 September 2022"},{"title":"Family Fun","description":"OK, Let’s be honest – traveling with kids can be fun (or not).  It all depends on one crucial holiday ingredient:  activities! “What are we going to do today?” is often the one question parents hear while on holiday - &amp; often repetitively. So, I made it my mission to find a holiday that offers of a bagful of fun for the whole family – including Mum &amp; Dad. OK, Let’s be honest – traveling with kids can be fun (or not).  It all depends on one crucial holiday ingredient:  activities!","image":"optimized-images/blog/we-say/family-fun/1familyfun-small.webp","folderName":"blog/we-say/family-fun","created":"1 August 2022"},{"title":"Island Extraordinaire","description":"There are two things that excite me when it comes to travel:  Islands &amp; luxury…And for some reason, these two things are like cookies &amp; cream – they create the perfect balance to a holiday. So, from now on I will refer to this term (Islands + Luxury) as ‘Island Extraordinaire’, because if you continue to read until the end, you’ll understand why our recent trip to Mozambique was exactly that - Extraordinary!","image":"optimized-images/blog/we-say/island-extraordinaire/1islandextraordinaire-small.webp","folderName":"blog/we-say/island-extraordinaire","created":"1 July 2022"},{"title":"Sunny Safari","description":"“Wow, I am excited about this trip!” I thought while packing. Safari outfits?  Check.  Camera?  Check.  Swim gear?  Check.  After I have packed these three essentials, I almost felt like the rest of the things on my list were suddenly not so important anymore.  (But with kids, you always need to pack more!  So I did.)","image":"optimized-images/blog/we-say/sunny-safari/1sunnysafari-small.webp","folderName":"blog/we-say/sunny-safari","created":"1 June 2022"}],"parentCards":[{"title":"All Things Africa","image":"optimized-images/blog/all-things-africa/1-all-things-africa-small.webp","folderName":"blog/all-things-africa","isCurrentFolder":false},{"title":"Our Clients Say","image":"optimized-images/blog/our-clients-say/1-clients-say-small.webp","folderName":"blog/our-clients-say","isCurrentFolder":false},{"title":"We Say","image":"optimized-images/blog/we-say/1-we-say-small.webp","folderName":"blog/we-say","isCurrentFolder":true}],"h1Title":"Sunny Safari","h2Title":"We Say","h3Title":"Sunny Safari","whatWeLoveItems":[],"params":{"slug":["blog","we-say","sunny-safari"]},"level":3},"__N_SSG":true}