{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","created":"1 August 2022","category":"We Say","canon":true,"pageTitle":"Family Fun"},"content":"<p>OK, Let’s be honest – traveling with kids can be fun (or not).  It all depends on one crucial holiday ingredient:  activities! “What are we going to do today?” is often the one question parents hear while on holiday - &amp; often repetitively. So, I made it my mission to find a holiday that offers of a bagful of fun for the whole family – including Mum &amp; Dad.</p>\n<p>OK, Let’s be honest – traveling with kids can be fun (or not).  It all depends on one crucial holiday ingredient:  activities!</p>\n<p>“What are we going to do today?” is often the one question parents hear while on holiday - &amp; often repetitively.</p>\n<p>So, I made it my mission to find a holiday that offers of a bagful of fun for the whole family – including Mum &amp; Dad.</p>\n<p>Mission completed!</p>\n<p>The scenic (&amp; malaria-free) Garden Route is a sunny stretch of coastline that lies just a few hours’ drive from the vibrant city of Cape Town, featuring a wonderful blend of beautiful beaches, lush forests, tranquil lagoons &amp; bustling seaside towns.</p>\n<p>“Excited yet?” we asked our kids.  “Yessssss!” they shouted when we explained what our next family adventure entails.</p>\n<p>So off we went.</p>\n<p>But before we get to all the fun, let me first explain why the Garden Route is one of Planet Earth’s best choices for a family holiday.</p>\n<p>The climate is perfectly suited for an outdoor lifestyle.<br>A variety of exciting nature activities are on offer.<br>You’ll experience the best of all worlds – beach, forest &amp; town-life.<br>Roads are safe &amp; easy to use, so self-drive holidays are possible.<br>You can easily combine the Garden Route with an Eastern Cape safari.</p>\n<p>OK, back to our family trip…</p>\n<p>We decided to spend a few nights in Knysna &amp; a few nights in Plettenberg Bay – since both seaside towns offer a wide range of unforgettable African adventures, including ziplining through the forest, elephant encounters, hiking trails, sailing &amp; wildlife sanctuaries.</p>\n<p>First on our list, was hiking!  We are all big nature-lovers, so being outdoors really gets us excited! But not to worry – if you are concerned that you are not fit enough – you can opt for one of the shorter trails!</p>\n<p>We did 2 hikes in Knysna (Jubilee Creek / Circles in the Forest &amp; Buffalo Bay Trail) &amp; another in Plettenberg Bay - Robberg Hiking Trail.  All these trails are child-friendly &amp; offer a variety of options to choose from.</p>\n<p>Jubilee Creek &amp; Circles in the Forest (as the name suggests) are beautiful trails, deep in the Knysna Forest.  They are both great options for a warm day, since the lush forest keeps the sun out, so the entire hike takes place in the shade.  We loved this hike (&amp; so did our kids)!  They stopped to look at insects, played on large tree trunks &amp; admired the huge forest mushrooms around every corner.  At the end of Jubilee Creek, you will find a beautiful waterfall – the perfect spot to have a picnic or take some photos.</p>\n<p>Next up was Buffalo Bay Trail, just outside of Knysna. In contrast to the previous hike, this one started on the beach.  We followed the trail over golden sand dunes &amp; ended up on a secluded beach where we all jumped into the water before we had a relaxing picnic.</p>\n<p>You’d think we’d had enough hiking for a few days, but since we spend a little longer in the Garden Route than most people – we added another hike to our activity list!  Robberg Hiking Trail in Plettenberg Bay really overwhelmed us!  This coastal hike boasts endless views over the ocean &amp; you can even spot (&amp; hear) large seal colonies from up there!  It was – most definitely – one of our favourite hikes ever.</p>\n<p>Next on our list, was ziplining through the forest!</p>\n<p>Our kids have been wanting to experience this for ages, so we booked a tour with Tsitsikamma Tree Canopy Tours near Plett.  Ever wanted to feel like Tarzan or Jane?  This is it!</p>\n<p>Located in the magnificent Tsitsikamma indigenous rainforest, many of the platforms are built around giant Outeniqua Yellowwood trees that are over 700 years old!  And here we are, looking down at the lush forest floor thirty metres below…1, 2, 3 – Flyyyyyyyyy!  We were very impressed with the company &amp; felt incredibly safe the entire time.  Our kids (age 7) managed to slide across the forest from one zipline to the next without our help…Little adventurers, for sure!</p>\n<p>Our next activity may surprise you, but I strongly feel to include it in my blog, because we simply can’t remember the last time that we had so much fun as a family!</p>\n<p>Adventureland!  Yes, if the name does not give it away – I’ll help you.  It is an outdoor waterpark situated in the middle of a forest.  The things I love about it (except for the fun water slides) is the fact that there are no music playing like at most waterparks (only the natural sounds of the forest), no smoking or alcohol is allowed &amp; the grounds are in pristine condition.  We were there for 5 hours &amp; probably only sat down on the grass to eat lunch before we headed for the slides again!  I did not see a single parent there who did not slide! (There are various slides that accommodate the entire family – from toddlers to young kids &amp; teens to adults.)  I also love the fact that there is enough shade as well as large, manicured lawns &amp; a small restaurant where you can buy take-aways &amp; drinks.  The slides were so much fun!  For kids (&amp; most adults), this is probably the icing on the cake when it comes to all-things-fun!</p>\n<p>Adventureland will see us again!</p>\n<p>Most of you reading this blog want to visit Africa to see one thing:  our wildlife! (&amp; rightly so) Truth be told – Africa has earned its reputation as the world’s leading wildlife destination, offering unmatched animal encounters – be that from a safari vehicle, a traditional canoe, a boat – or in this case, from one of the many wildlife sanctuaries located along the Garden Route.</p>\n<p>Our next few stops ensured that we celebrated Africa’s magnificent animals.  And first up, was a visit to The Elephant Sanctuary in Plettenberg Bay.</p>\n<p>The aim of The Elephant Sanctuary is looking after orphaned elephants, with the aim to re-introduce them back into the wild &amp; therefore allowing guests to enjoy an educational interactive African elephant experience.</p>\n<p>Our kids were so excited!  We had an opportunity to walk trunk-in-hand with these gentle giants, brush them down &amp; feed them…what a treat!  We were surprised to see how relaxed the elephants were around humans – &amp; how much fun they had interacting with us - all because of the sanctuary’s commitment to use positive reinforcement elephant training methods.</p>\n<p>We also visited Birds of Eden &amp; Monkeyland (located next to one another).  Birds of Eden is the largest single span free-flight aviary in the world, encompassing an area of 2,3 hectares of forest &amp; waterways with 1,2km of walkways.  We loved exploring at our own pace while being surrounded by 3,500 free flying birds.  “Wow,” our kids often said when spotting a new bird they have not seen before.</p>\n<p>Monkeyland is the world’s first free-roaming multi-species primate sanctuary, covering an area of 12 hectares of indigenous forest &amp; providing ex-captive primates a healthier, more natural lifestyle.  We were blown away to see so many primates – over 550 to be exact – including gibbons, howler monkeys, vervet monkeys, langurs, sakis, capuchins, squirrel monkeys, spider monkeys, ring-tailed lemurs &amp; the critically endangered black &amp; white ruffed lemurs.  This was, most definitely, a fun experience for the whole family.</p>\n<p>But the Garden Route wasn’t done with us just yet!</p>\n<p>Over the next few days, we spend time relaxing by the beach, swimming, going on quad-bike adventures, visiting the Knysna Waterfront with its many delicious seafood restaurants &amp; browsing around boutique stores.  And you’ve guessed it – we still didn’t even scratch the surface when it comes to family friendly activities!</p>\n<p>Next time we visit, we want to tick off abseiling, beach horse riding, canoeing, canyoning, scootours, snorkeling, tubing &amp; whale watching.</p>\n<p>Needless to say - when our Garden Route holiday came to an end &amp; we were driving back home, our kids asked: “So, when are we coming back here?”</p>\n<p>I doubt you need further convincing?</p>\n","images":["/AUB/optimized-images/blog/we-say/family-fun/1familyfun-large.webp","/AUB/optimized-images/blog/we-say/family-fun/2familyfun-large.webp","/AUB/optimized-images/blog/we-say/family-fun/3familyfun-large.webp","/AUB/optimized-images/blog/we-say/family-fun/4familyfun-large.webp","/AUB/optimized-images/blog/we-say/family-fun/5familyfun-large.webp","/AUB/optimized-images/blog/we-say/family-fun/6familyfun-large.webp","/AUB/optimized-images/blog/we-say/family-fun/7familyfun-large.webp","/AUB/optimized-images/blog/we-say/family-fun/8familyfun-large.webp"],"subfolders":[{"title":"Family Fun","description":"OK, Let’s be honest – traveling with kids can be fun (or not).  It all depends on one crucial holiday ingredient:  activities! “What are we going to do today?” is often the one question parents hear while on holiday - &amp; often repetitively. So, I made it my mission to find a holiday that offers of a bagful of fun for the whole family – including Mum &amp; Dad. OK, Let’s be honest – traveling with kids can be fun (or not).  It all depends on one crucial holiday ingredient:  activities!","image":"/AUB/optimized-images/blog/we-say/family-fun/1familyfun-small.webp","folderName":"blog/we-say/family-fun"},{"title":"Island Extraordinaire","description":"There are two things that excite me when it comes to travel:  Islands &amp; luxury…And for some reason, these two things are like cookies &amp; cream – they create the perfect balance to a holiday. So, from now on I will refer to this term (Islands + Luxury) as ‘Island Extraordinaire’, because if you continue to read until the end, you’ll understand why our recent trip to Mozambique was exactly that - Extraordinary!","image":"/AUB/optimized-images/blog/we-say/island-extraordinaire/1islandextraordinaire-small.webp","folderName":"blog/we-say/island-extraordinaire"},{"title":"Mother City","description":"Everyone loves Cape Town.  Full stop.  This article is finished. The only reason I continue to write, is because there is so much to say about South Africa’s most beautiful city.  You may think I am biased since I was born here & grew up here – but then I meet people from other countries around the world who agree with me - & I realise, I am right! (She said humbly.)","image":"/AUB/optimized-images/blog/we-say/mother-city/1mothercity-small.webp","folderName":"blog/we-say/mother-city"},{"title":"Spa Surprise","description":"If you know me well, you’ll know that I get excited about these 3 things:  People, travel &amp; spa treatments! So, when our friends decided to spoil us with a spa day, we could not refuse.  (Everyone needs friends like ours!)","image":"/AUB/optimized-images/blog/we-say/spa-surprise/1spasurprise-small.webp","folderName":"blog/we-say/spa-surprise"},{"title":"Sunny Safari","description":"“Wow, I am excited about this trip!” I thought while packing. Safari outfits?  Check.  Camera?  Check.  Swim gear?  Check.  After I have packed these three essentials, I almost felt like the rest of the things on my list were suddenly not so important anymore.  (But with kids, you always need to pack more!  So I did.)","image":"/AUB/optimized-images/blog/we-say/sunny-safari/1sunnysafari-small.webp","folderName":"blog/we-say/sunny-safari"},{"title":"Wine & Whales","description":"Apart from seeing the Big 5 on safari, there are 2 things that get most travellers excited:  Wine &amp; Whales – in no particular order! But we are not most people.  My husband &amp; I don’t even drink wine (please don’t judge us!) – but we decided to investigate 2 of the most popular self-drive routes in South Africa to see if they are truly as spectacular as everyone says.","image":"/AUB/optimized-images/blog/we-say/wine--whales/1wine&whales-small.webp","folderName":"blog/we-say/wine-whales"}],"parentCards":[{"title":"All Things Africa","image":"/AUB/optimized-images/blog/all-things-africa/1-all-things-africa-small.webp","folderName":"blog/all-things-africa","isCurrentFolder":false},{"title":"Our Clients Say","image":"/AUB/optimized-images/blog/our-clients-say/1-clients-say-small.webp","folderName":"blog/our-clients-say","isCurrentFolder":false},{"title":"We Say","image":"/AUB/optimized-images/blog/we-say/1-we-say-small.webp","folderName":"blog/we-say","isCurrentFolder":true}],"h1Title":"Family Fun","h2Title":"We Say","h3Title":"Family Fun","whatWeLoveItems":[],"params":{"slug":["blog","we-say","family-fun"]},"level":3},"__N_SSG":true}