{"pageProps":{"frontmatter":{"title":"THE BUCKET LIST","subtitle":"","article_title":"","keyword":"bucket list destinations","related":"africa bucket list | africa bucket list | things to do in africa | bucket list travel experiences | bucket list places to visit","canon":true,"meta":"Africa should be on top of your Bucket List Destinations because it’s a once-in-a-lifetime experience! Let Africa Unwind plan your perfect adventure!","pageTitle":"Bucket List Destinations | Africa Unwind"},"content":"<p>What is a bucket list? Simply put, it is a collection of dreams &amp; aspirations that we would like to accomplish within our lifetime.</p>\n<p>It is no surprise that when it comes to travel goals, Africa is usually on top of the list. Our beautiful continent dominates all bucket list destinations because of the spectacular memories &amp; moments it promises!</p>\n<p>Africa offers its visitors a variety of experiences, including action-packed wildlife encounters, spectacular scenery, pristine beaches &amp; exciting activities.</p>\n<p>We have compiled a list of our Top 6 bucket list travel experiences, so come &amp; journey with us as we dive deeper into Africa’s most rewarding safari ‘must-do’s.’</p>\n<h4>TICK OFF THE BIG 5 (&amp; SEE VIC FALLS)</h4>\n<p>Looking for bucket list travel experiences? A safari should be Number 1 on everyone’s list. Africa offers superb Big 5 game viewing, close-up wildlife encounters &amp; dramatic nature spectacles such as the Great Wildebeest Migration – a ‘not to be missed’ activity on the safari itinerary. Adding on Victoria Falls, one of the Seven Natural Wonders of the World is a great idea.</p>\n<h4>SLEEP IN A TREEHOUSE</h4>\n<p>Experiencing the real Africa from the comfort of an open-air treehouse is quite the adventure &amp; definitely an experience of a lifetime. Sleeping under a canopy of stars while listening to the sounds of the wild is what the African Bucket List is all about.</p>\n<h4>ENJOY A WATER-BASED SAFARI</h4>\n<p>There are many ways to enjoy close-up wildlife encounters. Open 4x4 game drives &amp; guided walking safaris will take guests straight into the action while relaxing mokoro or boating safaris are the perfect way to get closer to aquatic animals such as hippo, crocodile &amp; birds.</p>\n<h4>FLOAT IN A HOT AIR BALLOON</h4>\n<p>Hot air balloon safaris allow guests to enjoy a bird’s eye view over the scenic landscape below. Flying over the red sand dunes of Sossusvlei or the game-packed plains of the Serengeti is an experience that should not be missed.</p>\n<h4>GO GORILLA TREKKING</h4>\n<p>What is more magical than spending time with endangered mountain gorillas in the lush forests of Rwanda or Uganda? Hiking through dense rainforests in search of wild, habituated gorillas &amp; chimps is a life-changing experience, to say the least. Observing these amazing creatures in their natural habitat is one you will never forget.</p>\n<h4>STAY ON A PRIVATE ISLAND</h4>\n<p>The Indian Ocean is filled with secluded islands where absolute exclusivity is the aim. Most of these islands can only be accessed by helicopter, small plane or sea transfer – which means that you will experience only the best in barefoot luxury where beach villas, private pools &amp; white, sandy beaches await.</p>\n","images":["optimized-images/bucket-list/1thebucketlist-large.webp","optimized-images/bucket-list/2thebucketlist-large.webp","optimized-images/bucket-list/3thebucketlist-large.webp","optimized-images/bucket-list/4thebucketlist-large.webp","optimized-images/bucket-list/5thebucketlist-large.webp","optimized-images/bucket-list/6thebucketlist-large.webp","optimized-images/bucket-list/7thebucketlist-large.webp","optimized-images/bucket-list/8thebucketlist-large.webp"],"subfolders":[{"title":"Tick Off The Big 5","description":"Coming to Africa without seeing the Big 5 is like visiting Paris without catching a glimpse of the Eiffel Tower!   The term ‘Big 5’ was coined by big-game hunters of the past &amp; refers to the 5 most difficult animals in Africa to hunt on foot - but is now widely used in the safari industry as some of the most interesting animals to see on a photographic safari. Lion, leopard, elephant, buffalo &amp; rhino have become ‘celebrities of the bush’ &amp; one of the main reasons an African safari should be on everyone’s bucket list.","image":"optimized-images/bucket-list/1tick-off-the-big-5/1tickoffthebig5-small.webp","folderName":"bucket-list/1tick-off-the-big-5","created":null},{"title":"Sleep In a Treehouse","description":"An African holiday is all about making (childhood) dreams a reality.  When we grow up, we sometimes forget that life is still full of fantasy, mystery &amp; fun. Many safari lodges throughout Africa offer guests just that – a unique &amp; magical experience…&amp; what is more magical than spending a night in a treehouse under the stars? Each treehouse is luxuriously set up for you, usually accompanied by a special dinner under the stars, a radio &amp; a starry sky as canopy.  Some treehouses are located in the middle of the bush (close enough to camp) while others come in the form of ‘star beds’ on your chalet’s open rooftop deck.","image":"optimized-images/bucket-list/2sleep-in-a-treehouse/1sleepinatreehouse-small.webp","folderName":"bucket-list/2sleep-in-a-treehouse","created":null},{"title":"Enjoy a Water-based Safari","description":"Africa offers a wide range of exciting safari activities – but not all safaris take place on land!  Some can be enjoyed from the comfort of a canoe, a boat or even a traditional mokoro (dug-out canoe).   Exploring Africa on a water-based safari brings you closer to aquatic animals like hippo &amp; crocodile while superb birdwatching can be enjoyed as the sun sets over the bushveld.  Elephants are frequently spotted drinking or playing in the water – an incredible sight to see! Not many destinations in Africa offer water-based safaris, but the ones that do, are totally worth the visit!","image":"optimized-images/bucket-list/3enjoy-a-water-based-safari/1enjoyawater-basedsafari-small.webp","folderName":"bucket-list/3enjoy-a-water-based-safari","created":null},{"title":"Float In a Hot Air Balloon","description":"Everyone around the world – regardless of your age, gender or ethnicity has probably dreamt about flying.  We’re not just talking about stepping onto an aeroplane, fastening your seatbelt &amp; flying across the ocean to another country…Of course, that is a given.   We’re talking about floating in the sky &amp; experiencing life from a bird’s eye view.  This is the dream.  So why not dream big &amp; set off on a scenic hot air balloon safari? Something magical happens when you observe the bush from a different vantage point.  The peaceful surroundings below you are filled with bright colours as the sun rises over the eastern horizon.  As the earth warms up, the wildlife starts to become active &amp; it is quite the thrill to spot animals as they move across the plains.  The balloon can fly relatively low over big herds (unlike helicopters &amp; small planes), making this one of the best ways to witness the Great Wildebeest Migration.","image":"optimized-images/bucket-list/4float-in-a-hot-air-balloon/1floatinahotairballoon-small.webp","folderName":"bucket-list/4float-in-a-hot-air-balloon","created":null},{"title":"Go Gorilla-Trekking","description":"Talking about Bucket List adventures?  Look no further, because trekking through the jungles of Africa &amp; coming face to face with endangered mountain gorillas is as good as it gets! The fact that gorillas as a species are on the verge of extinction &amp; treks are a highly restricted activity, puts gorilla-trekking on top of the list when it comes to once-in-a-lifetime travel experiences. The rainforest is a challenging environment, so if you want to trek, you need to be fairly fit, in good health &amp; equipped for humid, muddy conditions.  Even in the dry season, the steep slopes &amp; thick vegetation can be challenging for some, but if you’re up for the hike, it is worth every moment.","image":"optimized-images/bucket-list/5go-gorilla-trekking/1gogorilla-trekking-small.webp","folderName":"bucket-list/5go-gorilla-trekking","created":null},{"title":"Stay On a Private Island","description":"Nothing screams luxury quite like private island living.  And Africa’s Indian Ocean offers you a selection of private islands, each boasting pristine beaches, crystal-clear water &amp; total exclusivity.  A magnet for discerning travellers – romantics, honeymooners &amp; even families – a private island holiday is the perfect way to relax.  Snorkel, dive, swim, eat fresh seafood, get relaxing massages &amp; enjoy a wide selection of water sports.   Apart from the fact that private islands allow for total exclusivity, (no other resorts are found on the island) you can enjoy unspoilt beaches, untouched coral reefs &amp; even private butler services.","image":"optimized-images/bucket-list/6stay-on-a-private-island/1stayonaprivateisland-small.webp","folderName":"bucket-list/6stay-on-a-private-island","created":null}],"parentCards":[],"h1Title":"Bucket List","h2Title":"Unwind With Us","h3Title":"What's On The Bucket List?","whatWeLoveItems":["Tick off the Big 5 (& see Vic Falls)","Sleep in a treehouse under the stars","Enjoy a water-based safari","Float in a hot air balloon","Go gorilla-trekking","Stay on a private island"],"params":{"slug":["bucket-list"]},"level":1},"__N_SSG":true}