{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","category":"Our Clients Say","canon":true,"pageTitle":"Honeymoon In Style | Africa Unwind"},"content":"<p>We really appreciate all of Liselle’s support during our travels – she was extremely prompt in her response times &amp; we felt that she was always accessible, especially when we urgently needed her (after a natural disaster forced us to change lodges).</p>\n<p>In speaking with and comparing experiences with other travelers who were using some of the larger companies, we felt that we received a personalized &amp; top service from her. From the moment our itinerary was arranged to how she assisted us in finding substitute accommodations so quickly after a natural disaster. We were truly blown away by Lion Sands Ivory Lodge and also recognize that we likely received such a generous upgrade because of her local relationships.<br>We also appreciate Liselle being so responsive &amp; supportive while we struggled to board the flight to Mozambique (due to Covid restrictions). Though there was nothing that she could have done to influence a government restriction, we appreciate her spending so much time on the phone to clarify &amp; also knew she would have quickly assisted us in finding accomodations for that night if necessary. Luckily all worked out, &amp; we managed to board the flight to Mozambique!<br>As far as the accommodations, our personal reviews are as follows:</p>\n<ol>\n<li>Camissa House<br>The location &amp; views were stunning, the staff &amp; service was exceptional, &amp; the breakfasts were actually the best we had on the entire trip. We would recommend booking the terrace rooms.</li>\n<li>Ilios Tours &amp; Transfers<br>Our tour company was also exceptional - we lucked out with our tour guide, Shadley, &amp; requested him for every other tour we had, including Franschhoek. We had a wonderful time on our private tours &amp; appreciated the flexibility to do exactly as we wanted.</li>\n<li>La Cle des Montagnes<br>Another exceptional property with superb service, including an unbelievable breakfast. We really appreciated being within walking distance of downtown &amp; the yards in the back were just stunning. Overall, we were blown away by Franschhoek &amp; Stellenbosch &amp; look forward to returning to this special place! One note for future foodie travelers - we do recommend dining at La Petite Colombe &amp; to reserve this for a day where you have either a late start or one more day in Franschhoek.  This way, you won’t have to get up early the next day for your onward travel arrangements to the bush.</li>\n<li>Tanda Tula Plains Camp<br>This property was very personal, warm &amp; accommodating – with very good service as well. We felt like family at this lodge. The safari rides were exceptional &amp; our tracker &amp; guides were extremely knowledgeable. The food was also very good &amp; we enjoyed the bush breakfasts. All in all, Tanda Tula felt much more personal &amp; the wildlife viewing was most exceptional. (Although Lion Sands Ivory Lodge was our favourite &amp; felt like a higher end safari lodge in comparison to Tanda Tula Plains Camp.)</li>\n<li>Lion Sands Ivory lodge<br>Given the context of how we arrived here (upgraded by Africa Unwind after a natural disaster forced us to change safari lodges), I&#39;m not sure this would have been in our original budget. But this property was jaw dropping upon our arrival. We felt that we had truly arrived on &quot;honeymoon&quot; while staying in their Villa Suite. Though it&#39;s a large property, they managed to make our stay feel personal &amp; warm with exceptional service. The food was extremely well prepared &amp; high quality; however we preferred some of the other menu options earlier in our trip.<br>All in all, we are interested in returning to this property simply because of the rooms. And we feel it is easily accessible for other family members &amp; friends would be equally impressed with the accommodations.</li>\n<li>Azura Benguerra<br>We booked a beach villa, but upon arrival realised this specific villa needed maintenance, so we informed Liselle about it.  Once again, her service &amp; relationship equity to swiftly correct the problem was extraordinary. The upgrade we received in response was extremely generous. (Villa Amizade)  Our butler at this property was again exceptional &amp; provided a very personal experience…<br>We felt our every need was met!<br>Best regards,<br>Elizabeth &amp; Adam</li>\n</ol>\n","images":["optimized-images/BLOG/our-clients-say/honeymoon-in-style/01-Honeymoon-In-Style-large.webp","optimized-images/BLOG/our-clients-say/honeymoon-in-style/02-Honeymoon-In-Style-large.webp","optimized-images/BLOG/our-clients-say/honeymoon-in-style/03-Honeymoon-In-Style-large.webp","optimized-images/BLOG/our-clients-say/honeymoon-in-style/04-Honeymoon-In-Style-large.webp","optimized-images/BLOG/our-clients-say/honeymoon-in-style/05-Honeymoon-In-Style-large.webp","optimized-images/BLOG/our-clients-say/honeymoon-in-style/06-Honeymoon-In-Style-large.webp","optimized-images/BLOG/our-clients-say/honeymoon-in-style/07-Honeymoon-In-Style-large.webp","optimized-images/BLOG/our-clients-say/honeymoon-in-style/08-Honeymoon-In-Style-large.webp"],"subfolders":[{"title":"Big 5 Bucket List","description":"We had a fantastic trip!!  Where do I begin?? We loved all the camps.  Our favourite was probably Nottens, but our favourite location was Moremi.  The scenery and animals there were just so beautiful!  Each camp had something special and unique to offer.  ","image":"optimized-images/BLOG/our-clients-say/big-5-bucket-list/1-small.webp","folderName":"blog/our-clients-say/big-5-bucket-list"},{"title":"Blissful Babymoon","description":"We approached Liselle from Africa Unwind to help us plan a Babymoon in the winter months of South Africa.  Her recommendation did not disappoint.  We had an absolute blast at Cederberg Ridge Wilderness Lodge, being treated as royalty from the moment we arrived.  We had the peacefulness of a fireplace in our suite and sipping on local tea from the area. ","image":"optimized-images/BLOG/our-clients-say/blissful-babymoon/1-Blissful-Babymoon-small.webp","folderName":"blog/our-clients-say/blissful-babymoon"},{"title":"Botswana Magic","description":"We had a wonderful time in Botswana! Everything went smoothly &amp; according to plan &amp; we really enjoyed our stay at the three safari camps – Splash Camp in the Okavango Delta, Lebala Camp in the Linyanti &amp; The Elephant Camp at Victoria Falls, Zimbabwe.","image":"optimized-images/BLOG/our-clients-say/botswana-magic/1-Botswana-Magic-small.webp","folderName":"blog/our-clients-say/botswana-magic"},{"title":"Garden Route Getaway","description":"Liselle was amazing in structuring our holiday package! Along with the accommodation booking, she offered us a range of recommended activities in the area. All of which were great!  We appreciated the attention to detail, it removed all the guess work & uncertainty from the trip, ensuring that we relaxed and enjoyed the itinerary. We’ll definitely make use of Africa Unwind in the future!","image":"optimized-images/BLOG/our-clients-say/garden-route-getaway/1-Garden-Route-Getaway-small.webp","folderName":"blog/our-clients-say/garden-route-getaway"},{"title":"Honeymoon In Style","description":"We really appreciate all of Liselle’s support during our travels – she was extremely prompt in her response times &amp; we felt that she was always accessible, especially when we urgently needed her (after a natural disaster forced us to change lodges). In speaking with and comparing experiences with other travelers who were using some of the larger companies, we felt that we received a personalized &amp; top service from her. From the moment our itinerary was arranged to how she assisted us in finding substitute accommodations so quickly after a natural disaster. We were truly blown away by Lion Sands Ivory Lodge and also recognize that we likely received such a generous upgrade because of her local relationships. ","image":"optimized-images/BLOG/our-clients-say/honeymoon-in-style/01-Honeymoon-In-Style-small.webp","folderName":"blog/our-clients-say/honeymoon-in-style"},{"title":"Sabi Sand Safari","description":"We had a great time on safari, thanks to Liselle! Arathusa Safari Lodge was brilliant - especially with the waterhole full! We saw wild dogs, leopards & a cub as well as many lions & plenty of other wildlife.  The staff were brilliant & we will all certainly go back. Our stay in Camps Bay was also fantastic!","image":"optimized-images/BLOG/our-clients-say/sabi-sand-safari/1-Sabi-Sand-Safari-small.webp","folderName":"blog/our-clients-say/sabi-sand-safari"}],"parentCards":[{"title":"All Things Africa","image":"optimized-images/blog/all-things-africa/1-all-things-africa-small.webp","folderName":"blog/all-things-africa","isCurrentFolder":false},{"title":"Our Clients Say","image":"optimized-images/blog/our-clients-say/1-clients-say-small.webp","folderName":"blog/our-clients-say","isCurrentFolder":true},{"title":"We Say","image":"optimized-images/blog/we-say/1-we-say-small.webp","folderName":"blog/we-say","isCurrentFolder":false}],"h1Title":"Honeymoon In Style","h2Title":"Our Clients Say","h3Title":"Honeymoon In Style","whatWeLoveItems":[],"params":{"slug":["BLOG","our-clients-say","honeymoon-in-style"]},"level":3},"__N_SSG":true}