{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","created":"1 September 2022","category":"Our Clients Say","canon":true},"content":"<p>We had a fantastic trip!!  Where do I begin??</p>\n<p>We loved all the camps.  Our favourite was probably Nottens, but our favourite location was Moremi.  The scenery and animals there were just so beautiful!  Each camp had something special and unique to offer.  </p>\n<p>At Savute, the camp and the rooms were beautiful and we loved having the watering hole right in front to watch elephants and other animals drink day and night.  And the staff at Savute Safari Lodge were absolutely incredible.  They were so warm and friendly, and we felt like we really got to know them.  </p>\n<p>Camp Xakanaxa was beautiful, as was all of Moremi.  The staff there were also great and our guide, TS, was our favourite guide of the trip.  He was very knowledgeable and really fun! We would definitely go back to Moremi!  </p>\n<p>In South Africa we had some incredible wild dog encounters at Simbavati.  The property and the rooms were stunning!  And then Nottens was so special - we loved everyone there and loved that the rooms were more cabin like and had baths overlooking the game viewing area.  We also loved that we could walk around the property alone at night without a guide - that felt freeing!  And we had some truly incredible animal encounters in Sabi Sands.  We saw wild dogs fighting over a kill with a leopard and then another fight over a different kill between the wild dogs and hyena. </p>\n<p>We had a really special experiences at each place!  </p>\n<p>Amy Slechta</p>\n","images":["optimized-images/blog/our-clients-say/big-5-bucket-list/1-large.webp","optimized-images/blog/our-clients-say/big-5-bucket-list/2-large.webp","optimized-images/blog/our-clients-say/big-5-bucket-list/3-large.webp","optimized-images/blog/our-clients-say/big-5-bucket-list/4-large.webp","optimized-images/blog/our-clients-say/big-5-bucket-list/5-large.webp","optimized-images/blog/our-clients-say/big-5-bucket-list/6-large.webp","optimized-images/blog/our-clients-say/big-5-bucket-list/7moremi-lg-large.webp","optimized-images/blog/our-clients-say/big-5-bucket-list/8-large.webp","optimized-images/blog/our-clients-say/big-5-bucket-list/9-large.webp"],"subfolders":[{"title":"Sabi Sand Safari","description":"We had a great time on safari, thanks to Liselle! Arathusa Safari Lodge was brilliant - especially with the waterhole full! We saw wild dogs, leopards & a cub as well as many lions & plenty of other wildlife.  The staff were brilliant & we will all certainly go back. Our stay in Camps Bay was also fantastic!","image":"optimized-images/blog/our-clients-say/sabi-sand-safari/1-sabi-sand-safari-small.webp","folderName":"blog/our-clients-say/sabi-sand-safari","created":"22 May 2023"},{"title":"Garden Route Getaway","description":"Liselle was amazing in structuring our holiday package! Along with the accommodation booking, she offered us a range of recommended activities in the area. All of which were great!  We appreciated the attention to detail, it removed all the guess work & uncertainty from the trip, ensuring that we relaxed and enjoyed the itinerary. We’ll definitely make use of Africa Unwind in the future!","image":"optimized-images/blog/our-clients-say/garden-route-getaway/1-garden-route-getaway-small.webp","folderName":"blog/our-clients-say/garden-route-getaway","created":"1 December 2022"},{"title":"Big 5 Bucket List","description":"We had a fantastic trip!!  Where do I begin?? We loved all the camps.  Our favourite was probably Nottens, but our favourite location was Moremi.  The scenery and animals there were just so beautiful!  Each camp had something special and unique to offer.  ","image":"optimized-images/blog/our-clients-say/big-5-bucket-list/1-small.webp","folderName":"blog/our-clients-say/big-5-bucket-list","created":"1 September 2022"},{"title":"Blissful Babymoon","description":"We approached Liselle from Africa Unwind to help us plan a Babymoon in the winter months of South Africa.  Her recommendation did not disappoint.  We had an absolute blast at Cederberg Ridge Wilderness Lodge, being treated as royalty from the moment we arrived.  We had the peacefulness of a fireplace in our suite and sipping on local tea from the area. ","image":"optimized-images/blog/our-clients-say/blissful-babymoon/1-blissful-babymoon-small.webp","folderName":"blog/our-clients-say/blissful-babymoon","created":"1 September 2022"},{"title":"Botswana Magic","description":"We had a wonderful time in Botswana! Everything went smoothly &amp; according to plan &amp; we really enjoyed our stay at the three safari camps – Splash Camp in the Okavango Delta, Lebala Camp in the Linyanti &amp; The Elephant Camp at Victoria Falls, Zimbabwe.","image":"optimized-images/blog/our-clients-say/botswana-magic/1-botswana-magic-small.webp","folderName":"blog/our-clients-say/botswana-magic","created":null},{"title":"Honeymoon In Style","description":"We really appreciate all of Liselle’s support during our travels – she was extremely prompt in her response times &amp; we felt that she was always accessible, especially when we urgently needed her (after a natural disaster forced us to change lodges). In speaking with and comparing experiences with other travelers who were using some of the larger companies, we felt that we received a personalized &amp; top service from her. From the moment our itinerary was arranged to how she assisted us in finding substitute accommodations so quickly after a natural disaster. We were truly blown away by Lion Sands Ivory Lodge and also recognize that we likely received such a generous upgrade because of her local relationships. ","image":"optimized-images/blog/our-clients-say/honeymoon-in-style/01-honeymoon-in-style-small.webp","folderName":"blog/our-clients-say/honeymoon-in-style","created":null}],"parentCards":[{"title":"All Things Africa","image":"optimized-images/blog/all-things-africa/1-all-things-africa-small.webp","folderName":"blog/all-things-africa","isCurrentFolder":false},{"title":"Our Clients Say","image":"optimized-images/blog/our-clients-say/1-clients-say-small.webp","folderName":"blog/our-clients-say","isCurrentFolder":true},{"title":"We Say","image":"optimized-images/blog/we-say/1-we-say-small.webp","folderName":"blog/we-say","isCurrentFolder":false}],"h1Title":"Big 5 Bucket List","h2Title":"Our Clients Say","h3Title":"Big 5 Bucket List","whatWeLoveItems":[],"params":{"slug":["blog","our-clients-say","big-5-bucket-list"]},"level":3},"__N_SSG":true}