{"pageProps":{"frontmatter":{"title":"CRÈME DE LA CREME","subtitle":"","article_title":"","canon":true,"lodges":"Vumbura Plains\nZarafa Camp\nThorntree River Lodge\n"},"content":"<p style=\"visibility: collapse !important; margin-top: -10px;\">\n\n<p></p>\n</p>\n\n<h4>RATE</h4>\n<p><Rate>USD 12,000 + per person</Rate></p>\n<h4>AREAS</h4>\n<p>Botswana, Vic Falls (9 nights)</p>\n<h4>Trip Summary</h4>\n<ul>\n<li>3 nights:  Vumbura Plains, Okavango Delta – Botswana</li>\n<li>3 nights:  Zarafa Camp, Selinda – Botswana</li>\n<li>3 nights:  Thorntree River Lodge, Livingstone – Zambia</li>\n</ul>\n<h4>Trip Overview</h4>\n<h1></h1>\n<h4>Day 1:</h4>\n<p>Upon arrival at Maun International Airport, you will be transferred by light air to Vumbura Plains in the Okavango Delta, Botswana.</p>\n<h1></h1>\n<h4>Day 1 – 4:</h4>\n<p>Spend 3 nights at Vumbura Plains in a luxury suite on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 4:</h4>\n<p>Light air transfer from Vumbura Plains to Zarafa Camp in Selinda, Botswana.</p>\n<h1></h1>\n<h4>Day 4 - 7:</h4>\n<p>Spend 3 nights at Zarafa Camp in a luxury tent on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 7:</h4>\n<p>Light air transfer from Zarafa Camp to Livingstone International Airport, Zambia.</p>\n<p>Road transfer from Livingstone International Airport to Thorntree River Lodge in Livingstone, Zambia.</p>\n<h1></h1>\n<h4>Day 7 - 10:</h4>\n<p>Spend 3 nights at Thorntree River Lodge in a luxury suite on a fully inclusive basis.</p>\n<p>(Activities include game drives in Mosi-oa-Tunya National Park, rhino tracking, bush walks, sunrise &amp; sunset boat cruises, Simonga Village visits, a visit to the Zambian side of the Falls, a visit to the Zimbabwean side of the Falls in low water season (exclude visa fees), a visit to the Livingstone Museum, canoe trips, a visit to Maramba &amp; Makuni Markets &amp; catch &amp; release fishing.)</p>\n<h1></h1>\n<h4>Day 10:</h4>\n<p>Road transfer from Thorntree River Lodge to Livingstone International Airport.</p>\n<p>Depart Livingstone International Airport as per own arrangements.</p>\n<p>End of trip.</p>\n<h4>Inclusions</h4>\n<ul>\n<li>All light air transfers</li>\n<li>All road transfers</li>\n<li>All mentioned accommodations</li>\n<li>All meals, drinks (soft &amp;amp; alcoholic) &amp;amp; activities</li>\n</ul>\n<h4>Exclusions</h4>\n<ul>\n<li>International flights</li>\n<li>Visas (if necessary)</li>\n<li>Travel Insurance</li>\n</ul>\n","images":["optimized-images/favourite/3exclusive/1creme-de-la-creme/1cremde-de-la-creme-large.webp","optimized-images/favourite/3exclusive/1creme-de-la-creme/2creme-de-la-creme-large.webp","optimized-images/favourite/3exclusive/1creme-de-la-creme/3creme-de-la-creme-large.webp","optimized-images/favourite/3exclusive/1creme-de-la-creme/4creme-de-la-creme-large.webp","optimized-images/favourite/3exclusive/1creme-de-la-creme/5creme-de-la-creme-large.webp","optimized-images/favourite/3exclusive/1creme-de-la-creme/6creme-de-la-creme-large.webp","optimized-images/favourite/3exclusive/1creme-de-la-creme/7creme-de-la-creme-large.webp","optimized-images/favourite/3exclusive/1creme-de-la-creme/8creme-de-la-creme-large.webp"],"subfolders":[{"title":"VUMBURA PLAINS","description":"Vumbura Plains is a premier camp set within a private concession in the extreme northern section of the Okavango Delta.  The concession includes an enormous traversing area of 60,000 hectares, ensuring phenomenal game viewing year-round.\n\nA unique feature at Vumbura Plains is its remote position in a corner of the Okavango Delta.  This position encompasses a wide variety of wildlife that has representatives of just about every animal that occurs in the Okavango biome.\nThis is Botswana luxury at its finest.\n\nVumbura Plains offers a high-end luxury safari experience like no other.  The camp comprises two separate 6-roomed camps – Vumbura North &amp; Vumbura South, each with a private dining, lounge &amp; bar area overlooking the magnificent vistas of the Okavango Delta.\nEach spacious suite is raised off the ground on wooden decks &amp; comprises an en-suite bedroom with a lounge as well as an outdoor shower with wonderful views over the floodplains.  Each suite also has a private plunge pool &amp; sala where guests can relax or read while sipping a cocktail.\nThere are also 2 family tents at Vumbura North, comprising 2 en-suite bedrooms.\nThe main area boasts a star-gazing deck &amp; campfire, the ideal place to relax after a day out in the bush.","image":"optimized-images/default.webp","folderName":"safaris/botswana/okavango-delta/vumbura-plains","created":null},{"title":"ZARAFA CAMP","description":"Zarafa Camp overlooks the magnificent Zibadianja Lagoon – the source of the world-famous Savute Channel.\nThe Selinda Reserve is famous for its massive herds of elephants &amp; large populations of predators, such as lion, leopard, cheetah &amp; wild dog.   Abundant plains game can also be found here, including kudu, buffalo, zebra &amp; giraffe.\n\nZarafa Camp consists of only 4 luxuriously appointed safari tents.  Hosting a maximum of 8 guests, the emphasis at Zarafa Camp is on offering guests a private or exclusive safari experience.  \nEach tent has a private veranda, positioned under shady trees with breathtaking views of the Zibadianja Lagoon.  The bedrooms are large &amp; have en-suite bathrooms, featuring a copper bath as well as indoor &amp; outdoor showers.\n\nZarafa Camp is furnished in 20th-century décor &amp; finishes.  The main area consists of a lounge &amp; dining area – both set under canvas as well as a large viewing deck shaded by giant trees.","image":"optimized-images/default.webp","folderName":"safaris/botswana/selinda-game-reserve/zarafa-camp","created":null},{"title":"THORNTREE RIVER LODGE","description":"Thorntree River Lodge, one of Zambia’s most contemporary lodges boasts a spectacular setting on the legendary Zambezi River, just upstream from Zambia’s biggest drawcard:  the mighty Victoria Falls.\nThorntree has an eco-concious design that incorporates nature &amp; 21-century living.  \nWith a superb location, guests have easy access to the Falls &amp; all the fun-filled activities it has to offer, while allowing peace &amp; tranquility in a pristine riverfront setting.\n\nSmall &amp; intimate, with only 8 suites &amp; 2 family suites, Thorntree River Lodge gives guests a boutique experience on the river’s edge.\nEach suite has an indoor &amp; outdoor en-suite bathroom &amp; a private plunge pool with spectacular river views.\nThe 2 family units have inter-leading walkways between the 2 bedrooms, which are both en-suite.  Each unit has its own indoor &amp; outdoor bathroom as well as luxurious plunge pool. \nThorntree’s central area comprises a temperature-controlled wine cellar, gym, spa, dining room, lounge &amp; swimming pool.\n\nTheir private boat is ideal for romantic sunset river cruises down the Zambezi &amp; guests have the choice of swimming in the communal infinity pool or even better – their own private plunge pool.\nGuests can also use the gym or book relaxing treatments at the spa.  Children can join the Ngwana Kids Club to learn more about nature during their time at Thorntree.\nActivities at Victoria Falls include elephant interactions, microlight flights over the Falls, river rafting, canoe safaris on the mighty Zambezi River, day trips to Livingstone Island, swimming at Devil’s Pool &amp; much more.","image":"optimized-images/default.webp","folderName":"cities/livingstone/thorntree-river-lodge","created":null}],"parentCards":[{"title":"Charming","image":"optimized-images/favourite/1charming/1charming-small.webp","folderName":"favourite/1charming","isCurrentFolder":false},{"title":"2Stylish","image":"optimized-images/favourite/2stylish/1stylish-small.webp","folderName":"favourite/2stylish","isCurrentFolder":false},{"title":"3Exclusive","image":"optimized-images/favourite/3exclusive/1exclusive-small.webp","folderName":"favourite/3exclusive","isCurrentFolder":true}],"h1Title":"Creme De La Creme","h2Title":"Exclusive","h3Title":"Creme De La Creme","whatWeLoveItems":["Experience Botswana & Vic Falls’ premier lodges","Stay in luxury – spacious suites, private pools & outdoor showers","Encounter Africa’s predators during day & night drives","Enjoy river views & romantic sunset boat cruises","Witness the majestic Victoria Falls","Swim at the edge of the Falls – season dependent"],"params":{"slug":["favourite","3exclusive","1creme-de-la-creme"]},"level":3},"__N_SSG":true}