{"pageProps":{"frontmatter":{"title":"PRIDE OF AFRICA","subtitle":"","article_title":"","canon":true,"lodges":"The One Above\nSingita Sweni\nSingita Boulders Lodge\nRoyal Chundu\n"},"content":"<p style=\"visibility: collapse !important; margin-top: -10px;\">\n\n<p></p>\n</p>\n\n<h4>RATE</h4>\n<p><Rate>USD 12,000 + per person</Rate></p>\n<h4>AREAS</h4>\n<p>Cape Town, Kruger, Vic Falls (12 nights)</p>\n<h4>Trip Summary</h4>\n<ul>\n<li>3 nights:  The One Above, Cape Town – South Africa</li>\n<li>3 nights:  Singita Sweni, Kruger Concession/Kruger – South Africa</li>\n<li>3 nights:  Singita Boulders, Sabi Sand/Kruger – South Africa</li>\n<li>3 nights:  Royal Chundu, Livingstone – Zambia</li>\n</ul>\n<h4>Trip Overview</h4>\n<h1></h1>\n<h4>Day 1:</h4>\n<p>Upon arrival at Cape Town International Airport, you will be transferred by road to The One Above in Cape Town, South Africa.</p>\n<h1></h1>\n<h4>Day 1 – 4:</h4>\n<p>Spend 3 nights at The One Above (exclusive-use) on a bed &amp; breakfast basis.</p>\n<p>During your stay, you will depart on a Full Day Cape Point &amp; Peninsula Tour &amp; a Half Day City &amp; Table Mountain Tour. (private vehicle &amp; guide)</p>\n<h1></h1>\n<h4>Day 4:</h4>\n<p>Road transfer from The One Above to Cape Town International Airport.</p>\n<p>Scheduled flight from Cape Town to Nelspruit with South African Airways – economy.</p>\n<p>Light air transfer from Nelspruit International Airport to Singita Sweni in the Kruger Concession, Kruger.</p>\n<h1></h1>\n<h4>Day 4 - 7:</h4>\n<p>Spend 3 nights at Singita Sweni in a luxury suite on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 7:</h4>\n<p>Light air transfer from Singita Sweni to Singita Boulders in the Sabi Sand Reserve, Kruger.</p>\n<h1></h1>\n<h4>Day 7 – 10:</h4>\n<p>Spend 3 nights at Singita Boulders in a luxury suite on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 10:</h4>\n<p>Light air transfer from Singita Boulders to Johannesburg International Airport.</p>\n<p>Depart Johannesburg International Airport as per own arrangements.</p>\n<p>End of trip.</p>\n<h4>Inclusions</h4>\n<ul>\n<li>All regional flights</li>\n<li>All road transfers</li>\n<li>All light air transfers</li>\n<li>All mentioned private tours &amp;amp; activities</li>\n<li>All mentioned accommodations</li>\n<li>On safari&#58;  All meals, drinks (soft &amp;amp; alcoholic) &amp;amp; activities</li>\n<li>Elsewhere&#58;  Bed &amp;amp; breakfast basis</li>\n</ul>\n<h4>Exclusions</h4>\n<ul>\n<li>International flights from home</li>\n<li>Visas (if necessary)</li>\n<li>Travel Insurance</li>\n</ul>\n","images":["optimized-images/favourite/3exclusive/2pride-of-africa/1pride-of-africa-large.webp","optimized-images/favourite/3exclusive/2pride-of-africa/2pride-of-africa-large.webp","optimized-images/favourite/3exclusive/2pride-of-africa/3pride-of-africa-large.webp","optimized-images/favourite/3exclusive/2pride-of-africa/4pride-of-africa-large.webp","optimized-images/favourite/3exclusive/2pride-of-africa/5pride-of-africa-large.webp","optimized-images/favourite/3exclusive/2pride-of-africa/6pride-of-africa-large.webp","optimized-images/favourite/3exclusive/2pride-of-africa/7pride-of-africa-large.webp","optimized-images/favourite/3exclusive/2pride-of-africa/8pride-of-africa-large.webp"],"subfolders":[{"title":"THE ONE ABOVE","description":"Welcome to Cape Town’s most sophisticated penthouse.  The One Above’s location cannot be closer to perfect – atop the One &amp; Only Cape Town, with unobstructed views of Table Mountain, Robben Island, Devil’s Peak, Lion’s Head, the Cape Town Harbor &amp; the V&amp;A Waterfront.\nThe One Above offers everything you could wish for – from a private butler &amp; chef team, a wrap-around entertainment deck with 2 swimming pools to an exquisite wine loft with 280 vintages.  The penthouse also has a private gym &amp; sauna.\nThe One Above is the ideal choice for discerning travellers who understand &amp; appreciate luxury &amp; attention to detail.  It is perfect for business or pleasure, for families of all ages or friends travelling together.  A private butler &amp; chef team will take care of your every need.\nOn your doorstep, you will find a city full of amazement.  Guests are a stone’s throw away from Table Mountain, the V&amp;A Waterfront with its trendy shops, cafes &amp; restaurants &amp; other top attractions.  The blue flag beaches of Camps Bay &amp; Clifton are only a short drive away.\n\nThe penthouse consists of 4 stylish suites, each with an en-suite bathroom.  The expansive master suite features an elegant sitting area with a fireplace, a dressing room &amp; double en-suite bathrooms.  The 3 other spacious suites have private balconies overlooking the iconic Table Mountain &amp; the lavish en-suite bathrooms boast enormous bathtubs, showers &amp; marble fittings.\nThe penthouse offers several indoor &amp; outdoor dining areas, a roof-top entertainment area with 2 swimming pools, 2 sun-flooded living rooms, a private gym with a sauna &amp; steam room as well as a cosy library with a fireplace.  There is also a large &amp; well-appointed kitchen with state-of-the-art equipment.\n\nThere is a never-ending list of things to do in Cape Town – from visiting Clifton &amp; Camps Bay beaches, shopping at the V&amp;A Waterfront &amp; wine-tasting in the Cape Winelands to spending time with the adorable penguins at Boulders Beach or having a picnic in Kirstenbosch Gardens.\nOther options like shark-cage diving or whale watching can also be arranged.  Cape Town offers a variety of nature trails, hikes, picnic spots &amp; adventure sports like kite surfing, windsurfing, stand-up paddleboarding, paragliding, sandboarding, horse riding &amp; much more.","image":"optimized-images/default.webp","folderName":"cities/cape-town/the-one-above","created":null},{"title":"SINGITA SWENI","description":"The Singita brand of lodges offers a premier safari experience like no other!  Contemporary &amp; luxurious in style, Singita will exceed expectations from beginning to end.\nThe ultra-modern &amp; beautifully decorated Singita Sweni is located within a private concession in the Kruger National Park &amp; boasts some of the best wildlife viewing in the country.\nDiscerning travellers fall in love with Sweni’s soft &amp; intimate interiors that carefully illuminates the textures &amp; shades of the bush.\n\nSingita Sweni is the smallest of all the Singita lodges, with six 1-bedroom suites tucked away among the trees.  \nDesigned with open-plan living in mind, each suite is equipped with a gorgeous bed, comfortable sitting area, private viewing deck &amp; en-suite bathroom with bath, indoor &amp; outdoor shower.  For a magical experience, guests can even sleep out under the stars on their private day bed.\nThere is also a pool suite for families or honeymoon couples.  This suite includes a swimming pool &amp; a shaded riverfront deck with sala &amp; an outdoor shower.  Guests staying in the pool suite will also have access to a private lounge &amp; dining area.\nThe main lodge overlooks the beautiful Sweni River where resident hippos are frequently seen.  The central area also features a lounge, bar, fireplace, swimming pool &amp; wine cellar.  Guests can also visit The Village, home to an art gallery, gym &amp; spa, along with a fascinating interactive ranger centre.\n\nA variety of activities are available at Singita Sweni.  Some of these include open 4x4 game drives, nature walks with a qualified guide, spa treatments, exercising at the gym, star gazing or swimming.\nGuests can also purchase wines from the Premier Wine Boutique or enjoy a cooking course from their Community Culinary School.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/kruger-national-park/kruger-private-concession/singita-sweni","created":null},{"title":"SINGITA BOULDERS LODGE","description":"Singita Boulders Lodge is – without a doubt - one of the Greater Kruger’s best premier camps.  Located in the world-renowned Sabi Sand Reserve, adjacent to the Kruger National Park, Singita provides excellent game viewing year-round.\nThe lodge welcomes discerning travellers from across the globe to come &amp; experience a safari in the lap of luxury.\nThe focus at Singita is not only on luxurious accommodation, fine dining &amp; exceptional service, but their legendary rangers &amp; trackers will strive to deliver some of the best Big 5 wildlife viewing in the country.\n\nSingita Boulders Lodge has 8 river suites, 2 bush suites &amp; 2 two-bedroom family suites.   \nEach suite consists of a sumptuous bathroom with an indoor &amp; outdoor shower, an expansive living area with a double-sided fireplace as well as a private deck with a heated plunge pool.\nThe river suites boast gorgeous river views, the bush suites enjoy expansive views over the bush &amp; the 2-bedroom family suite is ideal for families travelling with children.\nThe main area consists of a bar, dining room, gym, lounge, spa &amp; TV Room as well as a large viewing deck with pool &amp; comfortable seating where guests occasionally see herds of elephants wander by.  Boulders Lodge also has an exceptional wine cellar with a wide variety of wines on display.\n\nSingita Boulders Lodge offers a range of exciting activities.  Some of these including open 4x4 game drives twice a day, guided safari walks, mountain biking, archery &amp; spa treatments.\nGuests can also make use of their fully equipped gym, shop at the gallery, cool off in the swimming pool, read in the library, taste wines from the cellar or visit one one of the local villages.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/kruger-national-park/sabi-sand-private-game-reserve/singita-boulders-lodge","created":null},{"title":"ROYAL CHUNDU","description":"Zambia’s family-owned &amp; run Royal Chundu is set on a private stretch of riverbank on the the Zambezi River, just upstream of the iconic Victoria Falls.\nRoyal Chundu consists of 2 lodges – River Lodge &amp; Island Lodge, &amp; as the name suggests, both properties are fit for royalty.  Ideal for honeymooners, couples or families, Royal Chundu is all about exceeding expectations.\nThe lodge is only a 40-minute drive from the Falls, making it the ideal base to explore this world wonder.\n\nRiver Lodge at Royal Chundu is the main hub &amp; the larger of the 2 lodges.  There are 10 beautifully appointed, spacious riverfront suites, each with en-suite bathroom, air-conditioning &amp; a generous deck with spectacular views.\nThe entire lodge looks out onto the mighty Zambezi River on the opposite side of the river.\nIsland Lodge at Royal Chundu is the more private &amp; exclusive of the 2 lodges.  With a stunning location on Katambura Private Island, the lodge is surrounded by gentle river channels &amp; lush trees.  There are 4 elegant, air-conditioned villas at Island Lodge, each comprising an en-suite bathroom with large open-air bath &amp; a spectacular deck with views.\n\nApart from visiting the thundering Victoria Falls, guests may choose to take a short mokoro (dug-out canoe) trip to a local village or visit one of the local villages.  Game drives &amp; birding are also popular activities.\nIn additional to the above, guests can also do a trip to Livingstone town &amp; enjoy a microlight flights over the Falls, river rafting or sunset boat cruises on the Zambezi.\nA highlight is having lunch at Livingstone Island &amp; swimming at Devil’s Pool – the edge of the mighty Vic Falls.","image":"optimized-images/default.webp","folderName":"cities/livingstone/royal-chundu","created":null}],"parentCards":[{"title":"Charming","image":"optimized-images/favourite/1charming/1charming-small.webp","folderName":"favourite/1charming","isCurrentFolder":false},{"title":"2Stylish","image":"optimized-images/favourite/2stylish/1stylish-small.webp","folderName":"favourite/2stylish","isCurrentFolder":false},{"title":"3Exclusive","image":"optimized-images/favourite/3exclusive/1exclusive-small.webp","folderName":"favourite/3exclusive","isCurrentFolder":true}],"h1Title":"Pride Of Africa","h2Title":"Exclusive","h3Title":"Pride Of Africa","whatWeLoveItems":["Experience stylish penthouse living in Cape Town","Enjoy spectacular views of Table Mountain from your rooftop deck","See the bush from a bird’s eye view – luxurious small plane transfers","Stay in South Africa’s very best:  Singita lodges","Get up, close & person with Africa’s famous Big 5","Witness the majestic Victoria Falls"],"params":{"slug":["favourite","3exclusive","2pride-of-africa"]},"level":3},"__N_SSG":true}