{"pageProps":{"frontmatter":{"title":"ROYAL RWANDA","subtitle":"","article_title":"","canon":true,"lodges":"The Retreat by Heaven\nMagashi Camp\nBisate Lodge\n"},"content":"<p style=\"visibility: collapse !important; margin-top: -10px;\">\n\n<p></p>\n</p>\n\n<h4>RATE</h4>\n<p><Rate>USD 12,000 + per person</Rate></p>\n<h4>AREAS</h4>\n<p>Kigali, Akagera, Volcanoes National Park (7 nights)</p>\n<h4>Trip Summary</h4>\n<ul>\n<li>1 night:  The Retreat by Heaven, Kigali - Rwanda</li>\n<li>3 nights:  Magashi Camp, Akagera – Rwanda</li>\n<li>3 nights:  Bisate Lodge, Volcanoes National Park – Rwanda</li>\n</ul>\n<h4>Trip Overview</h4>\n<h1></h1>\n<h4>Day 1:</h4>\n<p>Upon arrival at Kigali International Airport, you will be transferred by road to The Retreat by Heaven in Kigali, Rwanda.</p>\n<p>Overnight at The Retreat by Heaven in a superior king suite on a dinner, bed &amp; breakfast basis.</p>\n<h1></h1>\n<h4>Day 2:</h4>\n<p>Road transfer from The Retreat by Heaven to Kigali International Airport.</p>\n<p>Helicopter transfer from Kigali International Airport to Magashi Camp in Akagera, Rwanda.</p>\n<h1></h1>\n<h4>Day 2 – 5:</h4>\n<p>Spend 3 nights at Magashi Camp in a luxury tent on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 5:</h4>\n<p>Helicopter transfer from Magashi Camp to Bisate Lodge in Volcanoes National Park, Rwanda.</p>\n<h1></h1>\n<h4>Day 5 – 8:</h4>\n<p>Spend 3 nights at Bisate Lodge in a forest villa on a fully inclusive basis.</p>\n<p>During your stay, you will depart on a Gorilla-Trekking Safari &amp; spend 1 hour with habituated mountain gorillas.</p>\n<p>(Other inclusive activities are:  golden monkey trekking, cultural village visits, guided walks &amp; visits to Diane Fossey’s grave.)</p>\n<h1></h1>\n<h4>Day 8:</h4>\n<p>Helicopter transfer from Bisate Lodge to Kigali International Airport.</p>\n<p>Depart Kigali International Airport as per own arrangements.</p>\n<p>End of trip.</p>\n<h4>Inclusions</h4>\n<ul>\n<li>All road transfers</li>\n<li>All helicopter transfers</li>\n<li>All mentioned private tours &amp;amp; activities</li>\n<li>All mentioned accommodations</li>\n<li>On safari&#58;  All meals, drinks (soft &amp;amp; alcoholic) &amp;amp; activities</li>\n<li>Elsewhere&#58;  Dinner, bed &amp;amp; breakfast basis</li>\n</ul>\n<h4>Exclusions</h4>\n<ul>\n<li>International flights</li>\n<li>Visas (if necessary)</li>\n<li>Travel Insurance</li>\n</ul>\n","images":["optimized-images/favourite/3exclusive/3royal-rwanda/1royal-rwanda-large.webp","optimized-images/favourite/3exclusive/3royal-rwanda/2royal-rwanda-large.webp","optimized-images/favourite/3exclusive/3royal-rwanda/3royal-rwanda-large.webp","optimized-images/favourite/3exclusive/3royal-rwanda/4royal-rwanda-large.webp","optimized-images/favourite/3exclusive/3royal-rwanda/5royal-rwanda-large.webp","optimized-images/favourite/3exclusive/3royal-rwanda/6royal-rwanda-large.webp","optimized-images/favourite/3exclusive/3royal-rwanda/7royal-rwanda-large.webp","optimized-images/favourite/3exclusive/3royal-rwanda/8royal-rwanda-large.webp"],"subfolders":[{"title":"THE RETREAT BY HEAVEN","description":"The Retreat by Heaven is arguably Kigali’s best premier boutique hotel.  Located in the heart of the capital, The Retreat provides a tranquil sanctuary after a long-haul flight or an exhilarating gorilla trek.\nThe hotel is a forerunner when it comes to lightening its environmental impact &amp; is therefore powered by sunlight.  \nTheir casual onsite restaurant – aptly named, Heaven – serves up fresh local produce turned into international dishes while Fushion serves fine dining cuisine with the indigenous garden &amp; pool as the backdrop.\n\nThe Retreat by Heaven offers 3 deluxe rooms, 8 superior suites, 3 master suites &amp; 8 luxury pool villas.  All rooms include en-suite bathrooms.  \nThe deluxe rooms have furnished patios while the superior suites have furnished front balconies, private back decks as well as separate sitting areas.\nThe master suites are slightly larger than the superior suites &amp; overlook the pool area.\nThe luxury pool villas boast private saltwater heated plunge pools as well as bedrooms with full living areas &amp; 120 square meters of indoor &amp; outdoor private living space.\nThe main area comprises a spa, gym, 2 restaurants, bar &amp; saltwater swimming pool.\n\nDay trips to Volcanoes National Park, Lake Kivu &amp; Akagera National Park can be arranged. Guests can also book Kigali City Tours or visit the Kigali Genocide Memorial, Ivuka Arts Centre or Kigali Golf Club.","image":"optimized-images/default.webp","folderName":"cities/kigali/the-retreat-by-heaven","created":null},{"title":"MAGASHI CAMP","description":"Magashi Camp boasts a spectacular setting overlooking the scenic Lake Rwanyakazinga in the only exclusive-use area of Rwanda’s triumphant Akagera National Park.\nLake Rwanyakazinga is home to one of Africa’s highest densities of hippo &amp; thanks to successful wildlife restoration operations &amp; strict anti-poaching laws, Akagera has become the biggest protected wetland in Central Africa.  \nOnce again home to the Big 5, Akagera is also one of the best birding areas in the world, with 500 recorded species, including the perplexing stork-like shoebill (also known as whale head).\n\nMagashi Camp includes 6 spacious &amp; airy canvas tents, offering uninterrupted views over Lake Rwanyakazinga.  Each tent has en-suite facilities with an indoor shower &amp; separate toilet.\nThe tents are connected to the main area by elevated wooden walkways.  The main area comprises a luxurious lounge, dining area, bar &amp; pool as well as an expansive viewing deck with a fire pit.\n\nSafari activities at Magashi are ample.  Boat safaris on Lake Rwanyakanzinga is an excellent way to view the area’s aquatic animals &amp; water birds while thrilling game drives &amp; night drives will enable guests to view predators &amp; other land animals.  \nGuided walking safaris &amp; catch-&amp;-release fishing throughout the year are also on offer.  \nA Big 5 safari in Akagera National Park combines easily with a once-in-a-lifetime gorilla-trekking adventure in Rwanda’s Volcanoes National Park.","image":"optimized-images/default.webp","folderName":"safaris/rwanda/akagera-national-park/magashi-camp","created":null},{"title":"BISATE LODGE","description":"Located in the world-renowned Volcanoes National Park, Bisate Lodge boasts dramatic forest views over the Bisoke &amp; Karisimbi volcano peaks.\nThe Volcanoes National Park is located along the western branch of the East African Rift – one of the most important biodiversity hotspots on the continent that is home to over 60 birds &amp; mammal species found nowhere else on earth.  \nThe most celebrated of these is the mountain gorilla, &amp; here guests will have the opportunity to encounter one of 10 habituated family groups inside the park.\n\nBisate Lodge features 6 opulent en-suite forest villas, each equipped with an en-suite bathroom, central fireplace &amp; private deck with breathtaking views over Mount Bisoke.  \nThe main area comprises a lounge, dining area, bar, wine cellar &amp; viewing deck.  The architecture &amp; interiors are rooted in the Rwandan culture.\n\nApart from gorilla trekking, other activities include community visits, birding, golden monkey tracking, visiting the spectacular twin lakes of Buhondo &amp; Burera, seeing the lava tunnels of the Musanze Caves as well as Dian Fossey’s burial site.","image":"optimized-images/default.webp","folderName":"safaris/rwanda/volcanoes-national-park/bisate-lodge","created":null}],"parentCards":[{"title":"Charming","image":"optimized-images/favourite/1charming/1charming-small.webp","folderName":"favourite/1charming","isCurrentFolder":false},{"title":"2Stylish","image":"optimized-images/favourite/2stylish/1stylish-small.webp","folderName":"favourite/2stylish","isCurrentFolder":false},{"title":"3Exclusive","image":"optimized-images/favourite/3exclusive/1exclusive-small.webp","folderName":"favourite/3exclusive","isCurrentFolder":true}],"h1Title":"Royal Rwanda","h2Title":"Exclusive","h3Title":"Royal Rwanda","whatWeLoveItems":["Trek through the forest in search of mountain gorillas","Enjoy Big 5 game viewing","Go on thrilling game drives, guided walks, night drives & boating safaris","Experience one of the world’s best birding areas:  over 500 recorded species","Stay in luxury","Enjoy a boutique-style safari experience"],"params":{"slug":["favourite","3exclusive","3royal-rwanda"]},"level":3},"__N_SSG":true}