{"pageProps":{"frontmatter":{"title":"TANZANIA BUSH &amp;amp; BEACH","subtitle":"","article_title":"","canon":true,"lodges":"Arusha Coffee Lodge\nLake Manyara Tree Lodge\nNgorongoro Crater Lodge\nNamiri Plains\nMnemba Island Lodge\n"},"content":"<p style=\"visibility: collapse !important; margin-top: -10px;\">\n\n<p></p>\n</p>\n\n<h4>RATE</h4>\n<p><Rate>USD 12,000 + per person</Rate></p>\n<h4>AREAS</h4>\n<p>Arusha, Lake Manyara, Ngorongoro Crater, Serengeti, Zanzibar (12 nights)</p>\n<h4>Trip Summary</h4>\n<ul>\n<li>1 night:  Arusha Coffee Lodge, Arusha – Tanzania</li>\n<li>2 nights:  Lake Manyara Tree Lodge, Lake Manyara – Tanzania</li>\n<li>2 nights:  Ngorongoro Crater Lodge, Ngorongoro Crater – Tanzania</li>\n<li>3 nights:  Namiri Plains, Serengeti – Tanzania</li>\n<li>4 nights:  Mnemba Island Lodge, Mnemba Island – Zanzibar</li>\n</ul>\n<h4>Trip Overview</h4>\n<h1></h1>\n<h4>Day 1:</h4>\n<p>Upon arrival at Kilimanjaro International Airport, you will be transferred by road to Legendary Arusha Coffee Lodge in Arusha, Tanzania.</p>\n<p>Overnight at Arusha Coffee Lodge in a plantation suite on a bed &amp; breakfast basis.</p>\n<h1></h1>\n<h4>Day 2:</h4>\n<p>Road transfer from Arusha Coffee Lodge to Arusha Airport.</p>\n<p>Light air transfer from Arusha Airport to Lake Manyara Tree Lodge in Lake Manyara, Tanzania.</p>\n<h1></h1>\n<h4>Day 2 – 4:</h4>\n<p>Spend 2 nights at Lake Manyara Tree Lodge in a luxury treehouse suite on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 4:</h4>\n<p>Light air transfer from Lake Manyara Tree Lodge to Ngorongoro Crater Lodge in Ngorongoro Crater, Tanzania.</p>\n<h1></h1>\n<h4>Day 4 – 7:</h4>\n<p>Spend 3 nights at Ngorongoro Crater Lodge in a luxury suite on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 7:</h4>\n<p>Light air transfer from Ngorongoro Crater Lodge to Namiri Plains in the Serengeti, Tanzania.</p>\n<h1></h1>\n<h4>Day 7 – 10:</h4>\n<p>Spend 3 nights at Namiri Plains in a luxury tent on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 10:</h4>\n<p>Light air transfer from Namiri Plains (Seronera Airstrip) to Zanzibar International Airport.</p>\n<p>Road &amp; boat transfer from Zanzibar International Airport to Mnemba Island Lodge in Zanzibar.</p>\n<h1></h1>\n<h4>Day 10 – 14:</h4>\n<p>Spend 4 nights at Mnemba Island Lodge in a luxury beach banda on a fully inclusive basis.</p>\n<p>(Inclusive activities are: swimming, diving, snorkelling &amp; stand-up paddleboarding) </p>\n<h1></h1>\n<h4>Day 14:</h4>\n<p>Boat &amp; road transfer to Zanzibar International Airport.</p>\n<p>Depart Zanzibar International Airport as per own arrangements.</p>\n<p>End of trip.</p>\n<h4>Inclusions</h4>\n<ul>\n<li>All road transfers</li>\n<li>All light air transfers</li>\n<li>All boat transfers</li>\n<li>All mentioned accommodations</li>\n<li>On safari &amp;amp; in Zanzibar&#58;  All meals, drinks (soft &amp;amp; alcoholic) &amp;amp; activities</li>\n<li>Elsewhere&#58;  Bed &amp;amp; breakfast basis</li>\n</ul>\n<h4>Exclusions</h4>\n<ul>\n<li>International flights</li>\n<li>Visas (if necessary)</li>\n<li>Travel Insurance</li>\n</ul>\n","images":["optimized-images/favourite/3exclusive/4tanzania-bush-beach/1tanzania-bush-beach-large.webp","optimized-images/favourite/3exclusive/4tanzania-bush-beach/2tanzania-bush-beach-large.webp","optimized-images/favourite/3exclusive/4tanzania-bush-beach/3tanzania-bush-beach-large.webp","optimized-images/favourite/3exclusive/4tanzania-bush-beach/4tanzania-bush-beach-large.webp","optimized-images/favourite/3exclusive/4tanzania-bush-beach/5tanzania-bush-beach-large.webp","optimized-images/favourite/3exclusive/4tanzania-bush-beach/6tanzania-bush-beach-large.webp","optimized-images/favourite/3exclusive/4tanzania-bush-beach/7tanzania-bush-beach-large.webp","optimized-images/favourite/3exclusive/4tanzania-bush-beach/8tanzania-bush-beach-large.webp"],"subfolders":[{"title":"ARUSHA COFFEE LODGE","description":"With a beautiful setting on the outskirts of Arusha on Tanzania’s largest coffee plantation, Arusha Coffee Lodge boasts a luxurious historic atmosphere &amp; glorious views of towering Mount Meru.\nThe lodge is located just 5 minutes from Arusha Airport &amp; the ideal stopover before or after a Tanzania safari.\nArusha Coffee Lodge’s guests can enjoy relaxing strolls along the rows of lush-green plantations or taste fresh coffee from their on-site coffee shop or patisserie.\n\nThere are 18 plantation rooms &amp; 12 plantation suites at Arusha Coffee Lodge.\nThe plantation rooms are comfortably furnished &amp; nestled among the aromatic coffee trees.  Each room features an en-suite bathroom with shower &amp; bath, an in-room log fire &amp; a veranda offering beautiful views over the surrounding green coffee garden.\nProviding a modern yet homely retreat among the coffee trees, the plantation suites include en-suite bathrooms with rainfall showers, lavish bathtubs &amp; private terraces with log fires.\nThe lodge’s main area features an outdoor restaurant for al fresco dining, a bar, swimming pool &amp; wellness spa that offers a range of relaxing treatments.\n\nActivities at Arusha Coffee Lodge are ample!  \nThey include the “Bean-to-Cup coffee estate tour &amp; the trader’s walk which is a collection of 5 boutique shops &amp; gourmet food places within the ground of Arusha Coffee Lodge showcasing some of the country’s best creativity.\nOthers include day trips to Arusha National Park or Arusha Town or getting pampered in the on-site wellness spa.","image":"optimized-images/default.webp","folderName":"cities/arusha/arusha-coffee-lodge","created":null},{"title":"LAKE MANYARA TREE LODGE","description":"The exclusive Lake Manyara Tree Lodge is the only lodge in the game-rich Lake Manyara National Park &amp; offers guests a relaxing, yet adventurous safari experience.\nRemote &amp; romantic, the lodge boasts an ideal setting surrounded by lush forest – home to skipping blue monkeys &amp; 400 species of birds.  Thousands of flamingos can be seen around the lake, along with migratory waterbirds like pelicans &amp; storks.\nLake Manyara offers guests a wide variety of wildlife, including the famous tree-climbing lions of East Africa as well as large herds of elephants.\n\nLake Manyara Tree Lodge boasts 10 elegant, stilted treehouse suites surrounded by ancient mahogany trees, offering privacy, romance &amp; exclusivity.\nEach treehouse suite features a generous deck suspended above the forest floor &amp; large windows invite the lush forest inside.  The en-suite bathrooms boast free-standing baths &amp; outdoor showers – both offering beautiful views.\nCommunal areas include a dining-bar area with a viewing deck &amp; swimming pool, an open-air boma where pre-dinner drinks can be enjoyed &amp; a wellness spa that offers a wide selection of relaxing treatments.\n\nLake Manyara Tree Lodge offers daily game viewing expeditions led by expert guides.  \nGuests can enjoy open 4x4 game drives as well as fascinating night drives that provide an insight into the park’s rich nocturnal life, &amp; the chance to spot elusive creatures like aardvark &amp; bat-eared foxes.\nOne of the highlights at Lake Manyara is going on a cultural bicycle ride to one of the local villages, &amp; of course – ticking off many feathered favourites from their impressive bird list.\nAfter a day out in the bush, guests can relax by the pool or get pampered at the wellness spa.","image":"optimized-images/default.webp","folderName":"safaris/tanzania/lake-manyara/lake-manyara-tree-lodge","created":null},{"title":"NGORONGORO CRATER LODGE","description":"Ngorongoro Crater Lodge boasts an amazing location on the rim of the world’s largest intact &amp; unflooded caldera – the iconic Ngorongoro Crater.\nOffering magnificent views over the game-rich crater, the lodge boasts stunning architecture resembling a traditional Maasai mud-&amp;-stick homestead while the interiors &amp; finishes are pure opulence.\nNgorongoro Crater Lodge’s guests will not only experience top-notch year-round wildlife viewing – including the famous Big 5 – but will be treated to personal butler service &amp; fine dining, giving the lodge a richly deserved reputation of excellence.\n\nDivided into 3 camps – North Camp, South Camp &amp; Tree Camp – Ngorongoro Crater Lodge features a total of 26 luxury suites &amp; 1 two-bedroom family suite.  North &amp; South Camps have 12 suites each &amp; Tree Camp offers a more intimate 6 suites.\nAll camps boast jaw-dropping views &amp; have private sitting &amp; dining areas, with dedicated butlers who provide warm, personal service.  \nEach luxurious suite includes an en-suite bathroom with a chandelier-lit bathtub &amp; shower as well as a private deck.\nThe family unit can sleep 2 adults &amp; 2 children in 2 suites that are conveniently interlinked via a closed walkway, which allows access between the suites.  Both bedrooms are en-suite.\n\nActivities at Ngorongoro Crater Lodge are ample!\nThese include game drives, picnics on the crater floor, archaeological excursions to Olduvai Gorge, private sundowners on the rim, Empakai Crater hikes, Lake Eyasi walks as well as cultural experiences.\nOther activities include wine pairing or champagne tasting, interactions with the KopeLion conservation team &amp; massage treatments.\nThe Kids Club welcomes children of all ages &amp; offers a range of exciting activities.","image":"optimized-images/default.webp","folderName":"safaris/tanzania/ngorongoro-crater/ngorongoro-crater-lodge","created":null},{"title":"NAMIRI PLAINS","description":"The ultra-luxurious Namiri Plains is set within a remote corner in the eastern Serengeti – an area that was closed to tourists for 20 years to allow the cheetah population to restore itself.  Today, big cats can safely wander its plains.\n‘Namiri’ in Swahili means ‘big cat’ - &amp; aptly so, because this stylish safari camp offers some of East Africa’s best cheetah sightings.\nNamiri Plains is so remote, it is located more than an hour’s drive from any other camp in the region, offering guests an exclusive, intimate safari experience.\nEach year, one of nature’s greatest spectacles take place in East Africa:  The Great Wildebeest Migration.  And Namiri guests have front row seats to this magical wildlife show.  \nBecause this area is home to an abundance of predators, the plot thickens as lucky guests can witness cheetah, lion, leopard &amp; hyena stalk &amp; hunt their prey.\n\nAccommodation at Namiri Plains consists of 10 elegant tented suites &amp; 1 family tent, all with sweeping 360-degree views of the plains.  \nSubstantial in size, each tented suite offers sliding doors which run the full length of the room &amp; open out on a full-length viewing deck complete with a romantic outdoor bath, offering exceptional views from the tub as you relax.  \nFrom the shower, guests can enjoy full views of the seasonal riverbed.\nThe family tent is similar to the other tent, but slightly larger &amp; comes with an additional room with 2 single beds in it, which can be made into a double.\nThe communal mess tent offers beautiful views of the captivating Serengeti plains &amp; features a lounge, dining space, safari bar &amp; spa.\n\nSafari activities at Namiri Plains include open 4x4 game drives, guided bush walks, hot air balloon safaris, photographic excursions &amp; visiting the cheetah research project.","image":"optimized-images/default.webp","folderName":"safaris/tanzania/serengeti-national-park/namiri-plains","created":null},{"title":"MNEMBA ISLAND LODGE","description":"Mnemba Island is a tropical paradise of coral reefs, powdery beaches &amp; turquoise water found just off the coast of Zanzibar - &amp; just 1,5km in circumference.   \nLying on this dreamy isle is Mnemba Island Lodge – a small &amp; intimate boutique-style beach resort with a dedication to providing only the best in barefoot luxury.\nThe resort is home to a PADI dive school &amp; 2 dive boats, allowing guests to venture to the ocean when they want.  Complimentary non-motorized water sports like kayaking &amp; windsurfing are available to Mnemba Island guests &amp; the permanent beach is ideal for swimming.\nThe island is also home to a fascinating green turtle population that can be seen between April &amp; August each year.  Shoes are not necessary on the island, so enjoy the laid-back island atmosphere with no dress code…&amp; no shoes!\n\nThe resort is small &amp; intimate, consisting of only 10 thatched beach bandas that are tucked into a tropical forest.  Two of these bandas are situated within close proximity to one another &amp; can accommodate a family of four.  \nFootsteps away – you will find the beach &amp; crystal-clear ocean with warm water, great visibility &amp; around 430 species of fish, including the treasured whale shark.\nEach beach banda boasts a covered walkway leading to a shuttered en-suite bathroom.  There are built-in barazas on the veranda – a great spot for afternoon siestas &amp; private beach salas with traditional Zanzibari loungers for lazy beach days.\nIn the main area, you will find a restaurant, bar &amp; Kids Club.\n\nActivities at Mnemba Island Lodge include snorkelling, diving, fishing, kayaking, stand-up paddleboarding, windsurfing &amp; deep-sea fishing.  \nGuests can also enjoy relaxing spa treatments, book a private dinner on the beach with a butler or send little ones to the Kids Club for some island adventures.","image":"optimized-images/default.webp","folderName":"islands/zanzibar/mnemba-island-lodge","created":null}],"parentCards":[{"title":"Charming","image":"optimized-images/favourite/1charming/1charming-small.webp","folderName":"favourite/1charming","isCurrentFolder":false},{"title":"2Stylish","image":"optimized-images/favourite/2stylish/1stylish-small.webp","folderName":"favourite/2stylish","isCurrentFolder":false},{"title":"3Exclusive","image":"optimized-images/favourite/3exclusive/1exclusive-small.webp","folderName":"favourite/3exclusive","isCurrentFolder":true}],"h1Title":"Tanzania Bush & Beach","h2Title":"Exclusive","h3Title":"Tanzania Bush & Beach","whatWeLoveItems":["Witness the Great Wildebeest Migration (July – October)","Taste Tanzania’s best coffee","Spot the iconic tree-climbing lions of Lake Manyara","Sleep in luxury treehouse suites","Experience excellent Big 5 wildlife viewing year-round","Enjoy water activities on a private island"],"params":{"slug":["favourite","3exclusive","4tanzania-bush-beach"]},"level":3},"__N_SSG":true}