{"pageProps":{"frontmatter":{"title":"GRAND DEDALE COUNTRY HOUSE","subtitle":"","article_title":"","canon":true},"content":"<h4>Experience</h4>\n<p>The scenic &amp; secluded Grand Dedale Country House is set along a dirt road at the foot of the Bainskloof Pass on Doolhof, a working wine estate close to the Winelands town of Wellington.<br>This elegant retreat is surrounded by mountains &amp; forests, offering guests a rural elegance a mere hour’s drive from the vibrant city of Cape Town.<br>Here, guests are treated like royalty – from opulent suites &amp; relaxing spa treatments to high tea buffets &amp; 4-course dinners prepared with locally sourced ingredients.  Romantic picnic basket lunches can also be arranged for guests wishing to get closer to nature, or perhaps visit one of the mountain viewpoints.<br>Grand Dedale will connect you with nature.  A wide selection of outdoor activities is available, including hiking, biking &amp; fishing as well as horse riding.</p>\n<h4>Stay</h4>\n<p>Guests will have their pick between 6 individually styled rooms &amp; a double volume honeymoon cottage.<br>The rooms are located within the main manor house while the beautifully restored 1707 cottage stands quietly amid the paddocks &amp; gardens, ensuring guests have the utmost privacy.<br>Communal areas at Grand Dedale include a lounge &amp; dining space, a cosy well-stocked library &amp; a large deck with swimming pool &amp; sun loungers.  There is also a wellness spa &amp; gym.</p>\n<h4>Activities</h4>\n<p>Grand Dedale is truly a slice of paradise &amp; offers a range of exciting nature activities.<br>On-site, guests can enjoy hiking, mountain biking, bird watching &amp; gourmet picnics as well as horse riding, relaxing spa treatments &amp; sumptuous high teas.<br>Day trips to the beautiful towns of Franschhoek &amp; Stellenbosch can also be arranged should guests feel the need to do wine tasting at other regal estates.</p>\n","images":["optimized-images/cities/wine-route/grand-dedale-country-house/1granddedalecountryhouse-large.webp","optimized-images/cities/wine-route/grand-dedale-country-house/2granddedalecountryhouse-large.webp","optimized-images/cities/wine-route/grand-dedale-country-house/3granddedalecountryhouse-large.webp","optimized-images/cities/wine-route/grand-dedale-country-house/4granddedalecountryhouse-large.webp","optimized-images/cities/wine-route/grand-dedale-country-house/5granddedalecountryhouse-large.webp","optimized-images/cities/wine-route/grand-dedale-country-house/6granddedalecountryhouse-large.webp","optimized-images/cities/wine-route/grand-dedale-country-house/7granddedalecountryhouse-large.webp","optimized-images/cities/wine-route/grand-dedale-country-house/8granddedalecountryhouse-large.webp"],"subfolders":[{"title":"Babylonstoren","description":"Babylonstoren is everything but ordinary.  One of the oldest Cape Dutch farms, this elegant home offers a simplistic, yet luxurious farm-style experience.   So much more than just a farm, Babylonstoren loves to provide their guests with a personal, authentic – yet luxurious stay by allowing guests to get involved in some exciting farm activities, like fruit picking in season or tasting food prepared fresh from their garden. In fact, here guests can experience the Winelands’ best farm-to-table kitchen concept in a relaxed, farm-style setting.","image":"optimized-images/cities/wine-route/babylonstoren/1babylonstoren-small.webp","folderName":"cities/wine-route/babylonstoren","created":null},{"title":"Bonne Esperance","description":"With a prestigious setting in the heart of the historical town of Stellenbosch, lies Bonne Esperance, an award-winning boutique hotel &amp; one of the Winelands’ best-kept secrets. Stellenbosch is known for its majestic mountains, opulent vineyards, fascinating art &amp; culture as well as its world-class gastronomy &amp; wine.  With an unmatching location, Bonne Esperance is located within meters from an array of restaurants, cafes &amp; boutiques, offering guests the opportunity to stroll through the leafy streets of Stellenbosch at their own pace.","image":"optimized-images/cities/wine-route/bonne-esperance/1bonneesperance-small.webp","folderName":"cities/wine-route/bonne-esperance","created":null},{"title":"Clouds Estate","description":"Clouds Estate, as the name suggests, is set high on the Helshoogte Mountain pass, enjoying spectacular views over the Stellenbosch valley below.   This Winelands estate boasts an excellent location close to the charming town of Stellenbosch &amp; the beautiful Franschhoek village. Several top South African restaurants are in close driving distance, so guests can tantalize their taste buds by venturing out for the day to one of the nearby wine farms or relax on the estate &amp; take in some of the wonderful views Clouds Estate has to offer.","image":"optimized-images/cities/wine-route/clouds-estate/1cloudsestate-small.webp","folderName":"cities/wine-route/clouds-estate","created":null},{"title":"Delaire Graff Estate","description":"Delaire Graff Estate is ideally located on the Helshoogte Mountain pass overlooking the Stellenbosch valley.  This prestigious estate boasts luxurious suites with private decks &amp; pools, stylish interiors &amp; contemporary décor. Without a doubt, one of the top wine estates in South Africa, Delaire Graff never fails to impress.  It made has won numerous awards &amp; is a proud member of the luxurious group, Relais &amp; Chateaux. Discerning guests staying at Delaire Graff will have their choice from 2 prestigious restaurants on the estate &amp; personalized wine tasting is standard here. ","image":"optimized-images/cities/wine-route/delaire-graff-estate/1delairegraffestate-small.webp","folderName":"cities/wine-route/delaire-graff-estate","created":null},{"title":"Franschhoek Country House","description":"Located on the outskirts of the charming village of Franschhoek, the luxurious Franschhoek Country House &amp; Villas offer sublime cuisine &amp; fine South African wines.   An ideal base from which to explore the Winelands, this country house’s elegant suites &amp; villas will take you back in time to an era of romance &amp; sophistication. Surrounded by spectacular mountains, vineyards &amp; gardens decorated with lemon trees &amp; fountains, one cannot help but feel relaxed &amp; in awe of the beauty that is Franschhoek.","image":"optimized-images/cities/wine-route/franschhoek-country-house/1franschhoekcountryhouse-small.webp","folderName":"cities/wine-route/franschhoek-country-house","created":null},{"title":"Grand Dedale Country House","description":"The scenic &amp; secluded Grand Dedale Country House is set along a dirt road at the foot of the Bainskloof Pass on Doolhof, a working wine estate close to the Winelands town of Wellington. This elegant retreat is surrounded by mountains &amp; forests, offering guests a rural elegance a mere hour’s drive from the vibrant city of Cape Town. Here, guests are treated like royalty – from opulent suites &amp; relaxing spa treatments to high tea buffets &amp; 4-course dinners prepared with locally sourced ingredients.  Romantic picnic basket lunches can also be arranged for guests wishing to get closer to nature, or perhaps visit one of the mountain viewpoints.","image":"optimized-images/cities/wine-route/grand-dedale-country-house/1granddedalecountryhouse-small.webp","folderName":"cities/wine-route/grand-dedale-country-house","created":null},{"title":"Grande Roche","description":"Nestled at the foot of the magnificent Paarl Rock, is a boutique hotel like no other.  Grande Roche is a celebrated historical monument turned 5-star hotel, boasting beautiful gardens &amp; excellent cuisine. With spectacular views over endless vineyards &amp; mountains, Grande Roche offers guests a scenic &amp; secluded Winelands experience. The vibrant city of Cape Town is only an hour’s drive away &amp; just around the corner, you will find the charming towns of Franschhoek &amp; Stellenbosch, along with world-class restaurants &amp; golf courses.","image":"optimized-images/cities/wine-route/grande-roche/1granderoche-small.webp","folderName":"cities/wine-route/grande-roche","created":null},{"title":"La Cle des Montagnes","description":"La Cle des Montagne offers luxurious villa-style living in the heart of the Franschhoek valley in the Cape Winelands District.   Sophisticated, stylish &amp; breathtakingly beautiful – these opulent villas &amp; suites are located on a working wine estate, surrounded by picturesque vineyards, plum orchards &amp; spectacular mountains. La Cle is the ideal destination for the discerning traveller who is after an intimate &amp; luxurious villa experience.  The villas offer an idyllic setting a short stroll from the historic village of Franschhoek, with its award-winning restaurants, cafes &amp; art galleries.","image":"optimized-images/cities/wine-route/la-cle-des-montagnes/1lacledesmontagnes-small.webp","folderName":"cities/wine-route/la-cle-des-montagnes","created":null},{"title":"La Residence","description":"Situated on a private wine &amp; olive estate in the picturesque Franschhoek valley, lies La Residence – an opulent French-inspired residence with beautifully designed suites, generous dining, private butler, chef &amp; chauffeur services. The award-winning La Residence estate overlooks a spectacular mountain range &amp; is surrounded by lush vineyards, the idyllic location to appreciate some of Franschhoek’s most beautiful scenery.   This fertile valley &amp; the charming village of Franschhoek have become world-famous for fine wine, superb cuisine &amp; exceptional service.","image":"optimized-images/cities/wine-route/la-residence/1laresidence-small.webp","folderName":"cities/wine-route/la-residence","created":null},{"title":"Lanzerac Hotel & Spa","description":"The Lanzerac Hotel &amp; Spa is nestled in the leafy &amp; tranquil Winelands neighbourhood of Stellenbosch, one of South Africa’s gourmet food capitals. The hotel is set on a 155-hectare working wine estate where endless views of rolling vineyards &amp; majestic mountains are an everyday occurrence. Arguably Lanzerac’s most renowned feature – a luxurious hydro spa with a heated pool as well as private steam &amp; sauna rooms - will ensure that guests are relaxed &amp; rejuvenated.","image":"optimized-images/cities/wine-route/lanzerac-hotel-spa/1lanzerachotel-spa-small.webp","folderName":"cities/wine-route/lanzerac-hotel-spa","created":null},{"title":"Le Franschhoek Hotel & Spa","description":"Le Franschhoek Hotel &amp; Spa boasts a scenic setting on a mountain-side estate in the stunning Franschhoek valley – the heartbeat of the Cape Winelands. This Alpine-style region is located only an hour’s drive from the vibrant city of Cape Town, making Le Franschhoek an ideal choice for a classic Winelands experience. Just around the corner, you will find some of South Africa’s best restaurants as well as superb wine estates, art galleries &amp; boutique stores in &amp; around town.  ","image":"optimized-images/cities/wine-route/le-franschhoek-hotel-spa/1lefranschhoekhotel-spa-small.webp","folderName":"cities/wine-route/le-franschhoek-hotel-spa","created":null},{"title":"Le Quartier Francais","description":"Le Quartier Francais is set within beautiful gardens in the heart of Franschhoek – the very heartbeat of the Cape Winelands &amp; the gourmet capital of South Africa. This charming &amp; luxurious boutique hotel is centrally located on the village’s main street &amp; within walking distance to many shops, boutiques, galleries &amp; restaurants. Le Quartier provides an incomparable culinary destination, award-winning gourmet dining and wine list that is matched only by the contemporary luxury of the exclusive rooms and suites.","image":"optimized-images/cities/wine-route/le-quartier-francais/1lequartierfrancais-small.webp","folderName":"cities/wine-route/le-quartier-francais","created":null},{"title":"Leeu Estates","description":"Leeu Estates Franschhoek is set on 100 hectares of vineyards, landscaped gardens &amp; fynbos within the heart of the Cape Winelands – the culinary capital of the country. Tucked away between the mountainside &amp; river, just minutes away from the village of Franschhoek, Leeu Estates is the ideal setting for an elegant &amp; sophisticated hideaway. A short stroll away, you will find a variety of award-winning restaurants, boutiques, cafes &amp; spectacular wine farms.","image":"optimized-images/cities/wine-route/leeu-estates/1leeuestates-small.webp","folderName":"cities/wine-route/leeu-estates","created":null},{"title":"Leeu House","description":"Leeu House is an exclusive 5-star boutique hotel boasting an idyllic setting in the heart of the scenic Franschhoek valley: South Africa’s best culinary destination. This sophisticated &amp; private hideaway offers superb comfort, individually-styled rooms &amp; exceptional service.   Franschhoek is South Africa’s gourmet capital &amp; since Leeu House is located within a quiet oasis on Franschhoek’s vibrant main street, guests will be steps away from world-class dining, cafes, boutiques &amp; art galleries.","image":"optimized-images/cities/wine-route/leeu-house/1leeuhouse-small.webp","folderName":"cities/wine-route/leeu-house","created":null},{"title":"Light House Boutique Suites","description":"The Light House Boutique Suites is a privately owned, exclusive &amp; opulent boutique guest house set in the heart of the historic town of Paarl in the Cape Winelands.   Here, guests will be able to enjoy warm, professional &amp; friendly hospitality, superb wines &amp; delicious cuisine. The Light House Boutique Suites provides a home-away-from-home experience, without compromising on the everyday luxuries.  An intimate, personal encounter with some of the Winelands’ most fabulous hosts, guests will feel right at home the moment they walk through the door.","image":"optimized-images/cities/wine-route/light-house-boutique-suites/1lighthouseboutiquesuites-small.webp","folderName":"cities/wine-route/light-house-boutique-suites","created":null},{"title":"Majeka House","description":"Majeka House is located within a quiet street in the historic town of Stellenbosch - the heart of the Cape Winelands.   This luxury country house is surrounded by mountains &amp; vineyards &amp; is the ideal base from which to explore the Wine Country’s most popular towns - Stellenbosch, Franschhoek &amp; Paarl. The 5-star Majeka House places a strong focus on detail &amp; this is reflected in the luxurious furnishings, opulent décor, fine dining cuisine &amp; 5-star facilities such as a heated pool, sauna, steam room, jacuzzi &amp; wellness spa.","image":"optimized-images/cities/wine-route/majeka-house/1majekahouse-small.webp","folderName":"cities/wine-route/majeka-house","created":null},{"title":"Mont Rochelle","description":"Mont Rochelle boasts an ideal setting in the beautiful vineyards of the Franschhoek valley with endless views over vineyards &amp; mountains, providing a tranquil haven only an hour’s drive from Cape Town. The hotel offers only the best in Winelands luxury – from beautifully decorated rooms &amp; expansive lawns to gourmet dining &amp; complimentary wine tasting. Guests can stroll through the vineyards or explore the wine estate by horseback or mountain bike.  A wide selection of on-site facilities is available to guests, including a heated pool, lawn tennis court, croquet field &amp; boules pod.","image":"optimized-images/cities/wine-route/mont-rochelle/1montrochelle-small.webp","folderName":"cities/wine-route/mont-rochelle","created":null},{"title":"Oude Werf Hotel","description":"The historic Oude Werf Hotel was built in 1802 &amp; built on the remains of Stellenbosch’s first church, which had been constructed in 1687. Remembering its former glory, yet celebrating its modern &amp; contemporary style, Oude Werf offers an ideal base from which to explore this charming Winelands town with its many restaurants, cafes &amp; art galleries. Within walking distance, you will find beautiful, oak-covered streets where guests will be spoilt for choice when choosing from the country’s many prestigious vintages.","image":"optimized-images/cities/wine-route/oude-werf-hotel/1oudewerfhotel-small.webp","folderName":"cities/wine-route/oude-werf-hotel","created":null},{"title":"The Last Word Franschhoek","description":"The Last Word Franschhoek is set within the beautiful Winelands town of Franschhoek – South Africa’s gourmet capital - &amp; the perfect base for wine &amp; food lovers. The hotel has been beautifully restored in the Cape Huguenot tradition &amp; perfectly decorated with classic &amp; contemporary furnishings. Only a minute’s walk away, you will find an array of boutiques, award-winning restaurants &amp; art galleries, so days are often spent strolling through the historical town or enjoying wine tastings &amp; cellar tours to regal wine estates.","image":"optimized-images/cities/wine-route/the-last-word-franschhoek/1thelastwordfranschhoek-small.webp","folderName":"cities/wine-route/the-last-word-franschhoek","created":null},{"title":"The Owners Cottage at Grande Provence","description":"At the foot of the Franschhoek mountains on a 300-year-old estate in South Africa’s gourmet capital, lies The Owner’s Cottage at Grande Provence. This traditional Cape Dutch style villa is set on a working wine estate &amp; surrounded by beautiful vineyards &amp; majestic mountains. The villa comes complete with a dedicated chef, butler &amp; babysitter, offering discerning travellers an intimate &amp; personalised Winelands escape with only the highest level of service.  ","image":"optimized-images/cities/wine-route/the-owners-cottage-at-grande-provence/1theownerscottage-small.webp","folderName":"cities/wine-route/the-owners-cottage-at-grande-provence","created":null},{"title":"The Spier Hotel","description":"Set on a gorgeous wine estate just outside the beautiful Winelands town of Stellenbosch, you will find The Spier Hotel.   Dating back to 1692, the estate celebrates its heritage while embracing contemporary farm living.  Gracious Cape Dutch buildings are filled with modern interior &amp; comfortable furnishings. Spier is an ideal choice for families with active children since the estate offers a wide selection of exciting activities that are perfectly suited for both parents &amp; children.  Some of these include Segway tours through the vineyards, visiting the bird of prey rehabilitation or dining at Spier’s farm-to-table restaurant.","image":"optimized-images/cities/wine-route/the-spier-hotel/1thespierhotel-small.webp","folderName":"cities/wine-route/the-spier-hotel","created":null}],"parentCards":[{"title":"Arusha","image":"optimized-images/cities/arusha/1arusha-small.webp","folderName":"cities/arusha","isCurrentFolder":false},{"title":"Cape Town","image":"optimized-images/cities/cape-town/1capetown-small.webp","folderName":"cities/cape-town","isCurrentFolder":false},{"title":"Durban","image":"optimized-images/cities/durban/1durban-small.webp","folderName":"cities/durban","isCurrentFolder":false},{"title":"Entebbe & Kampala","image":"optimized-images/cities/entebbe-kampala/1entebbe-kampala-small.webp","folderName":"cities/entebbe-kampala","isCurrentFolder":false},{"title":"Garden Route","image":"optimized-images/cities/garden-route/1gardenroute-small.webp","folderName":"cities/garden-route","isCurrentFolder":false},{"title":"Johannesburg","image":"optimized-images/cities/johannesburg/1johannesburg-small.webp","folderName":"cities/johannesburg","isCurrentFolder":false},{"title":"Kigali","image":"optimized-images/cities/kigali/1kigali-small.webp","folderName":"cities/kigali","isCurrentFolder":false},{"title":"Lilongwe","image":"optimized-images/cities/lilongwe/1lilongwe-small.webp","folderName":"cities/lilongwe","isCurrentFolder":false},{"title":"Livingstone","image":"optimized-images/cities/livingstone/1livingstone-small.webp","folderName":"cities/livingstone","isCurrentFolder":false},{"title":"Nairobi","image":"optimized-images/cities/nairobi/1nairobi-small.webp","folderName":"cities/nairobi","isCurrentFolder":false},{"title":"Panorama Route","image":"optimized-images/cities/panorama-route/1panoramaroute-small.webp","folderName":"cities/panorama-route","isCurrentFolder":false},{"title":"Victoria Falls","image":"optimized-images/cities/victoria-falls/1victoriafalls-small.webp","folderName":"cities/victoria-falls","isCurrentFolder":false},{"title":"Whale Route","image":"optimized-images/cities/whale-route/1whaleroute-small.webp","folderName":"cities/whale-route","isCurrentFolder":false},{"title":"Windhoek","image":"optimized-images/cities/windhoek/1windhoek-small.webp","folderName":"cities/windhoek","isCurrentFolder":false},{"title":"Wine Route","image":"optimized-images/cities/wine-route/1wineroute-small.webp","folderName":"cities/wine-route","isCurrentFolder":true}],"h1Title":"Grand Dedale Country House","h2Title":"Wine Route","h3Title":"Grand Dedale Country House","whatWeLoveItems":["Scenic & secluded Winelands experience","Situated on a working wine estate","Excellent cuisine & wine tasting","Outdoor activities – hiking, biking & fishing","Wellness spa with relaxing treatments","Attention to detail & exceptional service"],"params":{"slug":["cities","wine-route","grand-dedale-country-house"]},"level":3},"__N_SSG":true}