{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","youtube":"gM2yYvdpaoM","canon":true,"no-gallery":1,"cards-header":"Travel Journal"},"content":"<p>“Another travel blog?” you ask.  Well, yes. Because – for most of us, our favourite memories happen while on holiday.  Perhaps it is because we forget the rat race, the job, the responsibilities &amp; the dog at home (of course you got a sitter), &amp; we focus on the things that really matter.  People. </p>\n<p>You’ll hear us talk about people often, because – if we are truly honest with ourselves – life revolves around doing things together.  Sure, travel is always fun, but sharing an adventure with someone is even better!</p>\n<p>Have you ever sat around a dinner table &amp; listened to someone’s amazing (&amp; often funny) travel stories? “The day we missed our flight &amp; got upgraded to first class.”  “That time we couldn’t get to our chalet, because a hippo was blocking the door.” “Remember when we slept in the treehouse &amp; got woken up by the roar of a lion?”  </p>\n<p>Travel stories inspire us.  Not only does it encourage us to get on a plane &amp; see the world, but it inspires us to dream, to see the bigger picture &amp; to live life to the fullest.</p>\n<p>That is why we have decided to build a luxury travel company that helps people broaden their horizons.  At Africa Unwind we not only custom design your safari holiday, but we also travel the length &amp; breadth of Africa to provide you with first-hand knowledge, professional travel tips &amp; exceptional service.</p>\n<p>So yes, this is another travel blog.  About Africa.  About ‘all things travel.’</p>\n<p>Why don’t you join us?  Come to Africa…&amp; Unwind.</p>\n","images":["optimized-images/blog/anothertravelblog-large.webp"],"subfolders":[{"title":"All Things Africa","description":"Remember the good old days when all your favourite photographs & books were stored in one place?  The photo album packed with memories (mostly of travel & loved ones) & the home library filled with books on your favourite topics? Well, we have created a space for you where you can have all of this at the click of a button!","image":"optimized-images/blog/all-things-africa/1-all-things-africa-small.webp","folderName":"blog/all-things-africa","created":"2 December 2022"},{"title":"Our Clients Say","description":"There is that good old saying we learned at university or business school: “The client is always right!”  Come to think of it – most of us have heard this statement from the mouths of trusted authority figures like parents, teachers, lecturers, or bosses.","image":"optimized-images/blog/our-clients-say/1-clients-say-small.webp","folderName":"blog/our-clients-say","created":"2 December 2022"},{"title":"We Say","description":"Everyone wants to have a voice. In the travel world, it is important to listen to voices that are “tried & tested.”  Normally, we love to pay attention to people when we feel a connection to them (personal), when we trust them (reliable) & when we can learn something from them. (informative) This is our promise to you when reading this blog!","image":"optimized-images/blog/we-say/1-we-say-small.webp","folderName":"blog/we-say","created":"2 December 2022"}],"parentCards":[],"h1Title":"Another Travel Blog","h2Title":"Because Travel Is Everything","h3Title":"Another Travel Blog","whatWeLoveItems":[],"params":{"slug":["blog"]},"level":1},"__N_SSG":true}