{"pageProps":{"frontmatter":{"title":"BELOVED AFRICA","subtitle":"","article_title":"","canon":true,"lodges":"Cape Cadogan\nArathusa Safari Lodge\nNthambo Tree Camp\nIntercontinental Hotel\nIlala Lodge\n"},"content":"<p style=\"visibility: collapse !important; margin-top: -10px;\">\n\n<p></p>\n</p>\n\n<h4>RATE</h4>\n<p><Rate>USD $ 3,000 – USD $ 6,000 per person</Rate></p>\n<h4>AREAS</h4>\n<p>Cape Town, Kruger, Vic Falls (14 nights)</p>\n<h4>Trip Summary</h4>\n<ul>\n<li>4 nights:  Cape Cadogan, Cape Town – South Africa</li>\n<li>3 nights:  Arathusa Safari Lodge, Sabi Sand/Kruger – South Africa</li>\n<li>3 nights:  Nthambo Tree Camp, Klaserie/Kruger – South Africa</li>\n<li>1 night:  Intercontinental Hotel, Johannesburg – South Africa</li>\n<li>3 nights:  Ilala Lodge, Victoria Falls – Zimbabwe</li>\n</ul>\n<h4>Trip Overview</h4>\n<h1></h1>\n<h4>Day 1:</h4>\n<p>Upon arrival at Cape Town International Airport, you will be transferred by road to Cape Cadogan in Cape Town, South Africa.</p>\n<h1></h1>\n<h4>Day 1 – 5:</h4>\n<p>Spend 4 nights at Cape Cadogan in a luxury room on a bed &amp; breakfast basis.</p>\n<p>During your stay, you will depart on a Full Day Cape Point &amp; Peninsula Tour, a Half Day City &amp; Table Mountain Tour &amp; a Full Day Wine Route Tour. (private vehicle &amp; guide)</p>\n<h1></h1>\n<h4>Day 5:</h4>\n<p>Road transfer from Cape Cadogan to Cape Town International Airport.</p>\n<p>Scheduled flight from Cape Town to Hoedspruit with South African Airways – economy.</p>\n<p>Road transfer from Hoedspruit Airport to Arathusa Safari Lodge in the Sabi Sand Reserve, Kruger.</p>\n<h1></h1>\n<h4>Day 5 – 8:</h4>\n<p>Spend 3 nights at Arathusa Safari Lodge in a luxury suite on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 8:</h4>\n<p>Road transfer from Arathusa Safari Lodge to Nthambo Tree Camp in the Klaserie Reserve, Kruger.</p>\n<h1></h1>\n<h4>Day 8– 11:</h4>\n<p>Spend 3 nights at Nthambo Tree Camp in a luxury treehouse on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 11:</h4>\n<p>Road transfer from Nthambo Tree Camp to Hoedspruit Airport.</p>\n<p>Scheduled flight from Hoedspruit to Johannesburg with South African Airways - economy. </p>\n<p>Walk to The Intercontinental Hotel outside the International Arrivals Hall.</p>\n<p>Overnight at The Intercontinental Hotel in a deluxe room on a bed &amp; breakfast basis.</p>\n<h1></h1>\n<h4>Day 12:</h4>\n<p>Walk to Johannesburg International Airport.</p>\n<p>Scheduled flight from Johannesburg to Victoria Falls with South African Airways – economy.</p>\n<p>Road transfer from Victoria Falls Airport to Ilala Lodge in Victoria Falls, Zimbabwe.</p>\n<h1></h1>\n<h4>Day 12 - 15:</h4>\n<p>Spend 3 nights at Ilala Lodge in a luxury room on a bed &amp; breakfast basis.</p>\n<p>During your stay, you will depart on a Guided Tour of Victoria Falls, a Sunset Boat Cruise &amp; a Helicopter Flight over the Falls.</p>\n<h1></h1>\n<h4>Day 15:</h4>\n<p>Road transfer from Ilala Lodge to Victoria Falls Airport.</p>\n<p>Scheduled flight from Victoria Falls to Johannesburg with South African Airways – economy.</p>\n<p>Depart Johannesburg International Airport as per own arrangements.</p>\n<p>End of trip.</p>\n<h4>Inclusions</h4>\n<ul>\n<li>All regional flights</li>\n<li>All road transfers</li>\n<li>All mentioned private tours &amp;amp; activities</li>\n<li>All mentioned accommodations</li>\n<li>On safari&#58;  All meals, drinks (soft &amp;amp; alcoholic) &amp;amp; activities</li>\n<li>Elsewhere&#58;  Bed &amp;amp; breakfast basis</li>\n</ul>\n<h4>Exclusions</h4>\n<ul>\n<li>International flights from home</li>\n<li>Visas (if necessary)</li>\n<li>Travel Insurance</li>\n</ul>\n","images":["optimized-images/favourite/1charming/1beloved-africa/1belovedafrica-large.webp","optimized-images/favourite/1charming/1beloved-africa/2belovedafrica-large.webp","optimized-images/favourite/1charming/1beloved-africa/3belovedafrica-large.webp","optimized-images/favourite/1charming/1beloved-africa/4belovedafrica-large.webp","optimized-images/favourite/1charming/1beloved-africa/5belovedafrica-large.webp","optimized-images/favourite/1charming/1beloved-africa/6belovedafrica-large.webp","optimized-images/favourite/1charming/1beloved-africa/7belovedafrica-large.webp","optimized-images/favourite/1charming/1beloved-africa/8belovedafrica-large.webp"],"subfolders":[{"title":"CAPE CADOGAN","description":"Cape Cadogan is a modern, chic boutique hotel set in the heart of Cape Town, with Table Mountain, Devil’s Peak &amp; Lions Head as the backdrop.  This Victorian-Georgian building dates back to the 1800s, &amp; now a national monument, the interior boasts dramatic fabrics &amp; antique furniture.\nWith a convenient location near the trendy Kloof Street, the hotel is an ideal base from which to explore Cape Town’s main tourist attractions, such as Table Mountain, Camps Bay &amp; the V&amp;A Waterfront.\nFor guests wishing to enjoy the ‘real’ Cape Town, Cape Cadogan is simply a must.  Set in a quiet street amongst the hustle &amp; bustle of city life, it is easy to feel the heartbeat of the Mother City.\n\nCape Cadogan offers 15 luxurious en-suite rooms, beautifully furnished with antiques &amp; contemporary décor to create a unique ‘Bohemian chic’ style.  \nThere are 7 classic rooms, 7 luxury rooms &amp; 1 superior luxury suite.  Each room or suite features a beautiful en-suite bathroom &amp; air-conditioning.  The luxury rooms have private terraces or courtyards &amp; the superior luxury suite boasts a private plunge pool.\nThe main area boasts a comfortable lounge &amp; cosy fireplace, the ideal place to unwind &amp; read a book from the hotel’s library.  In summer, guests can enjoy Cape Cadogan’s large swimming pool while admiring the view of Table Mountain.\nGuests can enjoy Cape Cadogan’s cooked &amp; continental breakfasts in the elegant dining room overlooking the majestic gardens &amp; swimming pool.\n\nGuests visiting Cape Town will have plenty of activities to choose from.  Popular day-trips include visits to Camps Bay or Clifton beaches, V&amp;A Waterfront, The Winelands, Cape Point, Robben Island, Boulders Beach’s penguin colony or Kirstenbosch Gardens.\nFor the adventurous at heart, shark-cage diving or whale watching can be arranged.  For nature lovers, Cape Town offers a variety of nature trails, hikes, picnic spots &amp; adventure sports like kite surfing, windsurfing, stand-up paddleboarding, paragliding, sandboarding, horse riding &amp; much more.","image":"optimized-images/default.webp","folderName":"cities/cape-town/cape-cadogan","created":null},{"title":"ARATHUSA SAFARI LODGE","description":"Arathusa Safari Lodge lies in the world-renowned Sabi Sand Reserve, adjacent to the Kruger National Park in South Africa.\nThe lodge is built on the edge of a waterhole where plenty of animal activity takes place.  Guests at Arathusa are treated to an exceptional wildlife experience, including the prized Big 5 – lion, leopard, elephant, buffalo &amp; rhino.\n\nArathusa has 9 waterhole suites &amp; 4 bush suites.  The waterhole suites are built close to the waterhole where guests can enjoy prime game viewing opportunities from the comfort of their viewing decks. \nThe bush suites are built further away from the main area, with absolute privacy &amp; seclusion in mind.  These suites are more spacious &amp; each is equipped with a private plunge pool &amp; lounge area.  \nAll 13 suites have an en-suite bathroom with a shower as well as a private outdoor shower &amp; veranda.\nThe main area features a comfortable lounge, a swimming pool overlooking the bush &amp; an open-air dining area.\n\nDaily activities at Arathusa include safari drives in open 4x4 vehicles, where guests will be accompanied by a qualified ranger &amp; tracker.  Offering a unique insight into life after dark, night drives allow you to spot an entirely different cast of animals.\nWalking safaris are exciting as guests will learn about fauna &amp; flora as well as tracking animals on foot.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/kruger-national-park/sabi-sand-private-game-reserve/arathusa-safari-lodge","created":null},{"title":"NTHAMBO TREE CAMP","description":"Nthambo Tree Camp is a small &amp; intimate camp located within the Klaserie Private Game Reserve, adjacent to the Kruger National Park &amp; home to Africa’s Big 5.\nWith unique treehouse chalets built at eye level with the trees, guests will be able to enjoy an authentic safari experience, feeling close to nature! (as one should while in Africa)\n\nWith only 5 luxurious, stilted treehouse chalets – Nthambo Tree Camp lives up to its name.  From here, amazing sunsets can be enjoyed.  Each chalet is equipped with an en-suite bathroom &amp; viewing deck where sundowners can be enjoyed.\nThe main area features a lounge with comfortable sofas, dining room, traditional African boma &amp; swimming pool with magnificent views over the bushveld.\n\nThe Klaserie Game Reserve is home to Africa’s Big 5 – lion, leopard, elephant, buffalo &amp; rhino – as well as plenty of other wildlife &amp; a variety of birds.  Guests can expect a fantastic wildlife experience year-round.  \nTwice daily game drives in open 4x4 safari vehicles are always a highlight, while nature walks are ideal for the adventurous at heart.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/kruger-national-park/klaserie-private-game-reserve/nthambo-tree-camp","created":null},{"title":"INTERCONTINENTAL HOTEL","description":"Located just a few steps outside OR Tambo’s International Arrivals Hall, the Intercontinental Hotel offers guests the perfect blend between luxury &amp; comfort.\nStanding proud, just shy of 70 meters from the airport building, the Intercontinental Hotel is – without a doubt – Johannesburg’s best option for an overnight stay.  Regardless of your arrival time, there is no need to wait for a taxi or sit in traffic – after only a few steps, you will reach your destination.\nThe hotel boasts a wellness spa, fitness centre &amp; a heated swimming pool for those wishing to get rejuvenated after a long-haul flight.\nDining is important at the Intercontinental Hotel.  Delicious breakfasts are served along with African-fushion cuisine at their on-site restaurant.  In-room dining is also available.\n\nThe hotel is home to 108 deluxe rooms, 27 executive rooms, 2 presidential suites &amp; 1 disabled room.\nThe well-appointed deluxe rooms are tastefully decorated with subtle influences of Africa.  These rooms have spacious showers, blackout curtains &amp; soundproofing to ensure a night of relaxation.  \nExecutive rooms occupy corners of the hotel providing impressive views &amp; ample natural light.  En-suite bathrooms have luxurious showers with massage showerheads to ensure the utmost comfort.  \nFamilies who request inter-leading rooms can book an executive room &amp; deluxe room next door as one unit.  Due to minimal inter-leading rooms, specifying this need is important.  The 2 presidential suites are located on the 7th floor &amp; boast beautiful views.  \nHotel facilities include a restaurant, cocktail bar, gym, spa &amp; swimming pool.\n\nGuided day trips are popular in Johannesburg.  These include tours of the city, township, museums, art galleries &amp; trendy shopping venues.  Hot air balloon safaris &amp; day trips to the nearby Pilanesberg National Park can also be arranged.","image":"optimized-images/default.webp","folderName":"cities/johannesburg/intercontinental-hotel","created":null},{"title":"ILALA LODGE","description":"Ilala Lodge is ideally situated on the Zimbabwean side of the mighty Zambezi River, only a short walk from the magnificent Victoria Falls.\nThe perfect base from which to explore one of the World’s Seven Natural Wonders, Ilala Lodge is the closest resort to the majestic Vic Falls.  \nRestaurant guests can see &amp; hear the roar of “the smoke that thunders” in the background while enjoying some of Zimbabwe’s finest cuisine.\n\nAccommodation at Ilala Lodge comprises 34 standard rooms, 20 deluxe rooms, 2 standard suites, 3 executive suites &amp; 1 penthouse suite.\nIn the standard rooms, double French doors open out to a communal garden where wild animals are often spotted.  The deluxe rooms are slightly larger than the standard rooms, with more refined interiors.\nThe standard suites both have balconies where guests can relax on the comfortable chairs &amp; table provided.  The executive suites have 2 bedrooms, a lounge &amp; private patio with beautiful sunrise views.\nThe penthouse suite comes complete with private lounge, kitchen, walk-in shower, private balcony with large spa bath while enjoying world-class views of the spray rising above the mighty Victoria Falls waterfall.  This suite can also be turned into a family villa by also booking the next-door deluxe room with inter-leading door.\nThe main area features a poolside bar, restaurant &amp; spa.\n\nZimbabwe is not called the adventure capital of Africa for nothing!  There are a wide range of activities available to travelers that can either be pre-booked through us or directly at the lodge.\nSome of these include helicopter flights over the Falls, white water river rafting or canoeing on the mighty Zambezi River, swimming at Devil’s Pool, lunch at Livingstone island, sunset boat cruises, bungee jumping, elephant interactions &amp; much more!","image":"optimized-images/default.webp","folderName":"cities/victoria-falls/ilala-lodge","created":null}],"parentCards":[{"title":"Charming","image":"optimized-images/favourite/1charming/1charming-small.webp","folderName":"favourite/1charming","isCurrentFolder":true},{"title":"2Stylish","image":"optimized-images/favourite/2stylish/1stylish-small.webp","folderName":"favourite/2stylish","isCurrentFolder":false},{"title":"3Exclusive","image":"optimized-images/favourite/3exclusive/1exclusive-small.webp","folderName":"favourite/3exclusive","isCurrentFolder":false}],"h1Title":"Beloved Africa","h2Title":"Charming","h3Title":"Beloved Africa","whatWeLoveItems":["Experience Table Mountain & Cape Town’s Waterfront","Tick off the Big 5 on a Kruger Safari","See Victoria Falls – one of the Seven Natural Wonders of the World","Sleep in a treehouse on safari","Get up, close & personal with Africa’s big cats"],"params":{"slug":["favourite","1charming","1beloved-africa"]},"level":3},"__N_SSG":true}