{"pageProps":{"frontmatter":{"title":"SOUTH AFRICA&#58;  CENTER STAGE","subtitle":"","article_title":"","canon":true,"lodges":"More Quarters\nMajeka House\nSchulphoek House\nSimbavati River Lodge\n"},"content":"<p style=\"visibility: collapse !important; margin-top: -10px;\">\n\n<p></p>\n</p>\n\n<h4>RATE</h4>\n<p><Rate>USD $ 3,000 – USD $ 6,000 per person</Rate></p>\n<h4>AREAS</h4>\n<p>Cape Town, Wine Route, Whale Route, Kruger (12 nights)</p>\n<h4>Trip Summary</h4>\n<ul>\n<li>4 nights:  More Quarters, Cape Town – South Africa</li>\n<li>2 nights:  Majeka House, Wine Route – South Africa</li>\n<li>2 nights:  Schulphoek House, Whale Route – South Africa</li>\n<li>4 nights:  Simbavati River Lodge, Timbavati/Kruger – South Africa</li>\n</ul>\n<h4>Trip Overview</h4>\n<h1></h1>\n<h4>Day 1:</h4>\n<p>Upon arrival at Cape Town International Airport, you will be transferred by road to More Quarters in Cape Town, South Africa.</p>\n<h1></h1>\n<h4>Day 1 – 5:</h4>\n<p>Spend 4 nights at More Quarters in a luxury one-bedroom suite on a bed &amp; breakfast basis.</p>\n<p>During your stay, you will depart on a Full Day Cape Point &amp; Peninsula Tour &amp;a Half Day City &amp; Table Mountain Tour. (private vehicle &amp; guide)</p>\n<h1></h1>\n<h4>Day 5:</h4>\n<p>Road transfer from More Quarters to Majeka House in Stellenbosch, Wine Route.</p>\n<h1></h1>\n<h4>Day 5 – 7:</h4>\n<p>Spend 2 nights at Majeka House in a pool suite on a bed &amp; breakfast basis.</p>\n<p>During your stay, you will depart on a Full Day Wine Route Tour. (private vehicle &amp; guide)</p>\n<h1></h1>\n<h4>Day 7:</h4>\n<p>Road transfer from Majeka House to Schulphoek House in Hermanus, Whale Route.</p>\n<h1></h1>\n<h4>Day 7 – 9:</h4>\n<p>Spend 2 nights at Schulphoek House in a superior sea-facing room on a bed &amp; breakfast basis.</p>\n<h1></h1>\n<h4>Day 9:</h4>\n<p>Road transfer from Schulphoek House to Cape Town International Airport.</p>\n<p>Scheduled flight from Cape Town to Hoedspruit with South African Airways – economy.</p>\n<p>Road transfer from Hoedspruit Airport to Simbavati River Lodge in the Timbavati Reserve, Kruger.</p>\n<h1></h1>\n<h4>Day 9 – 13:</h4>\n<p>Spend 4 nights at Simbavati River Lodge in a luxury tent on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 13:</h4>\n<p>Road transfer from Simbavati River Lodge to Hoedspruit Airport.</p>\n<p>Scheduled flight from Hoedspruit to Johannesburg with South African Airways - economy. </p>\n<p>Depart Johannesburg International Airport as per own arrangements.</p>\n<p>End of trip.</p>\n<h4>Inclusions</h4>\n<ul>\n<li>All regional flights</li>\n<li>All road transfers</li>\n<li>All mentioned private tours &amp;amp; activities</li>\n<li>All mentioned accommodations</li>\n<li>On safari&#58;  All meals, drinks (soft &amp;amp; alcoholic) &amp;amp; activities</li>\n<li>Elsewhere&#58;  Bed &amp;amp; breakfast basis</li>\n</ul>\n<h4>Exclusions</h4>\n<ul>\n<li>International flights from home</li>\n<li>Visas (if necessary)</li>\n<li>Travel Insurance</li>\n</ul>\n","images":["optimized-images/favourite/1charming/2south-africa-center-stage/1south-africa-center-stage-large.webp","optimized-images/favourite/1charming/2south-africa-center-stage/2south-africa-center-stage-large.webp","optimized-images/favourite/1charming/2south-africa-center-stage/3south-africa-center-stage-large.webp","optimized-images/favourite/1charming/2south-africa-center-stage/4south-africa-center-stage-large.webp","optimized-images/favourite/1charming/2south-africa-center-stage/5south-africa-center-stage-large.webp","optimized-images/favourite/1charming/2south-africa-center-stage/6south-africa-center-stage-large.webp","optimized-images/favourite/1charming/2south-africa-center-stage/7south-africa-center-stage-large.webp","optimized-images/favourite/1charming/2south-africa-center-stage/8south-africa-center-stage-large.webp"],"subfolders":[{"title":"MORE QUARTERS","description":"More Quarters offers their guests exactly that….More.  \nMore space, more luxury &amp; more personal service. Operating exactly like a hotel, guests will still enjoy the benefits of a hotel – including concierge, breakfast, daily cleaning &amp; personal attention, while enjoying extra comforts like space &amp; privacy.\nMore Quarters is ideal for families, groups or couples interested in a little bit more.  Guests will be able to choose between one &amp; two-bedroom apartments as well as a three-bedroom villa, all set within a quiet haven close to the trendy Kloof Street.\nMore Quarters is located at the foot of majestic Table Mountain, within walking distance of restaurants, shops &amp; boutiques to ensure a comfortable stay for guests who desire a measure of independence during their Cape Town holiday.\n\nAll luxury apartments consist of spacious living areas &amp; modern, comfortable furnishings – offering a home-away-from-home feel.  Breakfast can be enjoyed at the hotel or in the comfort of your apartment.\nThe apartments all boast modern conveniences, such as air-conditioning, internet access, minibars &amp; secure parking.  \nGuests can relax in the hotel’s elegant lounge while the concierge arranges day trips, transfers, restaurant reservations &amp; spa treatments.\n\nCape Town is without a doubt, South Africa’s most remarkable city.  \nThere is a never-ending list of things to do here – from visiting Cape Town’s best beaches, shopping at the V&amp;A Waterfront &amp; wine-tasting in the Cape Winelands to spending time with the adorable penguins at Boulders Beach or having a picnic in Kirstenbosch Gardens.\nOther options like shark-cage diving or whale watching can also be arranged.  \nMore Quarters can assist guests in booking any trips or activities they wish to enjoy during their stay in South Africa’s most beautiful city.","image":"optimized-images/default.webp","folderName":"cities/cape-town/more-quarters","created":null},{"title":"MAJEKA HOUSE","description":"Majeka House is located within a quiet street in the historic town of Stellenbosch - the heart of the Cape Winelands.  \nThis luxury country house is surrounded by mountains &amp; vineyards &amp; is the ideal base from which to explore the Wine Country’s most popular towns - Stellenbosch, Franschhoek &amp; Paarl.\nThe 5-star Majeka House places a strong focus on detail &amp; this is reflected in the luxurious furnishings, opulent décor, fine dining cuisine &amp; 5-star facilities such as a heated pool, sauna, steam room, jacuzzi &amp; wellness spa.\nNearby, you will find the charming town of Stellenbosch with its wide selection of restaurants, cafes, boutiques &amp; art galleries.\n\nThe 23 rooms of Majeka House are spread across 4 room categories offering a wealth of experiences for a variety of travellers.  \nThese include premier rooms, garden rooms, mountain rooms &amp; pool suites - all of which are en-suite &amp; stylishly decorated in a neutral palette with vibrant splashes of colour.  \nEach of the premier rooms has a private balcony or terrace overlooking the immaculate garden, with gorgeous valley &amp; mountain views.  \nThe garden rooms boast beautiful patios with direct access to the swimming pool while the mountain rooms come with a lounge &amp; elegant en-suite terrace, offering spectacular views over Stellenbosch Mountain.  The 2 pool suites are ultra-luxurious &amp; open out onto a shared pool.  \nCommunal areas include a fine dining restaurant, library with a crackling fireplace &amp; cocktail bar where delicious pre-dinner drinks can be enjoyed.  There is also a pool, wellness spa &amp; gym.\n\nMajeka guests can enjoy relaxing spa treatments, take a dip in the pool, or simply pick a book from the library &amp; enjoy a quiet read.  Other exciting options include visits to the charming town of Stellenbosch or the beautiful Franschhoek valley with its many award-winning restaurants, shops &amp; art galleries.","image":"optimized-images/default.webp","folderName":"cities/wine-route/majeka-house","created":null},{"title":"SCHULPHOEK HOUSE","description":"Sculphoek House is located within the protected sanctuary of Schulphoek Bay, just outside the charming seaside town of Hermanus.  \nSituated right on the beach, Schulphoek does not only offer spectacular views of the ocean but also provides the ideal spot to enjoy excellent whale watching from the comfort of the lounge or outside terrace.\nAn extra value-add is the surprising complimentary 4-course dinner waiting for you on your 1st night.  Meals have been freshly prepared with ingredients from the garden while excellent South African wines can be enjoyed from their wide selection.\n\nSchulphoek House provides 15 elegant suites, some ocean-facing &amp; some garden-facing.\nEach suite is individually decorated, boasting fine linens, goose-down duvets &amp; en-suite bathrooms. Rooms are spacious &amp; offer either sweeping views of the bay or a patio that walks out into the quiet gardens.\nCommunal areas include a peaceful library with a selection of books &amp; a comfortable lounge to unwind &amp;, during whale season, spot southern right whales in the ocean from the comfort of the sofas.  \nThis eco-conscious boutique hotel also features a swimming pool with sun loungers &amp; an open-plan kitchen that allows guests to see the resident chef at work.  Schulphoek also has an impressive wine collection of over 7,000 wines.\n\nThere are many activities to be enjoyed at Schulphoek House.  Hermanus is famous for providing the best land-based whale watching in the world between July &amp; November, with the season peaking in September.  \nOther activities include cliff walks, lazy strolls on the beach, wine estate tours, boat-based fishing, golfing, or browsing the shops of one of South Africa’s most popular holiday towns.","image":"optimized-images/default.webp","folderName":"cities/whale-route/schulphoek-house","created":null},{"title":"SIMBAVATI RIVER LODGE","description":"The Simbavati Lodges are located within the heart of the Timbavati Game Reserve in the Greater Kruger region &amp; offers phenomenal Big 5 wildlife viewing.\nThere are 2 lodges at Simbavati – one is located on a hill - Simbavati Hilltop Lodge, &amp; the other is located by a river - Simbavati River Lodge.\nHilltop Lodge is the more luxurious of the 2 lodges &amp; is geared towards adults (no children under 12 years old), whereas River Lodge is a relaxed, family-friendly camp.  Both lodges boast incredible views over the Nhlaralumi River.\n\nSimbavati River Lodge, a family-friendy paradise, offers 8 luxury safari tents, 3 family chalets &amp; 2 tented pool suites.\nThe luxury safari tents are adequately spaced &amp; provide generous bush or water views from the private viewing decks.  Each air-conditioned tent has an en-suite bathroom with an indoor &amp; outdoor shower.\nThe family chalets include 2 bedrooms, which make this ideal for families with children.  Each air-conditioned chalet has a private viewing deck, seating area &amp; en-suite bathroom with shower.\nThe luxury glass-fronted tented pool suites offer private plunge pools. \nThe main lodge features a spacious open plan lounge with comfortable sofas, a dining room, bar &amp; a large viewing deck overlooking the waterhole.  There is also a sparkling swimming pool with spectacular views over the bushveld.\n\nSimbavati’s excellent location – right in the heart of Big 5 country allows for phenomenal game drives in open 4x4 vehicles.  \nPassionate &amp; knowledgeable guides will accompany guests on all drives &amp; take them on a journey through wild Africa.  \nThe Kids Club will keep the young ones entertained, so parents can truly put their feet up &amp; relax!","image":"optimized-images/default.webp","folderName":"safaris/south-africa/kruger-national-park/timbavati-private-game-reserve/simbavati-river-lodge","created":null}],"parentCards":[{"title":"Charming","image":"optimized-images/favourite/1charming/1charming-small.webp","folderName":"favourite/1charming","isCurrentFolder":true},{"title":"2Stylish","image":"optimized-images/favourite/2stylish/1stylish-small.webp","folderName":"favourite/2stylish","isCurrentFolder":false},{"title":"3Exclusive","image":"optimized-images/favourite/3exclusive/1exclusive-small.webp","folderName":"favourite/3exclusive","isCurrentFolder":false}],"h1Title":"South Africa - Center Stage","h2Title":"Charming","h3Title":"South Africa - Center Stage","whatWeLoveItems":["Explore South Africa’s top tourist destinations","See the iconic Table Mountain","Taste delicious cuisine & wine","Experience the best land-based whale-watching in the world","Encounter the famous Big 5 on safari"],"params":{"slug":["favourite","1charming","2south-africa-center-stage"]},"level":3},"__N_SSG":true}