{"pageProps":{"frontmatter":{"title":"BEAUTIFUL BOTSWANA","subtitle":"","article_title":"","canon":true,"lodges":"Camp Moremi\nCamp Okavango\nSavute Safari Lodge\n"},"content":"<p style=\"visibility: collapse !important; margin-top: -10px;\">\n\n<p></p>\n</p>\n\n<h4>RATE</h4>\n<p><Rate>USD $ 3,000 – USD $ 6,000 per person</Rate></p>\n<h4>AREAS</h4>\n<p>Moremi, Okavango Delta, Savute (6 nights)</p>\n<h4>Trip Summary</h4>\n<ul>\n<li>2 nights:  Camp Moremi, Moremi – Botswana</li>\n<li>2 nights:  Camp Okavango, Okavango Delta – Botswana</li>\n<li>2 nights:  Savute Safari Lodge, Savute – Botswana</li>\n</ul>\n<h4>Trip Overview</h4>\n<h1></h1>\n<h4>Day 1:</h4>\n<p>Upon arrival at Maun International Airport, you will be transferred by light air to Camp Moremi in Moremi, Botswana.</p>\n<h1></h1>\n<h4>Day 1 – 3:</h4>\n<p>Spend 2 nights at Camp Moremi in a luxury tent on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 3:</h4>\n<p>Light air transfer from Camp Moremi to Camp Okavango in the Okavango Delta, Botswana.</p>\n<h1></h1>\n<h4>Day 3 - 5:</h4>\n<p>Spend 2 nights at Camp Okavango in a luxury suite on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 5:</h4>\n<p>Light air transfer from Camp Okavango to Savute Safari Lodge in the Savute, Botswana.</p>\n<h1></h1>\n<h4>Day 5 - 7:</h4>\n<p>Spend 2 nights at Savute Safari Lodge in a luxury chalet on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 7:</h4>\n<p>Light air transfer from Savute Safari Lodge to Maun International Airport.</p>\n<p>Depart Maun Airport as per own arrangements.</p>\n<p>End of trip.</p>\n<h4>Inclusions</h4>\n<ul>\n<li>All light air transfers</li>\n<li>All mentioned accommodations</li>\n<li>All meals, drinks (soft &amp;amp; alcoholic) &amp;amp; activities</li>\n</ul>\n<h4>Exclusions</h4>\n<ul>\n<li>International flights</li>\n<li>Visas (if necessary)</li>\n<li>Travel Insurance</li>\n</ul>\n","images":["optimized-images/favourite/1charming/3beautiful-botswana/1beautiful-botswana-large.webp","optimized-images/favourite/1charming/3beautiful-botswana/2beautifulbotswana-large.webp","optimized-images/favourite/1charming/3beautiful-botswana/3beautifulbotswana-large.webp","optimized-images/favourite/1charming/3beautiful-botswana/4beautifulbotswana-large.webp","optimized-images/favourite/1charming/3beautiful-botswana/5beautifulbotswana-large.webp","optimized-images/favourite/1charming/3beautiful-botswana/6beautifulbotswana-large.webp","optimized-images/favourite/1charming/3beautiful-botswana/7beautifulbotswana-large.webp","optimized-images/favourite/1charming/3beautiful-botswana/8beautifulbotswana-large.webp"],"subfolders":[{"title":"CAMP MOREMI","description":"Peering out beneath giant ebony trees, Camp Moremi is situated on the magnificent Xaxanaka Lagoon in the heart of the Moremi Wildlife Reserve within the Okavango Delta.\nThis area is known to have the best game viewing in Botswana, with superb predator sightings &amp; excellent year-round birding.\n\nCamp Moremi provides only 11 African-style safari tents, each individually sited on a raised teak platform with private adjacent facilities &amp; viewing deck, most offering unsurpassed views of the Xakanaxa Lagoon.  \nThere is also a luxury family safari tent, consisting of 2 separate bedrooms, 2 bathrooms &amp; a private deck with beautiful views over the Moremi Game Reserve.  All tents are en-suite.\nAn elegant, elevated thatch &amp; timber structure serves as the main building comprising a main sitting area, wildlife reference library, dining room and cocktail bar - inviting a true sense of the African wilderness. \nOther facilities include a secluded swimming pool with sundeck &amp; thatched boma where brunch and high tea are served.\n\nSafari activities consist of morning &amp; late afternoon game drives in open 4x4 vehicles, offering frequent sightings of lion, leopard, cheetah &amp; wild dog.  Guests can also explore the Xaxanaka Lagoon &amp; surrounding Okavango channels by motorboat.","image":"optimized-images/default.webp","folderName":"safaris/botswana/moremi-game-reserve/camp-moremi","created":null},{"title":"CAMP OKAVANGO","description":"Camp Okavango is set within the heart of the Okavango Delta on Nxaragha Island.  Surrounded by water channels &amp; spectacular scenery, this lodge is perfect for guests wishing to experience a classic Okavango Delta luxury safari.\nSince the camp is situated on a private island, guests can experience pure tranquillity &amp; seclusion – something that can only be found in the most remote regions of Botswana.\n\nThere are only 11 intimate safari suites on raised teak platforms, each equipped with an en-suite bathroom &amp; a large viewing deck.  The en-suite bathrooms each have double vanities, a double shower &amp; a separate water closet with a view.  \nThe stack away sliding doors open onto a private open-air viewing deck offering beautiful views over the Okavango Delta.\nFamilies travelling with children can stay in the family suite, consisting of 2 bedrooms &amp; 2 en-suite bathrooms.\nThe main lodge features a cocktail bar, sitting area &amp; wildlife library, with the dining room leading onto an expansive open-air patio where evenings are often enjoyed around the fire. Other facilities include a secluded bird-viewing hide &amp; sundeck with a plunge pool.\n\nCamp Okavango offers a year-round water experience in traditional mokoros (dug-out canoes), motorboat safaris &amp; bush walks on the many surrounding islands.  All safari activities are conducted by experienced guides.  \nGuests can also see the Okavango Delta from a helicopter – a truly magnificent experience. (additional cost)","image":"optimized-images/default.webp","folderName":"safaris/botswana/okavango-delta/camp-okavango","created":null},{"title":"SAVUTE SAFARI LODGE","description":"Located on the banks of the Savute Channel in the heart of the Chobe National Park, Savute Safari Lodge is an intimate safari lodge, accommodating only 24 guests in cool thatched timber &amp; glass suites.\nThe area is renowned for the unique interaction of the resident predator species &amp; herds of bull elephants.  The lodge offers privacy, luxury &amp; magnificent views over Africa’s wilderness.\nBecause Savute Safari Lodge overlooks both the Savute channel &amp; a natural waterhole, fantastic game viewing opportunities are available from your private viewing deck. This area is packed with wildlife, especially in the dry summer months when some of Africa’s wildest animals migrate to these water sources.\n\nThe 11 suites are designed to bring guests back to nature &amp; modern African décor contributes to the overall style of the lodge.  Each suite has a private deck, combined bedroom &amp; sitting area as well as en-suite facilities. \nThere is also a 2-bedroom family suite with en-suite bathrooms raised on an expansive deck.\nThe sitting area, library &amp; cocktail bar are situated in an exquisite thatch and timber main building.  Savute Safari Lodge boasts a viewing deck, an alfresco dining area &amp; a swimming pool – which is ideal for watching game at the waterhole.\n\nOpen 4x4 game drives are conducted in the Savute area, including the famous Savute Marsh, and the ancient San rock paintings at Gubatsa Hills add magic to a delightful African safari.","image":"optimized-images/default.webp","folderName":"safaris/botswana/the-savuti/savute-safari-lodge","created":null}],"parentCards":[{"title":"Charming","image":"optimized-images/favourite/1charming/1charming-small.webp","folderName":"favourite/1charming","isCurrentFolder":true},{"title":"2Stylish","image":"optimized-images/favourite/2stylish/1stylish-small.webp","folderName":"favourite/2stylish","isCurrentFolder":false},{"title":"3Exclusive","image":"optimized-images/favourite/3exclusive/1exclusive-small.webp","folderName":"favourite/3exclusive","isCurrentFolder":false}],"h1Title":"Beautiful Botswana","h2Title":"Charming","h3Title":"Beautiful Botswana","whatWeLoveItems":["Enjoy the best wildlife viewing in Africa","See the Okavango Delta from a bird’s eye view (small plane or helicopter)","Experience exciting and & water-based safari activities","Stay at intimate camps in remote settings","Savour spectacular views from the viewing decks","Go on thrilling game drives, guided walks, boating & mokoro safaris"],"params":{"slug":["favourite","1charming","3beautiful-botswana"]},"level":3},"__N_SSG":true}