{"pageProps":{"frontmatter":{"title":"ZAMBIA ADVENTURES","subtitle":"","article_title":"","canon":true,"lodges":"David Livingstone Lodge\nMfuwe Lodge\nBilimungwe Bushcamp\nZungulila Bushcamp\n"},"content":"<p style=\"visibility: collapse !important; margin-top: -10px;\">\n\n<p></p>\n</p>\n\n<h4>RATE</h4>\n<p><Rate>USD $ 3,000 – USD $ 6,000 per person</Rate></p>\n<h4>AREAS</h4>\n<p>Livingstone, South Luangwa (7 nights)</p>\n<h4>Trip Summary</h4>\n<ul>\n<li>2 nights:  David Livingstone Lodge, Livingstone – Zambia</li>\n<li>1 night:  Mfuwe Lodge, South Luangwa – Zambia</li>\n<li>2 nights:  Bilimungwe Bushcamp, South Luangwa – Zambia</li>\n<li>2 nights:  Zungulila Bushcamp, South Luangwa – Zambia</li>\n</ul>\n<h4>Trip Overview</h4>\n<h1></h1>\n<h4>Day 1:</h4>\n<p>Upon arrival at Livingstone International Airport, you will be transferred by road to David Livingstone Lodge in Livingstone, Zambia.</p>\n<h1></h1>\n<h4>Day 1 – 3:</h4>\n<p>Spend 2 nights at David Livingstone Lodge in a luxury room on a bed &amp; breakfast basis.</p>\n<p>During your stay, you will depart on a Guided Tour of Victoria Falls, a Sunset Boat Cruise &amp; Helicopter Flight over the Falls.</p>\n<h1></h1>\n<h4>Day 3:</h4>\n<p>Road transfer from David Livingstone Lodge to Livingstone International Airport.</p>\n<p>Scheduled flight from Livingstone to Mfuwe with Proflight – economy.</p>\n<p>Road transfer from Mfuwe Airport to Mfuwe Lodge in South Luangwa, Zambia.</p>\n<p>Overnight at Mfuwe Lodge in a luxury chalet on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 4:</h4>\n<p>Road transfer from Mfuwe Lodge to Bilimungwe Bushcamp in South Luangwa, Zambia.</p>\n<h1></h1>\n<h4>Day 4 – 6:</h4>\n<p>Spend 2 nights at Bilimungwe Bushcamp in a luxury chalet on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 6:</h4>\n<p>Road transfer from Bilimungwe Bushcamp to Zungulila Bushcamp in South Luangwa, Zambia.</p>\n<h1></h1>\n<h4>Day 6 – 8:</h4>\n<p>Spend 2 nights at Zungulila Bushcamp in a luxury chalet on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 8:</h4>\n<p>Road transfer from Zungulila Bushcamp to Mfuwe Airport.</p>\n<p>Scheduled flight from Mfuwe to Livingstone with Proflight – economy.</p>\n<p>Depart Livingstone International Airport as per own arrangements.</p>\n<p>End of trip.</p>\n<h4>Inclusions</h4>\n<ul>\n<li>All regional flights</li>\n<li>All road transfers</li>\n<li>All mentioned private tours &amp;amp; activities</li>\n<li>All mentioned accommodations</li>\n<li>On safari&#58;  All meals, drinks (soft &amp;amp; alcoholic) &amp; activities </li>\n<li>Elsewhere&#58;  Bed &amp;amp; breakfast basis</li>\n</ul>\n<h4>Exclusions</h4>\n<ul>\n<li>International flights</li>\n<li>Visas (if necessary)</li>\n<li>Travel Insurance</li>\n</ul>\n","images":["optimized-images/favourite/1charming/5zambia-adventures/1zambia-adventures-large.webp","optimized-images/favourite/1charming/5zambia-adventures/2zambia-adventures-large.webp","optimized-images/favourite/1charming/5zambia-adventures/3zambia-adventures-large.webp","optimized-images/favourite/1charming/5zambia-adventures/4zambia-adventures-large.webp","optimized-images/favourite/1charming/5zambia-adventures/5zambia-adventures-large.webp","optimized-images/favourite/1charming/5zambia-adventures/6zambia-adventures-large.webp","optimized-images/favourite/1charming/5zambia-adventures/7zambia-adventures-large.webp","optimized-images/favourite/1charming/5zambia-adventures/8zambia-adventures-large.webp"],"subfolders":[{"title":"DAVID LIVINGSTONE LODGE","description":"David Livingstone Lodge &amp; Spa is centrally located only 5km from the town of Livingstone in Zambia &amp; offers a unique location with breathtaking views.\nAs the name suggests, the majestic waterfall was discovered by the famous explorer, Dr David Livingstone in 1855 &amp; is a must-see for guests visiting Zambia.\n\nDavid Livingstone Lodge consists of 72 standard rooms (of which 3 rooms are inter-leading) &amp; 5 suites. \nMost of the rooms offer breathtaking views over the mighty Zambezi River from the private balconies where leisurely sundowners can be enjoyed.\nAll rooms are spacious &amp; beautifully decorated.  \nThe main deck area has a sparkling swimming pool &amp; is built right on the river - offering a true gastronomic experience.  This is an ideal place to relax, put up your feet &amp; enjoy some of Africa’s most beautiful sunsets.\n\nActivities at David Livingstone Lodge are plentiful. \nSome of these include river cruises on the fully equipped Lady Livingstone Steamer, invigorating massages at the Camelot Spa, micro-light flights over Vic Falls, elephant-back safaris, &amp; bungee jumping.\nOthers include canoe safaris on the Zambezi River, white-water river rafting, trips to Livingstone Island &amp; swimming at Devil’s Pool.","image":"optimized-images/default.webp","folderName":"cities/livingstone/david-livingstone-lodge","created":null},{"title":"MFUWE LODGE","description":"The award-winning Mfuwe Lodge enjoys a prime location in Zambia’s game-rich Luangwa Valley in South Luangwa National Park.\nThis unspoilt area is filled with its oxbow lagoons, riverine woodlands &amp; large plains - &amp; is home to an abundance of game, including lion, leopard, elephant, buffalo, giraffe, hippo &amp; over 450 bird species.\nGuests travelling to South Luangwa will be able to explore this pristine bush environment on foot while being accompanied by an expert guide.\n\nMfuwe Lodge features 18 thatched en-suite chalets, each with a secluded covered veranda that looks out over the lagoon with its wallowing hippo &amp; thirsty game.  \nEach chalet has a comfortable sitting area &amp; panoramic walk-in shower.\nThe main lodge area comprises a swimming pool, bar, library, gym &amp; bush spa where relaxing treatments can be enjoyed.\n\nGuests can venture out on exciting day &amp; night drives as well as explore the bush on foot with expert guides.\nTime can also be spent getting pampered at the bush spa or taking a refreshing dip in the swimming pool with a cocktail in hand.","image":"optimized-images/default.webp","folderName":"safaris/zambia/south-luangwa-national-park/mfuwe-lodge","created":null},{"title":"BILIMUNGWE BUSHCAMP","description":"Bilimungwe Bushcamp enjoys an ideal location in the wild &amp; unspoilt region of Zambia’s South Luangwa National Park.\nThis intimate &amp; remote safari camp boasts an ideal setting on the shaded banks of the Luangwa River, with views over the wildlife-packed grassy floodplains – a nature lover’s paradise!\nTravellers looking for an off-the-beaten-track safari experience will love Bilimungwe with its beautiful reed &amp; thatch chalets – the perfect blend between rustic &amp; luxury.\nThe camp is seasonal &amp; is only open from May to December.\n\nThere are only 4 raised chalets at Bilimungwe – each carefully designed to maximize the views of 1 or 2 of the 3 waterholes in front of camp.\nEach elegant chalet features an en-suite bathroom with an open-air waterfall shower &amp; a private viewing deck.\nThe main lodge area comprises a lounge, bar &amp; dining room built on stilts around a large, old termite mound under an ancient mahogany tree which provides ample shade from the hot sunshine.  \nBilimungwe’s secret breakfast spot – on the edge of Luangwa Valley – is the ideal place to watch the sunrise over the Chindeni Hills.\n\nA variety of safari activities are available at Bilimungwe Bushcamp.  \nThese include open 4x4 game drives with professional guides &amp; trackers as well as guided morning &amp; afternoon walking safaris where guests can explore the bush on foot – while watching the sunset. \nIn between activities, time can be spent in one of the lazy hammocks set in a beautiful spot overlooking the Luangwa River.","image":"optimized-images/default.webp","folderName":"safaris/zambia/south-luangwa-national-park/bilimungwe-bushcamp","created":null},{"title":"ZUNGULILA BUSHCAMP","description":"Zungulila Bushcamp boasts a beautiful setting overlooking the Kapamba River in Zambia’s South Luangwa National Park.\nThe camp sits on a raised knoll above picturesque plains &amp; natural springs – a magnet for attracting wildlife year-round.\nSouth Luangwa is as wild &amp; remote as it gets, but Zungulila does not compromise on the everyday comforts!  Travellers looking for an authentic tented safari experience combined with a little luxury will fall in love with Zungulila.\nThe camp is seasonal &amp; only open from April to January – during the best wildlife season.\n\nZungulila has 4 spacious tented suites built under thatched roofs.  \nEach tent boasts a private bamboo veranda with panoramic views over an impressive variety of wildlife – from thirsty elephants at the springs &amp; flocks of birds by the river to prowling lions &amp; large herds of buffalo on the grassy plains.\nThe en-suite bathrooms have outdoor showers &amp; sunken plunge pools for hot summer days.  \nThe main area comprises a lounge area, a large wooden deck where al fresco dinners are served under the stars &amp; an open-air boma.\n\nActivities at Zungulila Bushcamp include day &amp; night drives in open 4x4 vehicles in search of Africa’s fiercest predators as well as guided walking safaris where a qualified tracker will share his expert knowledge of the bush. \nGuests can also relax on the deck while watching animals drink or play in the nearby waterhole.","image":"optimized-images/default.webp","folderName":"safaris/zambia/south-luangwa-national-park/zungulila-bushcamp","created":null}],"parentCards":[{"title":"Charming","image":"optimized-images/favourite/1charming/1charming-small.webp","folderName":"favourite/1charming","isCurrentFolder":true},{"title":"2Stylish","image":"optimized-images/favourite/2stylish/1stylish-small.webp","folderName":"favourite/2stylish","isCurrentFolder":false},{"title":"3Exclusive","image":"optimized-images/favourite/3exclusive/1exclusive-small.webp","folderName":"favourite/3exclusive","isCurrentFolder":false}],"h1Title":"Zambia Adventures","h2Title":"Charming","h3Title":"Zambia Adventures","whatWeLoveItems":["Witness the majestic Victoria Falls","See resident elephants visit Mfuwe Lodge’s reception","Go off-the-beaten-track in South Luangwa","Experience the best walking safaris in Africa","Enjoy beautiful riverside settings","Stay at intimate bush camps in unspoilt regions"],"params":{"slug":["favourite","1charming","5zambia-adventures"]},"level":3},"__N_SSG":true}