{"pageProps":{"frontmatter":{"title":"KENYA ON A SHOESTRING","subtitle":"","article_title":"","canon":true,"lodges":"Nairobi Tented Camp\nPorini Amboseli Camp\nPorini Mara Camp\n"},"content":"<p style=\"visibility: collapse !important; margin-top: -10px;\">\n\n<p></p>\n</p>\n\n<h4>RATE</h4>\n<p><Rate>USD $ 3,000 – USD $ 6,000 per person</Rate></p>\n<h4>AREAS</h4>\n<p>Nairobi, Amboseli, Masai Mara (6 nights)</p>\n<h4>Trip Summary</h4>\n<ul>\n<li>1 night:  Nairobi Tented Camp, Nairobi – Kenya</li>\n<li>2 nights:  Porini Amboseli Camp, Amboseli – Kenya</li>\n<li>3 nights:  Porini Mara Camp, Masai Mara – Kenya</li>\n</ul>\n<h4>Trip Overview</h4>\n<h1></h1>\n<h4>Day 1:</h4>\n<p>Upon arrival at Nairobi Jomo Kenyatta International Airport, you will be transferred by road to Nairobi Tented Camp in Nairobi, Kenya.</p>\n<p>Overnight at Nairobi Tented Camp in a luxury tent on a bed &amp; breakfast basis. </p>\n<h1></h1>\n<h4>Day 2:</h4>\n<p>Road transfer from Nairobi Tented Camp to Nairobi Wilson Airport.</p>\n<p>Scheduled flight from Nairobi Wilson Airport to Amboseli Airstrip with Safarilink – economy.</p>\n<p>Road transfer from Amboseli Airstrip to Porini Amboseli Camp in Amboseli National Park, Kenya.</p>\n<h1></h1>\n<h4>Day 2 - 4:</h4>\n<p>Spend 2 nights at Porini Amboseli Camp in a luxury tent on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 4:</h4>\n<p>Road transfer from Porini Amboseli Camp to Amboseli Airstrip.</p>\n<p>Scheduled flight from Amboseli Airstrip to Siana Airstrip (via Nairobi Wilson Airport) with Safarilink – economy.</p>\n<h1></h1>\n<h4>Day 4 - 7:</h4>\n<p>Spend 3 nights at Porini Mara Camp in a luxury tent on a fully inclusive basis.</p>\n<h1></h1>\n<h4>Day 7:</h4>\n<p>Road transfer from Porini Mara Camp to Siana Airstrip.</p>\n<p>Scheduled flight from Siana Airstrip to Nairobi Wilson Airport.</p>\n<p>Road transfer from Nairobi Wilson Airport to Nairobi Jomo Kenyatta International Airport.</p>\n<p>Depart Nairobi Jomo Kenyatta International Airport as per own arrangements.</p>\n<p>End of trip.</p>\n<h4>Inclusions</h4>\n<ul>\n<li>All regional flights</li>\n<li>All road transfers</li>\n<li>All mentioned accommodations</li>\n<li>On safari&#58;  All meals, drinks (soft &amp;amp; alcoholic) &amp;amp; activities</li>\n<li>Elsewhere&#58;  Bed &amp;amp; breakfast basis</li>\n<li></li>\n</ul>\n<h4>Exclusions</h4>\n<ul>\n<li>International flights</li>\n<li>Visas (if necessary)</li>\n<li>Travel Insurance</li>\n</ul>\n","images":["optimized-images/favourite/1charming/6kenya-on-a-shoestring/1kenya-on-a-shoestring-large.webp","optimized-images/favourite/1charming/6kenya-on-a-shoestring/2kenya-on-a-shoestring-large.webp","optimized-images/favourite/1charming/6kenya-on-a-shoestring/3kenya-on-a-shoestring-large.webp","optimized-images/favourite/1charming/6kenya-on-a-shoestring/4kenya-on-a-shoestring-large.webp","optimized-images/favourite/1charming/6kenya-on-a-shoestring/5kenya-on-a-shoestring-large.webp","optimized-images/favourite/1charming/6kenya-on-a-shoestring/6kenya-on-a-shoestring-large.webp","optimized-images/favourite/1charming/6kenya-on-a-shoestring/7kenya-on-a-shoestring-large.webp","optimized-images/favourite/1charming/6kenya-on-a-shoestring/8kenya-on-a-shoestring-large.webp"],"subfolders":[{"title":"NAIROBI TENTED CAMP","description":"Nairobi Tented Camp enjoys an ideal setting within the Nairobi National Park – an authentic big game reserve on the outskirts of the city.  \nTucked away in a riverine forest, this charming, tented camp is a great introduction to a Kenya safari.  \nNairobi Tented Camp is an ideal choice for guests who need to stop over in Nairobi before or after a Kenya safari, but still prefer to get away from the hustle &amp; bustle of city life.\nThe park is home to over 100 mammal species - including rhino (a rare sighting in the Mara) as well as buffalo, giraffe, lion, leopard, baboon, zebra, wildebeest &amp; cheetah.  Bird enthusiasts can spot over 400 migratory &amp; endemic birds here.\n\nThe camp consists of 9 luxury tents, all equipped with en-suite facilities.  Each en-suite bathroom features a hot bucket shower, basin &amp; toilet.\nEach spacious tent has an exclusive, yet friendly feel.  Tastefully furnished with local material, the tents have private verandas offering beautiful views over the bush.\nThe central mess tent houses the bar, dining &amp; lounge facilities.\n\nActivities at Nairobi Tented Camp include open 4x4 game drives, guided walks as well as city tours to see the Sheldrick Elephant Orphanage, Giraffe Centre &amp; Karen Blixen Museum.","image":"optimized-images/default.webp","folderName":"cities/nairobi/nairobi-tented-camp","created":null},{"title":"PORINI AMBOSELI CAMP","description":"The award-winning Amboseli Porini Camp is set within the private Selenkay Conservation area which lies a few miles north of the Amboseli National Park.  \nThis area is home to an abundance of resident game &amp; migrating wildlife - including elephant, lion, leopard, cheetah &amp; a variety of bird species.  \nSince the camp is set within a private concession, day &amp; night drives are permitted – so guests will have the opportunity to experience close-up wildlife encounters during the day &amp; spot nocturnal animals at night.\n\nAccommodation at Porini Amboseli comprises 10 spacious tents.  \nEach canvas tent is unfussy yet comfortable, with a private veranda, an en-suite bathroom with a bucket walk-in shower.\nThe communal tent includes a lounge &amp; dining area where relaxing meals are enjoyed.\n\nDaily safari activities include open 4x4 game drives, guided nature walks &amp; night drives where guests will look for nocturnal animals with a spotlight.  \nBird enthusiasts will be delighted to know that the area is known for its wide range of birds of prey.","image":"optimized-images/default.webp","folderName":"safaris/kenya/amboseli-national-park/porini-amboseli-camp","created":null},{"title":"PORINI MARA CAMP","description":"Porini Mara Camp is set within the exclusive Ol Kineyi Conservancy, a private safari haven bordering the Masai Mara in Kenya.\nThe conservancy belongs to the local Maasai community who have recently set aside the area as a sanctuary for wildlife, resulting in an abundance of game – putting Porini Mara on the map as a sought-after safari destination.\nPorini Mara Camp offers a traditional safari experience in luxury tents as well as a range of exciting wildlife activities.\n\nAccommodation at Porini Mara Camp consists of just 6 safari tents with 1 of them being a family unit that has a central connecting lounge. \nEach spacious tent has been tastefully furnished &amp; contains a double &amp; a single bed as well as an en-suite bathroom with a bucket shower &amp; a private veranda with spectacular views.\nThere is also a main tent with a communal dining area &amp; a cosy lounge.\n\nA range of exhilarating safari activities is available at Porini Mara Camp.\nThese include morning, afternoon &amp; evening game drives with an expert ranger, guided walks with a Maasai guide as well as bush breakfasts or lunches.","image":"optimized-images/default.webp","folderName":"safaris/kenya/masai-mara/porini-mara-camp","created":null}],"parentCards":[{"title":"Charming","image":"optimized-images/favourite/1charming/1charming-small.webp","folderName":"favourite/1charming","isCurrentFolder":true},{"title":"2Stylish","image":"optimized-images/favourite/2stylish/1stylish-small.webp","folderName":"favourite/2stylish","isCurrentFolder":false},{"title":"3Exclusive","image":"optimized-images/favourite/3exclusive/1exclusive-small.webp","folderName":"favourite/3exclusive","isCurrentFolder":false}],"h1Title":"Kenya On A Shoestring","h2Title":"Charming","h3Title":"Kenya On A Shoestring","whatWeLoveItems":["Tick off the Big 5","Explore the bush on foot with Masai warriors","Stay comfortably at intimate safari camps","Experience day & night drives","Take a scenic hot air balloon flight over the Masai Mara","Feel at home in a relaxed & friendly setting"],"params":{"slug":["favourite","1charming","6kenya-on-a-shoestring"]},"level":3},"__N_SSG":true}