{"pageProps":{"frontmatter":{"title":"THE CLARENDON BANTRY BAY","subtitle":"","article_title":"","canon":true},"content":"<h4>Experience</h4>\n<p>At the foot of Lion’s Head in a secluded, ocean-facing enclave of Bantry Bay, lies an elegant boutique hotel that offers only the best in barefoot city luxury:  The Clarendon Bantry Bay.<br>Ideal for discerning travellers, this quiet retreat is just minutes away from the popular V&amp;A Waterfront with its stylish cafes, restaurants &amp; shops while Cape Town’s most beautiful beaches – Clifton &amp; Camps Bay – are only a stone’s throw away.<br>The boutique hotel offers breathtaking views over the Atlantic Ocean &amp; is sheltered from the summer winds, making this a wonderful choice for guests who want a little seclusion &amp; tranquillity after a busy day or city exploration.<br>Complimentary High Tea is served each day &amp; friendly staff will ensure that all your needs &amp; requirements are looked after.</p>\n<h4>Stay</h4>\n<p>There are 13 rooms &amp; suites at The Clarendon Bantry Bay, all equipped with air-conditioning &amp; en-suite bathrooms.  Accommodation comprises standard rooms, superior rooms, superior suites &amp; Clarendon Suites.<br>The standard rooms are stylishly decorated &amp; have partial or no sea views while the spacious superior rooms offer partial or full sea views.  Superior suites have private patios or balconies &amp; beautiful ocean views while elegant Clarendon Suites boast uninterrupted views of the Atlantic Ocean.<br>Facilities at The Clarendon Bantry Bay include an on-site restaurant, a mini spa &amp; a refreshing swimming pool.</p>\n<h4>Activities</h4>\n<p>There is a never-ending list of things to do in Cape Town – from visiting Clifton &amp; Camps Bay beaches, shopping at the V&amp;A Waterfront &amp; wine-tasting in the Cape Winelands to spending time with the adorable penguins at Boulders Beach or having a picnic in Kirstenbosch Gardens.<br>Other options like shark-cage diving or whale watching can also be arranged.  Cape Town offers a variety of nature trails, hikes, picnic spots &amp; adventure sports like kite surfing, windsurfing, stand-up paddleboarding, paragliding, sandboarding, horse riding &amp; much more.</p>\n","images":["optimized-images/safaris/south-africa/cape-town/the-clarendon-bantry-bay/1theclarendonbantrybay-large.webp","optimized-images/safaris/south-africa/cape-town/the-clarendon-bantry-bay/2theclarendonbantrybay-large.webp","optimized-images/safaris/south-africa/cape-town/the-clarendon-bantry-bay/3theclarendonbantrybay-large.webp","optimized-images/safaris/south-africa/cape-town/the-clarendon-bantry-bay/4theclarendonbantrybay-large.webp","optimized-images/safaris/south-africa/cape-town/the-clarendon-bantry-bay/5theclarendonbantrybay-large.webp","optimized-images/safaris/south-africa/cape-town/the-clarendon-bantry-bay/6theclarendonbantrybay-large.webp","optimized-images/safaris/south-africa/cape-town/the-clarendon-bantry-bay/7theclarendonbantrybay-large.webp","optimized-images/safaris/south-africa/cape-town/the-clarendon-bantry-bay/8theclarendonbantrybay-large.webp"],"subfolders":[{"title":"21 Nettleton","description":"The exclusive &amp; luxurious 21 Nettleton is perched on the slopes of Lion’s Head peak in Cape Town &amp; offers breathtaking views of the Twelve Apostles mountain range, the deep-blue Indian Ocean &amp; the affluent Clifton neighbourhood with its 4 beautiful beaches. The boutique hotel boasts elegant grounds – including the area’s largest private gardens &amp; manicured lawns – promising a tranquil stay.","image":"optimized-images/safaris/south-africa/cape-town/21-nettleton/121nettleton-small.webp","folderName":"safaris/south-africa/cape-town/21-nettleton"},{"title":"African Elite","description":"African Elite Properties provides luxury serviced accommodation in exclusive homes &amp; apartments in Cape Town’s renowned V&amp;A Waterfront &amp; De Waterkant areas.   All properties are located within walking distance of some of Cape Town’s most popular restaurants, shops &amp; nightlife.  ","image":"optimized-images/safaris/south-africa/cape-town/african-elite/1africanelite-small.webp","folderName":"safaris/south-africa/cape-town/african-elite"},{"title":"Belmond Mount Nelson Hotel","description":"Everyone has heard about the Belmond Mount Nelson Hotel.  An oasis of calm within Cape Town’s beating heart, the pink hotel is set at the foot of Table Mountain &amp; takes us back to a bygone era of exquisite interiors &amp; exceptional service. The award-winning Mount Nelson has been delivering its famous blend of warm hospitality &amp; fine living for over a century.  ","image":"optimized-images/safaris/south-africa/cape-town/belmond-mount-nelson-hotel/1belmondmountnelsonhotel-small.webp","folderName":"safaris/south-africa/cape-town/belmond-mount-nelson-hotel"},{"title":"Bungalow 52","description":"Bungalow 52 is an exclusive beach villa that boasts one of the best locations in Cape Town – just a few steps from the fashionable Clifton 4th Beach. This tri-level 3-bedroom beach villa provides an unspoilt beach experience less than 10 steps from your front door &amp; is a short walk from some of Cape Town’s golden beaches, including the glamorous Camps Bay.","image":"optimized-images/safaris/south-africa/cape-town/bungalow-52/1bungalow52-small.webp","folderName":"safaris/south-africa/cape-town/bungalow-52"},{"title":"Camissa House","description":"With the iconic Table Mountain as a backdrop, Camissa House celebrates uninterrupted views of the city &amp; provides guests with one of the most sought-after locations in Cape Town. Sister to the award-winning Manna Bay Hotel &amp; Silvan Safari Lodge, Camissa House is a haven for boutique travellers from across the globe","image":"optimized-images/safaris/south-africa/cape-town/camissa-house/1camissahouse-small.webp","folderName":"safaris/south-africa/cape-town/camissa-house"},{"title":"Camps Bay Retreat","description":"Camps Bay Retreat, like the name suggests, is tucked away on a private estate, a stone throw away from fashionable Camps Bay, one of Cape Town’s most spectacular beaches.   This luxurious boutique hotel offers a sanctuary for the mind &amp; body in a tranquil, forested hideaway.","image":"optimized-images/safaris/south-africa/cape-town/camps-bay-retreat/1campsbayretreat-small.webp","folderName":"safaris/south-africa/cape-town/camps-bay-retreat"},{"title":"Cape Cadogan","description":"Cape Cadogan is a modern, chic boutique hotel set in the heart of Cape Town, with Table Mountain, Devil’s Peak &amp; Lions Head as the backdrop.  This Victorian-Georgian building dates back to the 1800s, &amp; now a national monument, the interior boasts dramatic fabrics &amp; antique furniture. With a convenient location near the trendy Kloof Street, the hotel is an ideal base from which to explore Cape Town’s main tourist attractions, such as Table Mountain, Camps Bay &amp; the V&amp;A Waterfront.","image":"optimized-images/safaris/south-africa/cape-town/cape-cadogan/1capecadogan-small.webp","folderName":"safaris/south-africa/cape-town/cape-cadogan"},{"title":"Cape Grace","description":"The luxurious Cape Grace boasts an excellent location in Cape Town’s V&amp;A Waterfront, overlooking Table Mountain &amp; the harbour.   This 5-star hotel is a gracious sanctuary of sophistication &amp; contemporary comfort.","image":"optimized-images/safaris/south-africa/cape-town/cape-grace/1capegrace-small.webp","folderName":"safaris/south-africa/cape-town/cape-grace"},{"title":"Cape View Clifton","description":"Cape View Clifton is a secluded haven near the fashionable Clifton &amp; Camps Bay beaches, offering sensational views of the mountain &amp; ocean. Centrally located within minutes of the city of Cape Town, the boutique hotel provides convenient access to many of the spectacular sights of the area – the Twelve Apostles, Lion’s Head, Signal Hill, Table Mountain, Kirstenbosch Gardens &amp; Clifton’s very own Blue Flag beaches.","image":"optimized-images/safaris/south-africa/cape-town/cape-view-clifton/1capeviewclifton-small.webp","folderName":"safaris/south-africa/cape-town/cape-view-clifton"},{"title":"Cloud Nine Boutique Hotel","description":"With Table Mountain as the backdrop &amp; trendy Kloof Street with its restaurants, bars, boutiques &amp; cafes only a stone throw away, Cloud Nine Boutique Hotel offers a relaxed &amp; vibrant experience in one of the most exciting cities in the world. From its rooftop bar &amp; splash pool, sensational views of Table Mountain can be enjoyed, so after a day of city exploration, guests can watch the sunset while sipping on a delicious cocktail.","image":"optimized-images/safaris/south-africa/cape-town/cloud-nine-boutique-hotel/1cloudnineboutiquehotel-small.webp","folderName":"safaris/south-africa/cape-town/cloud-nine-boutique-hotel"},{"title":"Compass House","description":"The five-star boutique hotel, Compass House enjoys a spectacular setting in trendy Bantry Bay &amp; boasts sensational views of the ocean from every room of the house. Cape Town’s city centre is only a 10-minute drive away, so guests will have the added benefit of a 5-star beach experience that is away from the hustle &amp; bustle of city life, yet close enough to many award-winning restaurants, boutique shops &amp; top attractions.","image":"optimized-images/safaris/south-africa/cape-town/compass-house/1compasshouse-small.webp","folderName":"safaris/south-africa/cape-town/compass-house"},{"title":"Dock House","description":"With a prime location in the heart of Cape Town’s V&amp;A Waterfont, Dock House provides the perfect base from which to explore the city – while still maintaining the highest level of luxury &amp; service. Originally the Harbor Master’s 1800’s home, Dock House combines classic Victorian architecture with contemporary style.  The boutique offers only 6 suites &amp; 24-hour butler service, both adding to the intimate &amp; personal atmosphere.","image":"optimized-images/safaris/south-africa/cape-town/dock-house/1dockhouse-small.webp","folderName":"safaris/south-africa/cape-town/dock-house"},{"title":"Ellerman House","description":"Ellerman House is an elegant villa like no other.  Set on the mountainside, overlooking Bantry Bay, this boutique hotel offers exceptional service &amp; exquisite accommodation.   This historical mansion has been fully restored &amp; lavishly decorated with South African art to create an opulent retreat, ideal for the discerning traveller.","image":"optimized-images/safaris/south-africa/cape-town/ellerman-house/1ellermanhouse-small.webp","folderName":"safaris/south-africa/cape-town/ellerman-house"},{"title":"Gorgeous George Boutique Hotel","description":"Gorgeous George Boutique Hotel is set in a beautifully restored historic building in the heart of Cape Town’s city centre &amp; offers a range of cosy studios &amp; larger suites to the sleek urban traveller.   The hotel offers the perfect blend between art, innovative design &amp; fine cuisine.  Within walking distance, you will find important landmarks such as Greenmarket Square &amp; the Company Gardens.  Camps Bay &amp; the V&amp;A Waterfront are a short drive away.","image":"optimized-images/safaris/south-africa/cape-town/gorgeous-george-boutique-hotel/1gorgeousgeorgeboutiquehotel-small.webp","folderName":"safaris/south-africa/cape-town/gorgeous-george-boutique-hotel"},{"title":"Kensington Place","description":"Kensington Place is located within a quiet street high on the slopes of Table Mountain.  This intimate boutique hotel oozes luxury, elegance &amp; outstanding attention to detail.   Management will ensure that guests are not only looked after but receive exceptional service throughout their stay.","image":"optimized-images/safaris/south-africa/cape-town/kensington-place/1kensingtonplace-small.webp","folderName":"safaris/south-africa/cape-town/kensington-place"},{"title":"Manna Bay","description":"Ever dreamt of experiencing luxury boutique living at its best?  Look no further because Manna Bay will exceed your expectations from beginning to end! Located in the heart of Cape Town – quite literally adjacent to Table Mountain – guests will be blown away by the ideal setting of being so close to one of the world’s greatest landmarks.  A gate leads directly from Manna Bay’s grounds to the spectacular Table Mountain National Park.  You can’t get much closer than this!","image":"optimized-images/safaris/south-africa/cape-town/manna-bay/1mannabay-small.webp","folderName":"safaris/south-africa/cape-town/manna-bay"},{"title":"More Quarters","description":"More Quarters offers their guests exactly that….More.   More space, more luxury &amp; more personal service. Operating exactly like a hotel, guests will still enjoy the benefits of a hotel – including concierge, breakfast, daily cleaning &amp; personal attention, while enjoying extra comforts like space &amp; privacy.","image":"optimized-images/safaris/south-africa/cape-town/more-quarters/1morequarters-small.webp","folderName":"safaris/south-africa/cape-town/more-quarters"},{"title":"Morukuru Beach Lodge","description":"Morukuru Beach Lodge is perched above the sun-bleached dunes of De Hoop Nature Reserve, offering sensational views over the unspoilt Indian Ocean coastline that plays host to migrating southern right whales between July &amp; November each year. During whale season, hundreds arrive to feed, breed &amp; give birth &amp; guests can easily see these amazing creatures from the comfort of land.","image":"optimized-images/safaris/south-africa/cape-town/morukuru-beach-lodge/1morukurubeachlodge-small.webp","folderName":"safaris/south-africa/cape-town/morukuru-beach-lodge"},{"title":"Nox Apartments & Villas","description":"Nox Apartments &amp; Villas provides luxury serviced accommodation in exclusive homes &amp; villas in one of Cape Town’s most sought-after areas:   The beautiful Atlantic Seaboard.   All properties are located near Cape Town’s best beaches or attractions, including Clifton, Camps Bay, Bantry Bay as well as the V&amp;A Waterfront, De Waterkant &amp; Cape Town City Bowl.","image":"optimized-images/safaris/south-africa/cape-town/nox-apartments--villas/1noxapartments&villas-small.webp","folderName":"safaris/south-africa/cape-town/nox-apartments-villas"},{"title":"O On Kloof Boutique Hotel","description":"O on Kloof is set within the exclusive residential Atlantic Seaboard neighbourhood of Bantry Bay - quite central to Cape Town’s premier beaches &amp; top attractions like Table Mountain &amp; the V&amp;A Waterfront. One of Tatler’s Top 101 Hotels in the World &amp; awarded TripAdvisor’s Travelers Choice Award in 2021, O on Kloof delivers exceptional service, stylish décor &amp; sophisticated ambience.","image":"optimized-images/safaris/south-africa/cape-town/o-on-kloof-boutique-hotel/1oonkloofboutiquehotel-small.webp","folderName":"safaris/south-africa/cape-town/o-on-kloof-boutique-hotel"},{"title":"One & Only Cape Town","description":"Everyone is familiar with the One &amp; Only.  One of the city’s best hotels, One &amp; Only Cape Town is located within the heart of the famous V&amp;A Waterfront &amp; offers sophisticated flair close to the city’s top attractions. Table Mountain provides a spectacular natural backdrop &amp; on your doorstep, you will find world-class shopping, award-winning restaurants &amp; the beautiful V&amp;A harbour with its stylish yachts &amp; colourful fishing boats.","image":"optimized-images/safaris/south-africa/cape-town/one--only-cape-town/1one&onlycapetown-small.webp","folderName":"safaris/south-africa/cape-town/one-only-cape-town"},{"title":"POD Boutique Hotel","description":"The chic &amp; stylish POD Boutique Hotel boasts a spectacular setting a few steps from the beach along Camps Bay’s strip with its trendy restaurants, cafes &amp; bars. This Soho-style beach house offers clean lines, infinity pools &amp; huge sliding doors to invite the beach &amp; mountain in.  ","image":"optimized-images/safaris/south-africa/cape-town/pod-boutique-hotel/1podboutiquehotel-small.webp","folderName":"safaris/south-africa/cape-town/pod-boutique-hotel"},{"title":"Queen Victoria Hotel","description":"The sophisticated Queen Victoria Hotel is situated within a precinct of heritage buildings along the main road leading to Cape Town’s V&amp;A Waterfront. Offering the perfect base from which to explore the city, the hotel is within walking distance to the V&amp;A Waterfront’s top attractions as well as a host of fine dining restaurants, art galleries &amp; boutiques.","image":"optimized-images/safaris/south-africa/cape-town/queen-victoria-hotel/1queenvictoriahotel-small.webp","folderName":"safaris/south-africa/cape-town/queen-victoria-hotel"},{"title":"Radisson Blu Hotel Waterfront","description":"At the edge of the Atlantic Ocean, overlooking a private marina, you will find Radisson Blu Hotel Waterfront.   Offering an ideal base from which to explore vibrant Cape Town, the hotel is situated just a short walk away from the V&amp;A Waterfront with its many cafes, restaurants &amp; boutiques.","image":"optimized-images/safaris/south-africa/cape-town/radisson-blu-hotel-waterfront/1radissonbluhotelwaterfront-small.webp","folderName":"safaris/south-africa/cape-town/radisson-blu-hotel-waterfront"},{"title":"Rovos Rail","description":"Rovos Rail offers a luxury train holiday like no other.   Apart from owning &amp; operating the most luxurious trains in the world, Rovos Rail offers guests a variety of train journeys - each ranging from 2 nights to 2 weeks.","image":"optimized-images/safaris/south-africa/cape-town/rovos-rail/1rovosrail-small.webp","folderName":"safaris/south-africa/cape-town/rovos-rail"},{"title":"Table Bay Hotel","description":"The stylish Table Bay Hotel enjoys a prime location within Cape Town’s picturesque working harbour &amp; offers guests direct access to the V&amp;A Waterfront with its trendy boutiques, cafes &amp; restaurants. The hotel has a nautical feel that is similar to some of the great cruise liners &amp; grand hotels around the world.  ","image":"optimized-images/safaris/south-africa/cape-town/table-bay-hotel/1tablebayhotel-small.webp","folderName":"safaris/south-africa/cape-town/table-bay-hotel"},{"title":"Taj Cape Town","description":"The impeccably restored Taj Cape Town pays tribute to its former glory as the South African Reserve Bank &amp; other historic buildings that were constructed in the 1890s. Located in the centre of the old city, guests are within walking distance to the Company Gardens, St George’s Cathedral &amp; Greenmarket Square as well as an eclectic array of restaurants, shops &amp; galleries.","image":"optimized-images/safaris/south-africa/cape-town/taj-cape-town/1tajcapetown-small.webp","folderName":"safaris/south-africa/cape-town/taj-cape-town"},{"title":"The Bay Hotel","description":"The Bay Hotel is situated on the trendy Victoria Road in one of Cape Town’s most prestigious beach towns, Camps Bay.   Located at the foot of the majestic Twelve Apostles mountain range, with views of the Atlantic Ocean, the hotel enjoys a beautiful backdrop &amp; is a mere stone’s throw from the beach.","image":"optimized-images/safaris/south-africa/cape-town/the-bay-hotel/1thebayhotel-small.webp","folderName":"safaris/south-africa/cape-town/the-bay-hotel"},{"title":"The Cape Milner","description":"Set at the foot of Cape Town’s iconic Table Mountain, The Cape Milner is a slick boutique hotel that offers guests an ideal base from which to explore South Africa’s most beautiful city. Attractions such as the V&amp;A Waterfront, Company’s Gardens &amp; Table Mountain Cableway are all mere minutes away.  With the mountain on your doorstep, guests can take an adventurous cable car ride up the mountain, hike to its peak or get a bird’s eye view from a helicopter.","image":"optimized-images/safaris/south-africa/cape-town/the-cape-milner/1thecapemilner-small.webp","folderName":"safaris/south-africa/cape-town/the-cape-milner"},{"title":"The Clarendon Bantry Bay","description":"At the foot of Lion’s Head in a secluded, ocean-facing enclave of Bantry Bay, lies an elegant boutique hotel that offers only the best in barefoot city luxury:  The Clarendon Bantry Bay. Ideal for discerning travellers, this quiet retreat is just minutes away from the popular V&amp;A Waterfront with its stylish cafes, restaurants &amp; shops while Cape Town’s most beautiful beaches – Clifton &amp; Camps Bay – are only a stone’s throw away.","image":"optimized-images/safaris/south-africa/cape-town/the-clarendon-bantry-bay/1theclarendonbantrybay-small.webp","folderName":"safaris/south-africa/cape-town/the-clarendon-bantry-bay"},{"title":"The Last Word Constantia","description":"Constantia is the Cape’s oldest wine-producing region &amp; one of Cape Town’s most beautiful suburbs.  It is here, amid elegant vineyards that you will find The Last Word Constantia – an intimate boutique hotel that offers only the best in city luxury. The Last Word Constantia not only offers an in-house chauffeur service &amp; elegant rooms, but its fantastic location near award-winning wine estates is a big drawcard for discerning travellers from around the globe.","image":"optimized-images/safaris/south-africa/cape-town/the-last-word-constantia/1thelastwordconstantia-small.webp","folderName":"safaris/south-africa/cape-town/the-last-word-constantia"},{"title":"The Last Word Long Beach","description":"With an unbeatable location on a long stretch of white, sandy beach in the picturesque seaside village of Kommetjie, The Last Word Long Beach will quite literally take your breath away. Not only will you see a spectacularly beautiful beach right on your doorstep, but guests can walk straight from their elegant suite onto the unspoilt dunes of Long Beach.","image":"optimized-images/safaris/south-africa/cape-town/the-last-word-long-beach/1thelastwordlongbeach-small.webp","folderName":"safaris/south-africa/cape-town/the-last-word-long-beach"},{"title":"The Marly Boutique Hotel","description":"Situated in the beautiful Camps Bay – Cape Town’s most sought-after &amp; neighbourhood – The Marly is a boutique hotel that provides only the best in barefoot beach luxury. The Marly offers some of the most jaw-dropping views in the area!  Not only will guests be able to enjoy uninterrupted ocean &amp; mountain views from the swimming pool, the 80-seater bar &amp; the sun terrace – but also every suite.","image":"optimized-images/safaris/south-africa/cape-town/the-marly-boutique-hotel/1themarlyboutiquehotel-small.webp","folderName":"safaris/south-africa/cape-town/the-marly-boutique-hotel"},{"title":"The One Above","description":"Welcome to Cape Town’s most sophisticated penthouse.  The One Above’s location cannot be closer to perfect – atop the One &amp; Only Cape Town, with unobstructed views of Table Mountain, Robben Island, Devil’s Peak, Lion’s Head, the Cape Town Harbor &amp; the V&amp;A Waterfront. The One Above offers everything you could wish for – from a private butler &amp; chef team, a wrap-around entertainment deck with 2 swimming pools to an exquisite wine loft with 280 vintages.  The penthouse also has a private gym &amp; sauna.","image":"optimized-images/safaris/south-africa/cape-town/the-one-above/1theoneabove-small.webp","folderName":"safaris/south-africa/cape-town/the-one-above"},{"title":"The Silo","description":"Architectural imagination turned what was once the elevator portion of a historic grain silo complex into one of Cape Town’s most magnificent luxury hotels.   The Silo sits above the Zeitz Museum of Contemporary Art Africa, which aims to have the largest collection of modern African art in the world &amp; hotel guests will have direct access to this artistic slice of paradise.  The V&amp;A Waterfront with its boutique shops, cafes &amp; restaurants is within walking distance.","image":"optimized-images/safaris/south-africa/cape-town/the-silo/1thesilo-small.webp","folderName":"safaris/south-africa/cape-town/the-silo"},{"title":"The Spa House","description":"The Spa House is an exclusive private villa set in leafy Hout Bay of the Cape Peninsula’s Atlantic seaboard. This award-winning villa with avant-garde eco-design offers the perfect blend between marble, glass &amp; timber to maximize its captivating mountain &amp; forest views.","image":"optimized-images/safaris/south-africa/cape-town/the-spa-house/1thespahouse-small.webp","folderName":"safaris/south-africa/cape-town/the-spa-house"},{"title":"Tintswalo Atlantic","description":"Perched above the Atlantic Ocean at the base of Chapman’s Peak, Tintswalo Atlantic offers a luxurious beachfront retreat with uninterrupted ocean views.   Set just outside Cape Town, the lodge is built in a secluded cranny, offering romantics &amp; honeymooners a true ocean paradise.","image":"optimized-images/safaris/south-africa/cape-town/tintswalo-atlantic/1tintswaloatlantic-small.webp","folderName":"safaris/south-africa/cape-town/tintswalo-atlantic"},{"title":"Twelve Apostles Hotel & Spa","description":"Perched high on the slopes of Table Mountain, you will find one of Cape Town’s most prestigious retreats, the Twelve Apostles Hotel &amp; Spa.  With uninterrupted views of the sparkling Atlantic Ocean, it is no wonder that guests travel from around the world to come &amp; unwind here. Surrounded by hectares of indigenous fynbos &amp; the Twelve Apostles mountain range, the hotel is ideal for honeymooners &amp; discerning couples who want to get away from the hustle &amp; bustle of the city, while still being close enough to explore the major sites.  ","image":"optimized-images/safaris/south-africa/cape-town/twelve-apostles-hotel--spa/1twelveapostleshotel&spa-small.webp","folderName":"safaris/south-africa/cape-town/twelve-apostles-hotel-spa"},{"title":"Victoria & Alfred Hotel","description":"A better location is hard to find.  The Victoria &amp; Alfred Hotel is set in Cape Town’s ever-popular V&amp;A Waterfront.  Named after this area, The Victoria &amp; Alfred Hotel enjoys beautiful views of Cape Town’s most iconic sight, Table Mountain &amp; the marina. Right on your doorstep, you will find a variety of Cape Town’s top restaurants, cafes &amp; boutiques – a true shopper’s delight.  The hotel boasts a safe &amp; central location, offering guests the opportunity to explore the area on foot as most of Cape Town’s popular sights are within walking distance.","image":"optimized-images/safaris/south-africa/cape-town/victoria--alfred-hotel/1victoria&alfredhotel-small.webp","folderName":"safaris/south-africa/cape-town/victoria-alfred-hotel"}],"parentCards":[{"title":"Cape Town","image":"optimized-images/safaris/south-africa/cape-town/1capetown-small.webp","folderName":"safaris/south-africa/cape-town","isCurrentFolder":true},{"title":"Durban","image":"optimized-images/safaris/south-africa/durban/1durban-small.webp","folderName":"safaris/south-africa/durban","isCurrentFolder":false},{"title":"Eastern Cape","image":"optimized-images/safaris/south-africa/eastern-cape/1easterncape-small.webp","folderName":"safaris/south-africa/eastern-cape","isCurrentFolder":false},{"title":"Garden Route","image":"optimized-images/safaris/south-africa/garden-route/1gardenroute-small.webp","folderName":"safaris/south-africa/garden-route","isCurrentFolder":false},{"title":"Johannesburg","image":"optimized-images/safaris/south-africa/johannesburg/1johannesburg-small.webp","folderName":"safaris/south-africa/johannesburg","isCurrentFolder":false},{"title":"Kruger National Park","image":"optimized-images/safaris/south-africa/kruger-national-park/1krugernationalpark-small.webp","folderName":"safaris/south-africa/kruger-national-park","isCurrentFolder":false}],"h1Title":"The Clarendon Bantry Bay","h2Title":"Cape Town","h3Title":"The Clarendon Bantry Bay","whatWeLoveItems":["Ideal location near Clifton & Camps Bay beaches","Beautiful views of the Atlantic Ocean","Sheltered from the summer winds","Swimming pool & manicured gardens","Complimentary afternoon High Tea","Great service & friendly staff"],"params":{"slug":["safaris","south-africa","cape-town","the-clarendon-bantry-bay"]},"level":4},"__N_SSG":true}