{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","canon":true,"lodges":"?\nMAURITIUS\nMADIKWE SAFARI LODGE\nLONDOLOZI VARTY CAMP\nKWANDWE ECCA LODGE\nKWANDWE MELTON MANOR\nTUNINGI SAFARI LODGE\nMORUKURU FARM HOUSE\nSOMALISA ACACIA\nBumi Hills Safari Lodge\nLITTLE GOVERNORS’ CAMP\nSingita Ebony Lodge\nSINGITA SERENGETI HOUSE\nSOSSUSVLEI DESERT LODGE\n"},"content":"<p>Holidays are supposed to be fun!  But often ‘fun for Mum &amp; Dad’, doesn’t necessarily mean ‘fun for the kids!’ (&amp; vice versa) But when your family travels to Africa, we’ll make sure that ‘fun’ is indeed for the whole family.</p>\n<p>One of the best ways to ensure that everyone is happy is to pick family-friendly lodges with Kids Clubs. That way, the little ones can play at their heart’s content, learn about Africa &amp; enjoy a variety of fun activities while Mum &amp; Dad enjoy an afternoon siesta.   </p>\n<p>There are wonderful Kids Clubs throughout Africa, but we’ll share some of our favourites with you – so start packing &amp; get ready for oodles of family fun!</p>\n<h4>1. Mauritius</h4>\n<p>Yes, Mauritius is Number 1 on our list, because most resorts on this beautiful island boast fantastic Kids (&amp; Teens) Clubs that will keep your kids busy for days!  Mauritius resorts offer an impressive amount of age-appropriate land &amp; water activities – with dedicated adult supervision, of course.  So, Mum &amp; Dad can relax by the pool, enjoy water sports or take a siesta as kids craft &amp; play to their hearts’ content.</p>\n<h4>2. Madikwe Safari Lodge, Madikwe Game Reserve – South Africa</h4>\n<p>At Madikwe Safari Lodge, kids will learn how to survive in the bush with lessons on which trees’ branches make the best toothbrushes, how to find your way in the bush, make fire &amp; source water.  ‘Bug CSI’ will take the little ones on guided walks around camp to find different plants &amp; insects while spoor &amp; dung tracking are both great hits among young explorers.</p>\n<h4>3. Londolozi Varty Camp, Sabi Sand Reserve – South Africa</h4>\n<p>Londolozi stands out above the rest when it comes to a child’s tailored safari experience.  Recognising that each child is unique, an assessment is done upon arrival by a ranger &amp; qualified facilitator who then custom design a fun-filled safari itinerary for each child.  Private game drives mean that your family can come &amp; go, stop, touch, feel &amp; smell at your own pace.  Back at camp, kids will also enjoy archery, tree climbing, fishing, movie nights, pizza making, sling-shot competitions, water-based games, Masterchef cook-offs, arts &amp; crafts, &amp; photography lessons.</p>\n<h4>4. Kwandwe Ecca Lodge, Kwandwe Private Game Reserve – South Africa</h4>\n<p>Kwandwe Ecca Lodge offers children an opportunity to become honorary members of the Blue Crane Conservation Club, named after South Africa’s endangered national bird.  As ‘Blue Craners,’ they’ll receive an animal checklist, take a pledge to live green &amp; learn about conservation on exciting, guided walking safaris around camp, identifying animal droppings, tracks &amp; insects.  Water babies can also go on supervised fishing trips &amp; game drives looking for non-predatory wildlife like zebras, monkeys &amp; giraffes.</p>\n<h4>5. Kwandwe Melton Manor, Kwandwe Private Game Reserve – South Africa</h4>\n<p>This exclusive-use safari villa not only comes with a dedicated team of staff but comes with a long list of family-friendly activities.  Receiving a welcome pack of animal checklists, themed games &amp; activities, gifts &amp; a pledge to live green, your kids will have a blast.  At the Kids Club, children can enjoy cooking lessons, scavenger hunts, arts &amp; crafts &amp; much more.  A bonus at Melton Manor is that kids of all ages are allowed on game drives.</p>\n<h4>6. Tuningi Safari Lodge, Madikwe Game Reserve – South Africa</h4>\n<p>Tuningi Safari Lodge is one of the few 5-star safari lodges in the Madikwe Game Reserve that welcomes children &amp; in doing so, allows them to be exposed to wildlife &amp; nature.  Kids at Tuningi will have a blast!  The little ones will be kept busy with treasure hunts, arts &amp; crafts &amp; scavenger hunts.  They also have a dedicated kids playroom where children can roam around freely &amp; play to their hearts’ content.</p>\n<h4>7. Morukuru Farm House, Madikwe Game Reserve – South Africa</h4>\n<p>At Morukuru Farm House, all children are welcome on game drives &amp; will receive a backpack of goodies that will teach them to become ‘junior rangers.’  The little ones will head off on guided spoor-tracking lessons, mini bush walks &amp; enjoy scrapbooking of their favourite safari finds.  Kids at Morukuru Farm House can also bake biscuits, play board games &amp; enjoy video games.</p>\n<h4>8. Somalisa Acacia, Linyanti Reserve – Botswana</h4>\n<p>Somalisa Acacia was built with families in mind.  Their Ngwana Club specialises in providing the little ones with educational fun from beginning to end.  Here, kids will learn about local wildlife through nature walks, arts &amp; crafts &amp; cooking lessons.  The cherry on top at Somalisa Acacia is the Elephant Pool – a waterhole right next to camp – where herds of elephants are frequently spotted.</p>\n<h4>9. Bumi Hills Safari Lodge, Matusadona National Park – Zimbabwe</h4>\n<p>Bumi Hills’ Ngwana Club is famous for keeping the little ones so busy, they won’t even notice you’re gone.  Here, kids will be educated about life in the bush through fun activities – from nature walks around camp &amp; storytelling to cultural arts, crafts &amp; cooking classes.</p>\n<h4>10.Governors’ Camp, Masai Mara – Kenya</h4>\n<p>The Great Wildebeest Migration is a wildlife show your kids will never forget!  Not only can they enjoy a phenomenal wildlife experience, but at the Mongoose Club, they will be entertained, educated &amp; inspired through a bunch of fun-filled safari activities.  Leading the team, is a local Masai guide who will teach kids all about his culture, how to identify animal tracks &amp; using the camp’s telescope - how to dabble in astronomy.  Kids will also enjoy fun ‘make your own pizza’ evenings, make their own jewellery &amp; build handmade wooden bows &amp; arrows – which will be much needed during target practice.</p>\n<h4>11. Singita Ebony, Sabi Sand Reserve – South Africa</h4>\n<p>Kids of all ages are welcome at Singita Ebony &amp; their Mini Rangers Course is filled with fun activities ranging from tracking &amp; birding to bush survival skills.  Babysitting is also offered here, so parents can enjoy some downtime for massages or afternoon siestas.</p>\n<h4>12. Singita Serengeti House, Serengeti National Park – Tanzania</h4>\n<p>Singita Serengeti House offers front row seats to nature’s greatest spectacle:  the Great Wildebeest Migration.  Your family can enjoy sole use of this private villa as well as a variety of exciting activities, like tennis, watching a movie in the media room or swimming in the infinity pool.  Kids can join the Mini Rangers Course where they’ll learn how to track animals &amp; survive in the bush while enjoying fun nature quizzes &amp; various competitions.</p>\n<h4>13. Sossusvlei Desert Lodge, Sossusvlei – Namibia</h4>\n<p>Stargazing in Sossusvlei is spectacular, so at Sossusvlei Desert Lodge the little ones will receive a WILDchild backpack filled with bush-orientated goodies &amp; receive stargazing lessons from an expert.  Daily activities usually revolve around getting creative with ostrich shell art to make jewellery – just like the San Bushmen, learn about dune history while playing in the sand &amp; enjoy some monkey ball art, using local fruits as a canvas.</p>\n","images":["optimized-images/family-travel/3have-fun-at-the-kids-club/1havefunatthekidsclub-large.webp","optimized-images/family-travel/3have-fun-at-the-kids-club/2havefunatthekidsclub-large.webp","optimized-images/family-travel/3have-fun-at-the-kids-club/3havefunatthekidsclub-large.webp","optimized-images/family-travel/3have-fun-at-the-kids-club/4havefunatthekidsclub-large.webp","optimized-images/family-travel/3have-fun-at-the-kids-club/5havefunatthekidsclub-large.webp","optimized-images/family-travel/3have-fun-at-the-kids-club/6havefunatthekidsclub-large.webp","optimized-images/family-travel/3have-fun-at-the-kids-club/7havefunatthekidsclub-large.webp","optimized-images/family-travel/3have-fun-at-the-kids-club/8havefunatthekidsclub-large.webp"],"subfolders":[{"title":"MAURITIUS","description":"Ask anyone who has been to Mauritius &amp; soon you will discover why this Indian Ocean island remains a worldwide favourite.\nNot only are the beaches magnificently beautiful, but Mauritius offers an amazing year-round climate, world-class diving &amp; a long list of activities that can keep you busy for days.\nWhat makes Mauritius so special, is that it appeals to absolutely everyone. Families, couples, honeymooners &amp; friends are all catered for. Some resorts even have family-friendly pools &amp; ‘adult-only’ wings. Kids Clubs will keep the little ones entertained from morning to evening, so parents can put up their feet &amp; relax!\nTop-rated attractions in Maurit\tius include exciting land &amp; water-based activities which are ample. Visitors can enjoy diving, snorkelling, kayaking, sailing, waterskiing, jet skiing, stand-up paddleboarding, kitesurfing &amp; paddle boating, among many others. Land sports include tennis, golf, bicycle tours, shopping, spa treatments &amp; hiking, to name a few.\nDelicious cuisine can be enjoyed on the island. Most resorts offer a variety of restaurants, so guests can enjoy a different dining experience each night. Excellent service is of utmost importance to the Mauritian people, so rest assured - you will be treated like royalty.\n\nAccommodation on the island is geared toward all types of travellers. Honeymooners &amp; couples will enjoy smaller, more intimate boutique resorts where the emphasis is on luxurious suites, fine dining &amp; relaxation. Families will be happy in one of the larger, activity-based resorts where Kids Clubs &amp; child-friendly pools keep the little ones entertained.\nSome of the resorts are located closer to Grande Baie, Mauritius’ main shopping district, while others are further south. Regardless of where you stay, your holiday will be filled with the pristine beaches of Mauritius, exciting water sports &amp; plenty of relaxation.\n\nThe island has a classic tropical climate with warm weather year-round, so the best time to visit Mauritius is any time! Comfortable weather can be expected during winter, from May to October when it is cool, dry &amp; sunny. The wettest period is during summer, from November to April when temperatures are at their hottest &amp; humidity sets in.","image":"optimized-images/default.webp","folderName":"islands/mauritius","created":null},{"title":"MADIKWE SAFARI LODGE","description":"Deep in the heart of Madikwe Private Game Reserve lies the famous Madikwe Safari Lodge, a luxurious family-friendly bushveld retreat.\nOffering sweeping views over the game-filled plains &amp; Waterberg mountains, Madikwe Safari Lodge consists of 3 separate safari camps: Lelapo (12 suites) - geared towards families, Kopano (4 suites) – ideal for couples &amp; Dhitaba (4 suites) – for guests in need of absolute privacy.\n\nThese 3 separate camps at Madikwe Safari Lodge offer a total of 20 suites, each featuring a bedroom, sitting area, fireplace, en-suite bathroom, private deck &amp; plunge pool.  Here guests can relax on comfortable sun chairs, take a dip in the pool or enjoy a book with a cocktail in hand.\nIntimate sitting areas in all 3 camps feature cosy sofas, shaded outdoor seating &amp; bean bags for casual relaxation.  Spectacular views can be enjoyed from the dining room &amp; lounge areas.\nChildren of all ages are allowed at Lelapo - Madikwe Safari Lodge’s family camp.  Specialized activities will keep them active &amp; teach them about the wild.  Kopano is an adult-only camp &amp; Dhitaba only allows children if booked exclusively.\n\nTwice daily game drives in open 4x4 safari vehicles will ensure close encounters with Africa’s Big 5.  Should guests feel adventurous, they can also enjoy guided bush walks &amp; track down some of the smaller animals &amp; birds.\nAfter a sundowner stop in the bush, the nocturnal search begins.  Guests will have the opportunity to look for some of these rarer species with a spotlight.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/madikwe-game-reserve/madikwe-safari-lodge","created":null},{"title":"LONDOLOZI VARTY CAMP","description":"Londolozi Varty Camp, the first of Londolozi’s 5 luxury safari camps was built in 1926 &amp; celebrates its history &amp; authenticity with its own bush museum.\nSituated in the famous Sabi Sand Game Reserve adjacent to the Kruger National Park, Londolozi Varty Camp ensures excellent Big 5 game viewing year-round.\n\nThe lodge has 8 chalets &amp; 2 superior chalets, each with an en-suite bathroom &amp; river views.\nEach chalet has been stylishly decorated in keeping with Africa’s laid-back atmosphere &amp; features a private swimming pool &amp; deck that overlooks the riverine bush.  \nVarty Camp also includes a cardiovascular room, massage treatment room, wine cellar &amp; open-air dining area.  Many dinners are spent under the stars around the campfire - the perfect place to unwind after a day out in the bush.\nThe living spaces are positioned under a shade of trees &amp; raised on wooden platforms, allowing for an elevated &amp; unobstructed bird’s eye view.\n\nActivities at Londolozi is action-packed!  Qualified rangers &amp; trackers will accompany guests on open 4x4 game drives through the Sabi Sand Game Reserve, in search of some of Africa’s wildest animals. \nExcellent predator &amp; leopard sightings can be expected.  Daily bush walks can be enjoyed after breakfast for those interested in learning about tracking animals on foot.\nGuests can also use the fitness room or do a photographic safari course &amp; there is also a children’s programme at the Cub’s Den that is uniquely tailored to each child.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/kruger-national-park/sabi-sand-private-game-reserve/londolozi-varty-camp","created":null},{"title":"KWANDWE ECCA LODGE","description":"The world-class Kwandwe Private Game Reserve is nestled in the heart of South Africa’s unspoilt Eastern Cape Province in a malaria-free private wilderness &amp; is home to Kwandwe Ecca Lodge.\nThe 22,000-hectare reserve flanks both the north &amp; south banks of the Great Fish River, attracting a variety of game, including the Big 5.\nKwandwe is the closest game reserve to the vibrant &amp; cultural Grahamstown &amp; forms part of the Garden Route, making this an ideal stopover for travellers looking for a bush &amp; beach holiday.\n\nKwandwe Ecca Lodge offers breathtaking views onto an escarpment of steep shale cliffs &amp; features 6 stylish suites, of which 3 are dedicated to families.  \nThe double suites can accommodate 2 adults each &amp; the family suites accommodate 2 adults &amp; 2 children. (under 16 years, on day beds in the lounge)  The family suites also include a private safari vehicle with a dedicated ranger.\nEach suite has a wraparound deck, complete with a private plunge pool &amp; outdoor shower.\nThe main area at Kwandwe Ecca Lodge includes a restaurant, bar, dining room, pool &amp; Kids Club.\n\nOpen 4x4 game drives at Kwandwe never disappoint.  Apart from the Big 5, the reserve is also home to a wealth of other unique &amp; interesting animals.  \nGuests can also enjoy walking safaris, fishing, rhino conservation activities, spa treatments, private campfire cooking experiences &amp; a variety of Kids Club activities for the young ones. \nBecause Kwandwe is a private reserve, night drives are permitted &amp; guests will have the opportunity to search for animals with a spotlight.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/eastern-cape/kwandwe-private-game-reserve/kwandwe-ecca-lodge","created":null},{"title":"KWANDWE MELTON MANOR","description":"The world-class Kwandwe Private Game Reserve is nestled in the heart of South Africa’s unspoilt Eastern Cape Province in a malaria-free private wilderness &amp; is home to Kwandwe Melton Manor.\nThe 22,000-hectare reserve flanks both the north &amp; south banks of the Great Fish River, attracting a variety of game, including the Big 5.\nKwandwe is the closest game reserve to the vibrant &amp; cultural Grahamstown &amp; forms part of the Garden Route, making this an ideal stopover for travellers looking for a bush &amp; beach holiday.\n\nKwandwe Melton Manor is a private space that inspires the sharing of meals, laughter &amp; experiences around the farmhouse table.\nThis exclusive-use villa features 4 double suites with en-suite bathrooms, generous bathtubs &amp; a large private terrace, opening onto the wilderness beyond.  \nThe interactive kitchen encourages guests to try their hand at combining flavours under the guidance of their in-house chef.  There is also a cosy living space, central courtyard &amp; swimming pool.\nKwandwe Melton Manor provides indoor-outdoor exclusive use living at its best!\n\nOpen 4x4 game drives at Kwandwe never disappoint.  Apart from the Big 5, the reserve is also home to a wealth of other unique &amp; interesting animals.  \nGuests can also enjoy walking safaris, fishing, rhino conservation activities, spa treatments, private campfire cooking experiences, scenic flights, bush dining &amp; picnics.\nBecause Kwandwe is a private reserve, night drives are permitted &amp; guests will have the opportunity to search for animals with a spotlight.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/eastern-cape/kwandwe-private-game-reserve/kwandwe-melton-manor","created":null},{"title":"TUNINGI SAFARI LODGE","description":"Tuningi Safari Lodge is one of only a few 5-star safari lodges in the Madikwe Game Reserve that welcomes children &amp; in doing so, allows them to be exposed to wildlife &amp; nature.\nSituated in Big 5 country, the Madikwe Reserve provides only the best in malaria-free game viewing.  Guests often see lion, leopard, elephant, buffalo, rhino, zebra, giraffe, hyena, impala &amp; a variety of birds.  Madikwe is also one of the best places in Africa to see the famous African Wild dog.\n\nTuningi Safari Lodge features 4 luxury suites &amp; 2 family suites, all of which boast en-suite bathrooms with outdoor showers as well as breathtaking views from the private wrap-around decks.  \nThe family suites are made up of 2 en-suite bedrooms &amp; are joined by a dining area, kitchenette &amp; a living room with an expansive timber deck from where the surrounding beauty can be appreciated.\nThe thatched main lodge offers a spacious lounge &amp; cosy dining room, a well-stocked bar &amp; an impressive rim-flow pool that overlooks an active waterhole.  There is also a magnificent boma where evenings are spent around a crackling fire.\nThe lodge has been designed in such a way that it can be divided between families, intimate groups or guests needing ultimate privacy.\n\nAt Tuningi Safari Lodge you can go on morning &amp; evening game drives in search of Africa’s Big 5 &amp; the endangered wild dog.  Optional bush walks can also be arranged after breakfast each day.\nKids at Tuningi will have a blast!  Tuning Safari Lodge is one of the few lodges in Madikwe specializing in families with kids of all ages.  The little ones will be kept busy with treasure hunts or arts &amp; crafts.\nGuests can also spend time in the photographic underground hide or book relaxing spa treatments at an additional cost.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/madikwe-game-reserve/tuningi-safari-lodge","created":null},{"title":"MORUKURU FARM HOUSE","description":"Morukuru Family consists of 3 exclusive bush villas located in the malaria-free Madikwe Private Game Reserve in South Africa.\nThese private villas include Morukuru Farm House, Morukuru Owner’s House &amp; Morukuru River House - each villa complete with a dedicated hosting couple, butler, cleaning staff, ranger &amp; tracker.   \nThe villas are truly unique.  Guests staying here will be guaranteed to have a bush experience like no other.  Private, intimate &amp; secluded – Morukuru Family offers an exclusive safari to the discerning traveller.\n\nMorukuru Farm House is located just on the other side of the hill, away from Morukuru Owner’s House &amp; Morukuru River House to ensure absolute privacy &amp; seclusion.  \nFarm House accommodates 10 guests in 5 presidential rooms.  The lounge &amp; bar area is inviting &amp; the private verandah looks out over the open bush &amp; heated swimming pool.\n\nDaily activities include safari drives in open 4x4 vehicles &amp; bush walks.  The Morukuru Hide is set next to the water’s edge &amp; invites guests for adventurous sleep-outs surrounded by the African wilderness.\nRelaxing massage treatments can also be booked at an additional cost.\nIn summer, guests staying at Morukuru can also enjoy fishing or waterskiing on the nearby dam as well as picnic barbeques.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/madikwe-game-reserve/morukuru-farm-house","created":null},{"title":"SOMALISA ACACIA","description":"Somalisa Acacia is a stylish, stilted tented safari camp that lies in Zimbabwe’s flagship Hwange National Park &amp; overlooks a busy waterhole.\nThe camp is built along the Kennedy vlei line, which means guests can expect plenty of wildlife action on game drives.\nHwange National Park offers superb year-round game viewing with frequent sightings of lion, elephant &amp; white rhino as well as a wide variety of antelope.  Excellent birding can also be expected as well as fantastic photographic opportunities.\nBecause the camp is so small &amp; intimate, it is the ideal safari choice for families or groups looking for an exclusive safari experience.\n\nThere are 6 spacious &amp; stylish tented suites at Somalisa Acacia.  Each tented suite is set on a raised deck around a central dining &amp; relaxation area that looks out over a busy waterhole.\nTwo of these tents are two-bedroom family units with inter-leading walkways between the parents &amp; children’s rooms which are both en-suite, as well as 2 additional stand-alone canvas tents.\nEach tent includes a glass wood-burner fireplace for chilly winter evenings, an en-suite bathroom with indoor &amp; outdoor shower as well as a copper bathtub.\nOne of the highlights of staying at Somalisa Acacia is watching the elephants come to drink from the comfort of the lodge’s swimming pool.\n\nGuests staying at Somalisa Acacia will be able to enjoy game drives, guided walking safaris, swimming or relaxing in a hammock on their private deck. \nThe Ngwana Club will keep the young ones entertained &amp; expose them to the exciting world of the African bush.","image":"optimized-images/default.webp","folderName":"safaris/zimbabwe/hwange-national-park/somalisa-acacia","created":null},{"title":"BUMI HILLS SAFARI LODGE","description":"Perched on a hill overlooking the largest man-made lake in the world, Bumi Hills Safari Lodge offers breathtaking views of the Zambezi River &amp; Lake Kariba’s azure waters.\nThe park is home to a wide range of wildlife, including rhino, elephant, buffalo &amp; lion.  Not only is Kariba’s shoreline rich with wildlife &amp; birds, but the lodge’s proximity to Matusadona National Park allows for even more action-packed wildlife adventures.\n\nBumi Hills boasts 10 lake view suites as well as a 2-bedroom exclusive-use villa with a private vehicle &amp; butler.\nEach suite offers an en-suite bathroom as well as a private deck with sublime views over the lake.  The villa can accommodate a maximum of 5 people.\nAt the central lodge area, you will find a lounge, wellness spa, gym, library &amp; swimming pool.\n\nWith Lake Kariba right on your doorstep, guests can spend their days exploring the lake on private boat cruises or try their hand at tiger fishing.  \nScenic walking safaris around the lake or surrounding forests are also a highlight.  Alternatively, guests can visit one of the nearby local villages &amp; learn more about the community, their history &amp; traditions.","image":"optimized-images/default.webp","folderName":"safaris/zimbabwe/matusadona-national-park-lake-kariba/bumi-hills-safari-lodge","created":null},{"title":"LITTLE GOVERNORS’ CAMP","description":"Utterly secluded &amp; reachable only by boat across the Mara River, Little Governors’ Camp boasts a spectacular location on the edge of the Masai Mara National Reserve in Kenya.\nAfter a boat ride &amp; a short, escorted walk through a riverine forest, this eco-friendly safari camp is utterly quiet &amp; undisturbed.  \nThe camp &amp; tents are tucked around a large waterhole that teems with wildlife &amp; birds, so Little Governors’ Camp provides action during &amp; after game drives.  \nBecause the camp is unfenced, resident elephants &amp; warthogs are often spotted from the deck.\n\nAccommodation at Little Governors’ comprises 17 luxury en-suite tents, all overlooking an active waterhole that teems with both wildlife &amp; birds.\nEach tent has a wooden deck with a large veranda to enjoy the constant game activity that takes place around the waterhole.  \nThe main lodge includes a lounge &amp; dining area as well as a bar, Kids Club &amp; spa.\n\nCamp activities at Little Governors’ includes open 4x4 game drives with professional rangers, walking safaris, hot air balloon rides over the game-packed plains, excursions to Maasai villages, photographic safaris &amp; visits to the Mara-Meru Cheetah Project.","image":"optimized-images/default.webp","folderName":"safaris/kenya/masai-mara/little-governors-camp","created":null},{"title":"SINGITA EBONY LODGE","description":"Singita Ebony Lodge is – without a doubt - one of the Greater Kruger’s best premier camps &amp; enjoys a spectacular location on the banks of the Sand River.  Located in the world-renowned Sabi Sand Reserve, adjacent to the Kruger National Park, Singita provides excellent game viewing year-round.\nThe lodge welcomes discerning travellers from across the globe to come &amp; experience a safari in the lap of luxury.\nThe focus at Singita is not only on luxurious accommodation, fine dining &amp; exceptional service, but their legendary rangers &amp; trackers will strive to deliver some of the best Big 5 wildlife viewing in the country.\n\nEbony has 8 one-bedroom suites, 2 one-bedroom Lewis Suites, 2 two-bedroom family suites &amp; 1 villa.\nEach one-bedroom suite features an outdoor patio with a private, heated plunge pool &amp; beautiful views over the bush.  \nThe one-bedroom Lewis Suites also have a private plunge pool &amp; game viewing deck but are located closer to the main lodge, which makes them a great option for families.\nThe 2 two-bedroom family suites include a dining &amp; lounge area with fireplace, deck &amp; heated plunge pool.  The family suites are ideal for families with small children.\nThe villa comprises 2 family suites with access to an additional private lounge, swimming pool &amp; deck area, which connects these 2 individual suites.  The Ebony Villa includes a private guide, vehicle, chef, host &amp; butler.\nThe main lodge area consists of a lounge &amp; timber deck area overlooking the Sand River, a bar area &amp; traditional open boma, gym, spa, library &amp; wine cellar.\n\nSingita Ebony Lodge includes a variety of activities, such as game drives, walks, biking, archery &amp; spa treatments.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/kruger-national-park/sabi-sand-private-game-reserve/singita-ebony-lodge","created":null},{"title":"SINGITA SERENGETI HOUSE","description":"Perched on the slopes of Sasakwa Hill in the private Grumeti Reserve in Tanzania’s Serengeti National Park, lies the exclusive &amp; elegant Singita Serengeti House.\nThe name Singita is synonymous with world-class safaris &amp; their Serengeti House is no different.  \nThis exclusive safari haven is set in 350,000 acres of unrivalled wilderness that forms part of the iconic Great Wildebeest Migration. \nIn season, guests can witness how millions of wildebeest, zebra &amp; gazelle move through the area in search of greener pastures.\nElegant &amp; refined, this private villa is an ideal choice for discerning travellers requiring the utmost privacy &amp; relaxation.\nSince the villa is booked on an exclusive-use basis, each group will have a dedicated guide, safari vehicle, chef &amp; staff who will take care of their every need.\n\nThe villa boasts 4 well-appointed en-suite bedrooms with private verandas.  \nThe spacious living spaces flow onto a wooden deck overlooking a secluded waterhole while a private pool &amp; tennis court offer opportunities to relax &amp; work out.  Relaxing spa treatments can be enjoyed in the comfort of your villa.  \nThe villa’s deck offers awe-inspiring views over the game-rich Serengeti plains.\n\nA range of exciting safari activities is available at Singita Serengeti House.  \nThese include open 4x4 game drives, hot air balloon safaris, wine tasting, village tours, swimming, spa treatments &amp; visits to the canine unit to learn more about how this special anti-poaching unit works.","image":"optimized-images/default.webp","folderName":"safaris/tanzania/serengeti-national-park/singita-serengeti-house","created":null},{"title":"SOSSUSVLEI DESERT LODGE","description":"Nestled deep in the heart of Namibia’s ancient Namib Desert in Southern Africa, Sossusvlei Desert Lodge is a secluded &amp; serene oasis that overlooks the awe-inspiring dunes of Sossusvlei.\nSet against a backdrop of ancient mountains, Sossusvlei Desert Lodge boasts a location that is at once dramatic &amp; serene.  \nStargazing at Sossusvlei Desert Lodge is, according to Conde Nast, one of the best recommendations in Africa.\n\nWith just 10 luxurious villas constructed of stone &amp; glass, guests can enjoy the solitary splendour of this remote landscape in privacy.  \nEach air-conditioned villa features an en-suite bathroom with a glass-encased rain shower &amp; outdoor shower, a living room with a cosy fireplace, a veranda with a private plunge pool &amp; a dramatic skylight over the bed for late-night stargazing. \nThe main lodge reflects earthy interiors &amp; comprises a lounge, dining area, bar, gym, Kids Club, library, swimming pool &amp; wellness spa.\n\nPlenty of activities are on offer at Sossusvlei Desert Lodge.  \nActive guests will enjoy quad biking, hiking &amp; walking to satisfy their sense of adventure.  For those wishing to spend more time around the red sand dunes of Sossusvlei - nature drives, dune walks &amp; hot-air balloon safaris are the way to go.\nOther options include stargazing, swimming, exercising at the gym or getting pampered at the spa.","image":"optimized-images/default.webp","folderName":"safaris/namibia/sossusvlei/sossusvlei-desert-lodge","created":null}],"parentCards":[{"title":"Witness Fascinating Animal Encounters","image":"optimized-images/family-travel/1witness-fascinating-animal-encounters/1witnessfascinatinganimalencounters-small.webp","folderName":"family-travel/1witness-fascinating-animal-encounters","isCurrentFolder":false},{"title":"Stay In Private Villas","image":"optimized-images/family-travel/2stay-in-private-villas/1stayinprivatevillas-small.webp","folderName":"family-travel/2stay-in-private-villas","isCurrentFolder":false},{"title":"Have Fun At The Kids Club","image":"optimized-images/family-travel/3have-fun-at-the-kids-club/1havefunatthekidsclub-small.webp","folderName":"family-travel/3have-fun-at-the-kids-club","isCurrentFolder":true},{"title":"Explore At Your Own Pace","image":"optimized-images/family-travel/4explore-at-your-own-pace/1exploreatyourownpace-small.webp","folderName":"family-travel/4explore-at-your-own-pace","isCurrentFolder":false},{"title":"Choose Malaria-free","image":"optimized-images/family-travel/5choose-malaria-free/1choosemalaria-free-small.webp","folderName":"family-travel/5choose-malaria-free","isCurrentFolder":false},{"title":"Enjoy Family-friendly Activities","image":"optimized-images/family-travel/6enjoy-family-friendly-activities/1enjoyfamily-friendlyactivities-small.webp","folderName":"family-travel/6enjoy-family-friendly-activities","isCurrentFolder":false}],"h1Title":"Have Fun At The Kids Club","h2Title":"Family Travel Experiences","h3Title":"Have Fun At The Kids Club","whatWeLoveItems":[],"params":{"slug":["family-travel","3have-fun-at-the-kids-club"]},"level":2},"__N_SSG":true}