{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","canon":true,"lodges":"?\nSAFARIS\nISLANDS\nCITIES\n"},"content":"<p>There are certain countries in the world that, as parents, we simply won’t dare to visit with our kids.  They are simply not child-friendly.</p>\n<p>Fortunately, Africa is the ‘Fun Aunt’ when it comes to family-friendly activities, so rest assured: Mum, Dad &amp; the little ones will have a blast!</p>\n<p>Africa offers you the chance to spot a lion in the wild, ride on the back of an elephant, zipline through a forest, quad bike in the desert &amp; go on treasure hunt adventures.  If you can think of it, you’ll probably be able to do it:  helicopter flights, hot air balloon safaris, sunset boat cruises, snorkelling, stand-up paddleboarding, scuba diving, canoe safaris, guided walks, stargazing….the list is endless.  There is also bungee jumping, animal encounters, treehouse sleep-outs &amp; Kids Clubs.</p>\n<p>Since each lodge, camp or resort offers its own list of exciting activities, why not browse through a few of them &amp; see for yourself?  Or – even better – ask one of our African Safari Experts to help you plan your dream holiday.  That’s why we are here!</p>\n<p>We are happy to custom design a holiday that will suit your family’s needs &amp; requirements, so send us an enquiry &amp; we’ll get back to you with some exciting suggestions.</p>\n<p>Whatever your family wants to do, we can probably make it happen! </p>\n<p>Because it is challenging to put together a list of all the activities Africa has to offer, we thought we’ll direct you to the very beginning.</p>\n<p>What kind of holiday will be ideal for your family?  A safari?  An island getaway?  Or a city break? (Or all of the above?)</p>\n<h4>1. Safaris</h4>\n<p>Perhaps everyone on Planet Earth has dreamed of going on safari to Africa!  The word safari means “journey” &amp; visiting the real Africa is a unique experience.  Getting up close &amp; personal with some of the world’s most impressive &amp; endangered animals, sleeping in luxury tents &amp; learning more about the fascinating African culture is what a safari holiday is all about!</p>\n<h4>2. Islands</h4>\n<p>Life is busy.  So, let’s be honest – all of us deserve some pampering every now &amp; again.  For some – pampering means strolling on white, sandy beaches with crystal clear water, while others enjoy eating fresh seafood or sipping on a cocktail while watching the sunset.  There are those who prefer lying in a hammock or getting a relaxing massage while others want to dive, snorkel &amp; explore the island through adventure activities.  Whichever way you choose to relax, an island will get you there!</p>\n<h4>3. Cities</h4>\n<p>While many people love to get away from the hustle &amp; bustle of city life while on holiday, they often realize that visiting a city in another part of the world can be just as relaxing as a safari or a beach holiday.  You don’t have to worry about meals, because everything is available around the clock – from high-end restaurants &amp; cafes to cocktail bars &amp; markets.  Besides, you get to explore, see new places, experience new cultures, indulge in adventure activities &amp; also tick off your bucket list.</p>\n","images":["optimized-images/family-travel/6enjoy-family-friendly-activities/1enjoyfamily-friendlyactivities-large.webp","optimized-images/family-travel/6enjoy-family-friendly-activities/2enjoyfamily-friendlyactivities-large.webp","optimized-images/family-travel/6enjoy-family-friendly-activities/3enjoyfamily-friendlyactivities-large.webp","optimized-images/family-travel/6enjoy-family-friendly-activities/4enjoyfamily-friendlyactivities-large.webp","optimized-images/family-travel/6enjoy-family-friendly-activities/5enjoyfamily-friendlyactivities-large.webp","optimized-images/family-travel/6enjoy-family-friendly-activities/6enjoyfamily-friendlyactivities-large.webp","optimized-images/family-travel/6enjoy-family-friendly-activities/7enjoyfamily-friendlyactivities-large.webp","optimized-images/family-travel/6enjoy-family-friendly-activities/8enjoyfamily-friendlyactivities-large.webp"],"subfolders":[{"title":"SAFARIS","description":"Perhaps everyone on Planet Earth has dreamed of going on safari to Africa! The word safari means “journey” & enjoying a luxury African safari is a unique journey to say the least.\nGetting up close & personal with some of the world’s most impressive & endangered animals, sleeping in luxury tents at the best safari lodges & learning more about the fascinating African culture is what luxury safari holidays are all about.\nNot that you need further convincing, here are our top 6 reasons why you should book a luxury safari adventure today.\nLuxury African safaris offer you a unique combination of opulence, wildlife & adventure in a single experience, unmatched anywhere else in the world.\nSeeing the real Africa from an open 4x4 vehicle, boat or canoe is simply magical. Encountering the Big 5 – lion, leopard, elephant, buffalo & rhino – & spotting extraordinary bird species in their natural habitat, is something you will never forget.\nMost of our lives today are filled with long hours at the office & too much screen time! Visiting Africa allows us to slow down, kick off our shoes & escape to a world where we can only hear birds chirping.\nKids & adults around the world have one thing in common – we love to have fun while on holiday! You can be sure of this...A safari adventure will keep everyone entertained. (But if you are hoping to do as little as possible – you are most welcome to do so.)\nWhat is more magical than rounding off your afternoon with a popular safari ritual: sundowner drinks in the bush? You’re invited to watch the sun set while sipping on your drink of choice, surrounded by nature at the best safari lodges in Africa.\nProfessional photographers, & the ‘Average Joe’ who loves taking pictures, will all fall in love with Africa. Capture impressive animals, golden sunsets or interesting people & make memories that will last forever.\n\nA bucket list experience\nSee wildlife up close in a natural setting\nEscape to nature\nEnjoy a wide range of safari activities\nDrink a G&T while watching the sunset\nCapture amazing moments","image":"optimized-images/default.webp","folderName":"safaris","created":null},{"title":"ISLANDS","description":"Life is busy. So let’s be honest – all of us deserve some pampering every now & again. For some – pampering means strolling on white, sandy beaches with crystal clear water, while others enjoy eating fresh seafood or sipping on a cocktail while watching the sunset on islands in Africa. There are those who prefer lying in a hammock or getting a relaxing massage while others want to dive, snorkel & explore the island through adventure activities.\nRelaxation is important - but in case you still need further convincing, here are our top 6 reasons why you should book a holiday on an island off the coast of Africa today.\nIslands in Africa truly offer a slice of paradise. Breathtaking scenery, azure waters & palm-fringed beaches invite you to come & experience only the best in barefoot luxury.\nThere is nothing quite like lying on your bed, sitting on your patio or relaxing in your hammock while looking out over the quiet waters of the Indian Ocean. Island resorts are known to offer beautiful sea-facing rooms, so guests can indulge in luxury while still feeling close to nature.\nAn island holiday is incomplete without a scuba diving or snorkelling experience. Get up close & personal with the rich marine life or enjoy other thrilling water-based activities such as kayaking, paddle-boarding, jet-skiing or sailing.\nGET UNPLUGGED…&amp; RECHARGE\nFor many of us, being on an island is living the dream. It gives us the chance to get away from the hustle & bustle of everyday life. Switch off your phone, take off your shoes & get refreshed.\nWhen we are at our best, we want to eat the best. Island-life in Africa is all about being outdoors & tasting fresh seafood from the ocean.\nIsland holidays are for everyone - from adventurers, honeymooners & families, to couples & groups of friends. In addition to a variety of water sports, island resorts offer a wide selection of activities, including spa treatments, hiking, biking, cooking courses & Kids Clubs.\n\nThe ultimate beach experience\nWitness spectacular ocean views from your room\nEnjoy a wide range of water sports\nRelax &amp; recharge\nSavour fresh seafood on the beach\nA holiday for every kind of traveller","image":"optimized-images/default.webp","folderName":"islands","created":null},{"title":"CITIES","description":"While many people love to get away from the hustle & bustle of city life while on holiday, they often realize that visiting a city in another part of the world can be just as relaxing as a safari or a beach holiday.\nWe believe that the best African cities promise excitement & relaxation in equal measure.\nYou don’t have to worry about meals, because everything is available around the clock – from high end restaurants & cafes to cocktail bars & markets.\nBesides, you get to explore, see new places, experience new cultures, indulge in adventure activities & also tick off your bucket list.\nHere are our top 6 reasons why you should book an African city holiday today.\nLet’s be honest – everyone loves ticking off top landmarks from their bucket list – be that museums & iconic buildings or galleries & world heritage sites. Some of the world’s best landmarks are found in beautiful African cities.\nNot only will you be able to taste local cuisine when visiting a city, but also have an opportunity to sample some of the country’s best dishes. African cities are filled with world-class establishments & award-winning restaurants, so you can have your pick.\nThe best African cities offer guided tours which are a great option if you would like to have a stress-free holiday. Expert local guides know the area & provide deeper insights, comfortable transportation & impeccable service.\nBoredom will not find you on a city holiday. Go sightseeing, visit museums, explore local markets, taste some wine & go shopping – limitless activities will keep you busy for days.\nWith a wide selection of hotels, private villas, apartments & boutique hotels, you can decide what your ideal African city escape should look like.\nSince city holidays are often jam-packed with exciting day tours, thrilling activities & shopping expeditions, it is a good idea to also set aside some time to explore at your own pace. This means more flexibility, more spontaneity & more adventure.\n\nVisit top landmarks & attractions\nSavour world-class cuisine\nGo on guided tours with experts \nEnjoy a wide selection of activities\nChoose from a variety of accommodations\nHave more flexibility","image":"optimized-images/default.webp","folderName":"cities","created":null}],"parentCards":[{"title":"Witness Fascinating Animal Encounters","image":"optimized-images/family-travel/1witness-fascinating-animal-encounters/1witnessfascinatinganimalencounters-small.webp","folderName":"family-travel/1witness-fascinating-animal-encounters","isCurrentFolder":false},{"title":"Stay In Private Villas","image":"optimized-images/family-travel/2stay-in-private-villas/1stayinprivatevillas-small.webp","folderName":"family-travel/2stay-in-private-villas","isCurrentFolder":false},{"title":"Have Fun At The Kids Club","image":"optimized-images/family-travel/3have-fun-at-the-kids-club/1havefunatthekidsclub-small.webp","folderName":"family-travel/3have-fun-at-the-kids-club","isCurrentFolder":false},{"title":"Explore At Your Own Pace","image":"optimized-images/family-travel/4explore-at-your-own-pace/1exploreatyourownpace-small.webp","folderName":"family-travel/4explore-at-your-own-pace","isCurrentFolder":false},{"title":"Choose Malaria-free","image":"optimized-images/family-travel/5choose-malaria-free/1choosemalaria-free-small.webp","folderName":"family-travel/5choose-malaria-free","isCurrentFolder":false},{"title":"Enjoy Family-friendly Activities","image":"optimized-images/family-travel/6enjoy-family-friendly-activities/1enjoyfamily-friendlyactivities-small.webp","folderName":"family-travel/6enjoy-family-friendly-activities","isCurrentFolder":true}],"h1Title":"Enjoy Family-friendly Activities","h2Title":"Family Travel Experiences","h3Title":"Enjoy Family-friendly Activities","whatWeLoveItems":[],"params":{"slug":["family-travel","6enjoy-family-friendly-activities"]},"level":2},"__N_SSG":true}