{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","canon":true,"lodges":"?\nSINGITA SWENI\nLONDOLOZI PRIVATE GRANITE SUITES\nVUMBURA PLAINS\nLION SANDS IVORY LODGE\nSANCTUARY BAINES’ CAMP\nBISATE LODGE\nBUMI HILLS SAFARI LODGE\nTHORNTREE RIVER LODGE\nSOSSUSVLEI DESERT LODGE\nNAMIRI PLAINS\nONE NATURE NYARUSWIGA\nSANCTUARY OLONANA\nTIME + TIDE CHINZOMBO\n"},"content":"<p>EXPERIENCE AFRICA IN LUXURY</p>\n<p>Luxury is the key ingredient when planning a honeymoon.  Getting married is a big deal &amp; celebrating such a special occasion should be done in style.<br>Beautiful views, exclusivity, private plunge pools &amp; outdoor showers are perhaps some of the things that made their way onto your Honeymoon List – &amp; rightly so – but there are also other things to consider when choosing the ultimate honeymoon destination.<br>See, luxury is not just about ‘things,’ it is also about experiences.  Sometimes luxury can be seen in exclusive private villas &amp; other times it is found in beautiful, tented camps.  But more importantly – luxury can also be enjoyed on a scenic hot air balloon flight, during a relaxing couples’ massage or by spending the night in a remote treehouse under a canopy of stars!<br>Luxury comes in different shapes &amp; sizes, but one thing is certain – on honeymoon, you should have plenty of it!<br>There are so many romantic lodges &amp; resorts to choose from, so our list will barely scratch the surface, but at least it’s a start.  So join us as we celebrate our Safari Favourites in Luxury.</p>\n<ol>\n<li>Singita Sweni, Kruger Private Concession – South Africa<br>The ultra-modern &amp; beautifully decorated Singita Sweni is located within a private concession in the Kruger National Park &amp; boasts some of the best wildlife viewing in the country.  Each romantic suite boasts a private terrace with a romantic day bed looking out over the Sweni River.</li>\n<li>Londolozi Private Granite Suites, Sabi Sand Reserve – South Africa<br>Londolozi’s most luxurious safari camp, Private Granite Suites is the cherry on the cake when it comes to privacy &amp; exclusivity.  Situated in the wildlife-rich Sabi Sand Game Reserve in the Greater Kruger, Londolozi Private Granite Suites only accommodates 6 guests, ensuring personal attention &amp; dedicated service.  Each suite boasts a romantic outdoor bath with river views.</li>\n<li>Vumbura Plains, Okavango Delta – Botswana<br>Vumbura Plains is a premier camp set within a private concession in the extreme northern section of the Okavango Delta.  Each spacious suite is raised off the ground on wooden decks &amp; has a private plunge pool &amp; sala – the ideal romantic setting.  The lodge also offers thrilling helicopter flights over the Delta.</li>\n<li>Lion Sands Ivory Lodge, Sabi Sand Reserve – South Africa<br>Lion Sands Ivory Lodge is built on the banks of the Sabie River in the world-renowned Sabi Sand Reserve, with views extending onto the open sandbanks of the Kruger National Park.  The lodge is ideal for honeymooners as it is known for its exclusivity &amp; tailored, discreet service.  Each contemporary villa comes with a private, rim-flow pool &amp; butler &amp; honeymooners can even spend a night sleeping in a remote treehouse under a canopy of stars.</li>\n<li>Sanctuary Baines’ Camp, Okavango Delta – Botswana<br>Sanctuary Baines’ Camp is located within a private concession, bordering the Moremi Game Reserve &amp; is home to some of the most spectacular wildlife viewing on earth.  The camp overlooks a lagoon, so the views are spectacular &amp; each suite boasts a deck with a romantic outdoor candle-lit bath &amp; a mobile bed for sleep-outs under the stars.</li>\n<li>Bisate Lodge, Volcanoes National Park – Rwanda<br>Located in the world-renowned Volcanoes National Park, Bisate Lodge boasts dramatic forest views over the Bisoke &amp; Karisimbi volcano peaks.  Bisate Lodge is small &amp; intimate, featuring only 6 opulent en-suite forest villas, each equipped with an en-suite bathroom, central fireplace &amp; private deck with breathtaking views over Mount Bisoke.    </li>\n<li>Bumi Hills Safari Lodge, Matusadona National Park – Zimbabwe<br>Perched on a hill overlooking the largest man-made lake in the world, Bumi Hills Safari Lodge offers breathtaking views of the Zambezi River &amp; Lake Kariba’s azure waters.  Each luxurious suite boasts private decks while the 2-bedroom villa comes with a dedicated butler &amp; private vehicle – ideal for honeymooners.  The infinity pool &amp; spa with views are both the ideal setting for a romantic getaway.</li>\n<li>Thorntree River Lodge, Livingstone – Zambia<br>Thorntree River Lodge, one of Zambia’s most contemporary lodges boasts a spectacular setting on the legendary Zambezi River, just upstream from Zambia’s biggest drawcard:  the mighty Victoria Falls.  The lodge boasts private pools, outdoor showers, an infinity pool, spa &amp; gym while their exclusive boat is especially geared for romantic sunset river cruises.</li>\n<li>Sossusvlei Desert Lodge, Sossusvlei – Namibia<br>Nestled deep in the heart of Namibia’s ancient Namib Desert in Southern Africa, Sossusvlei Desert Lodge is a secluded &amp; serene oasis that overlooks the awe-inspiring dunes of Sossusvlei.  This secluded &amp; intimate lodge boasts luxury villas with romantic outdoor showers &amp; offers special activities like hot air balloon safaris &amp; quad biking.  Stargazing at Sossusvlei Desert Lodge is, according to Conde Nast, one of the best recommendations in Africa.</li>\n<li>Namiri Plains, Serengeti National Park – Tanzania<br>The ultra-luxurious Namiri Plains is set within a remote corner in the eastern Serengeti – an area famous for its excellent cheetah sightings.  Substantial in size, each tented suite offers sliding doors which run the full length of the room &amp; open out on a full-length viewing deck complete with a romantic outdoor bath, offering exceptional views from the tub as you relax.  From the shower, guests can enjoy full views of the seasonal riverbed.</li>\n<li>One Nature Nyaruswiga, Serengeti National Park – Tanzania<br>The ultra-luxurious, yet understated One Nature Nyaruswiga, is a stylish tented camp overlooking rolling grasslands in the game-rich central Serengeti.  The tents feature en-suite bathrooms complete with romantic free-standing copper bathtubs, as well as indoor &amp; outdoor showers.  Relaxing in-room massages can be arranged &amp; the stargazing deck with a telescope is the perfect place to connect with your loved one.</li>\n<li>Sanctuary Olonana, Masai Mara – Kenya<br>Sanctuary Olonana boasts an idyllic forest setting along a private stretch of the Mara River, adjacent to the Masai Mara National Reserve in Kenya. (&amp; front-row seats to the Wildebeest Migration!)  Each suite features a lavish en-suite bathroom with bathtub, double vanity &amp; rain shower as well as an inviting deck with a daybed offering panoramic vistas of the Mara – an ideal spot to relax post-safari.</li>\n<li>Time + Tide Chinzombo, South Luangwa – Zambia<br>Set in a private concession on the banks of a river, Time + Tide Chinzombo – Zambia’s most luxurious safari camp - offers direct access to the world-renowned South Luangwa National Park.  Each ‘floating’ villa boasts an outdoor shower, stand-alone bathtub &amp; double basins as well as a private deck with a plunge pool.</li>\n</ol>\n","images":["optimized-images/honeymoons/1experience-africa-in-luxury/1ExperienceAfricaInLuxury-large.webp","optimized-images/honeymoons/1experience-africa-in-luxury/2ExperienceAfricaInLuxury-large.webp","optimized-images/honeymoons/1experience-africa-in-luxury/3ExperienceAfricaInLuxury-large.webp","optimized-images/honeymoons/1experience-africa-in-luxury/4ExperienceAfricaInLuxury-large.webp","optimized-images/honeymoons/1experience-africa-in-luxury/5ExperienceAfricaInLuxury-large.webp","optimized-images/honeymoons/1experience-africa-in-luxury/6ExperienceAfricaInLuxury-large.webp","optimized-images/honeymoons/1experience-africa-in-luxury/7ExperienceAfricaInLuxury-large.webp","optimized-images/honeymoons/1experience-africa-in-luxury/8ExperienceAfricaInLuxury-large.webp"],"subfolders":[{"title":"1Experience Africa In Luxury","description":"EXPERIENCE AFRICA IN LUXURY Luxury is the key ingredient when planning a honeymoon.  Getting married is a big deal &amp; celebrating such a special occasion should be done in style.","image":"optimized-images/honeymoons/1experience-africa-in-luxury/1ExperienceAfricaInLuxury-small.webp","folderName":"honeymoons/1experience-africa-in-luxury"},{"title":"2Take a Dip In a Private Plunge Pool","description":"TAKE A DIP IN A PRIVATE PLUNGE POOL Honeymoons are all about connecting with your loved one &amp; making lasting (romantic) memories.  ","image":"optimized-images/honeymoons/2take-a-dip-in-a-private-plunge-pool/1TakeADipInAPrivatePlungePool-small.webp","folderName":"honeymoons/2take-a-dip-in-a-private-plunge-pool"},{"title":"3Indulge In Romance","description":"INDULGE IN ROMANCE A honeymoon is the cherry on top when it comes to romantic travel - &amp; in Africa, you will find romance around every corner.","image":"optimized-images/honeymoons/3indulge-in-romance/1IndulgeInRomance-small.webp","folderName":"honeymoons/3indulge-in-romance"},{"title":"4Sleep Under a Canopy of Stars","description":"SLEEP UNDER A CANOPY OF STARS An African honeymoon is a once-in-a-lifetime dream vacation.  And since most of us have dreamt about spending a night under a canopy of stars, there is no better time or place to make this happen.","image":"optimized-images/honeymoons/4sleep-under-a-canopy-of-stars/1SleepInATreehouse-small.webp","folderName":"honeymoons/4sleep-under-a-canopy-of-stars"},{"title":"5Enjoy Bespoke Safari Activities","description":"ENJOY BESPOKE SAFARI ACTIVITIES The word bespoke also means ‘custom-designed’ or ‘tailored’ &amp; here at Africa Unwind, we do exactly that.  The holidays we design are made especially for you because we are passionate about taking all your holiday needs &amp; requirements into consideration.","image":"optimized-images/honeymoons/5enjoy-bespoke-safari-activities/1EnjoyBespokeSafariActivities-small.webp","folderName":"honeymoons/5enjoy-bespoke-safari-activities"},{"title":"6Soak Up The Scenery","description":"SOAK UP THE SCENERY When it comes to spectacular scenery, Africa has it all.  Vast plains, majestic mountains, sandy deserts &amp; turquoise oceans…And it goes without saying that a honeymoon is not complete without the opportunity to soak up the scenery.","image":"optimized-images/honeymoons/6soak-up-the-scenery/1SoakUpTheScenery-small.webp","folderName":"honeymoons/6soak-up-the-scenery"}],"parentCards":[{"title":"Another Travel Blog","image":"optimized-images/blog/anothertravelblog-small.webp","folderName":"blog","isCurrentFolder":false},{"title":"Bucket List","image":"optimized-images/bucket-list/1thebucketlist-small.webp","folderName":"bucket-list","isCurrentFolder":false},{"title":"CITIES","image":"optimized-images/cities/1cities-small.webp","folderName":"cities","isCurrentFolder":false},{"title":"All Destinations","image":"optimized-images/destinations/11-small.webp","folderName":"destinations","isCurrentFolder":false},{"title":"Family Travel","image":"optimized-images/family-travel/1familytravel-small.webp","folderName":"family-travel","isCurrentFolder":false},{"title":"Favourite","image":"","folderName":"favourite","isCurrentFolder":false},{"title":"Honeymoons","image":"optimized-images/honeymoons/1honeymoons-small.webp","folderName":"honeymoons","isCurrentFolder":true},{"title":"Africa Unwind","image":"","folderName":"index","isCurrentFolder":false},{"title":"ISLANDS","image":"optimized-images/islands/1islands-small.webp","folderName":"islands","isCurrentFolder":false},{"title":"Our Story","image":"optimized-images/our-story/1ourstory-small.webp","folderName":"our-story","isCurrentFolder":false},{"title":"SAFARIS","image":"optimized-images/safaris/1safaris-small.webp","folderName":"safaris","isCurrentFolder":false},{"title":"Top Destinations","image":"optimized-images/top-destinations/11-small.webp","folderName":"top-destinations","isCurrentFolder":false},{"title":"Trips","image":"optimized-images/trips/1moretrips-small.webp","folderName":"trips","isCurrentFolder":false},{"title":"What To Expect","image":"optimized-images/what-to-expect/1whattoexpect-small.webp","folderName":"what-to-expect","isCurrentFolder":false}],"h1Title":"1Experience Africa In Luxury","h2Title":"Honeymoons","h3Title":"1Experience Africa In Luxury","whatWeLoveItems":[],"params":{"slug":["honeymoons","1experience-africa-in-luxury"]},"level":2},"__N_SSG":true}