{"pageProps":{"frontmatter":{"title":"VICTORIA FALLS","subtitle":"","article_title":"","keyword":"All You Need to Know before going to Victoria Falls","related":"Victoria Falls travel guide | Explore Victoria Falls, Zimbabwe |  Victoria Falls attractions and activities | Victoria Falls travel tips and advice | Planning a trip to Victoria Falls","canon":true,"meta":"Find out all you need to know before going to Victoria Falls in Zimbabwe! Visit “The Smoke that Thunders” with Africa Unwind.","pageTitle":"All You Need to Know before going to Victoria Falls | Africa Unwind"},"content":"<h4>Experience</h4>\n<p>No one has ever wondered why the Victoria Falls is listed as one of the only Seven Natural Wonders of the World.<br>The local people call it Mosi-oa-Tunya, “The smoke that thunders,” because something magnificent happens when the river is high  &amp; the spray towers in the air while water gushes down like falling thunder.<br>The Victoria Falls is 1,708 meters wide  &amp; with an average of 550,000 cubic meters of water plummeting over the edge every minute, it is by far the largest curtain of water in the world. Visitors travel from all around the globe to catch a glimpse of this spectacular sighting.<br>The Victoria Falls is set between Zimbabwe &amp; Zambia, making it accessible to view from both sides (visa obtained upon arrival). Guests can also easily combine a Victoria Falls adventure with a safari to Hwange, Mana Pools or Botswana for a well-rounded African holiday. Inquire with us to find out all you need to know before going to Victoria Falls and the surrounding attractions, we can plan out the perfect itinerary for adventure and relaxation!</p>\n<h4>Activities</h4>\n<p>Victoria Falls in Zimbabwe is also known as Africa’s adventure capital  &amp; offers something for every type of traveler. Highlights include scenic helicopter flights, sunset boat cruises on the Zambezi River  &amp; guided tours to the majestic Victoria Falls.<br>Adrenaline junkies tend to fill up their days with action-packed activities such as river rafting, bungee jumping, micro-lighting  &amp; canoeing. There is also fun for the whole family. Elephant-back safaris are usually an all-time favorite amongst little adventurers.<br>If you are feeling adventurous, why not go for a swim at the edge of The Falls? (season dependent) Devil’s Pool at Livingstone Island has a good reputation &amp; never fails to impress thrill-seekers or Insta-lovers.</p>\n<h4>When to travel</h4>\n<p>If you’re planning a trip to Victoria Falls, the best time to visit is during ‘High Water’ season - from February to July, directly after the region&#39;s summer rains, when you&#39;ll see the world&#39;s largest sheet of falling water flowing at its greatest volume.<br>‘Low Water’ runs between August &amp; January &amp;is at its lowest between November &amp; early December. This is the time when there is very little spray, but river rafting &amp;swimming at Devil’s Pool are both wonderful activities to experience during low season. Whenever you visit, the Victoria Falls attractions and activities will keep you mesmerised!</p>\n","images":["/AUB/optimized-images/cities/victoria-falls/1victoriafalls-large.webp","/AUB/optimized-images/cities/victoria-falls/2victoriafalls-large.webp","/AUB/optimized-images/cities/victoria-falls/3victoriafalls-large.webp","/AUB/optimized-images/cities/victoria-falls/4victoriafalls-large.webp","/AUB/optimized-images/cities/victoria-falls/5victoriafalls-large.webp","/AUB/optimized-images/cities/victoria-falls/6victoriafalls-large.webp","/AUB/optimized-images/cities/victoria-falls/7victoriafalls-large.webp","/AUB/optimized-images/cities/victoria-falls/8victoriafalls-large.webp"],"subfolders":[{"title":"Batonka Lodge","description":"The owner-run Batonka Lodge is set within easily walking distance to the majestic Victoria Falls in Zimbabwe. This small &amp; elegant retreat offers good value &amp; comfortable inter-leading rooms, which makes this a first choice for families traveling with children.  ","image":"/AUB/optimized-images/cities/victoria-falls/batonka-lodge/1batonkalodge-small.webp","folderName":"cities/victoria-falls/batonka-lodge"},{"title":"Ilala Lodge","description":"Ilala Lodge is ideally situated on the Zimbabwean side of the mighty Zambezi River, only a short walk from the magnificent Victoria Falls. The perfect base from which to explore one of the World’s Seven Natural Wonders, Ilala Lodge is the closest resort to the majestic Vic Falls.  ","image":"/AUB/optimized-images/cities/victoria-falls/ilala-lodge/1ilalalodge-small.webp","folderName":"cities/victoria-falls/ilala-lodge"},{"title":"Matetsi Victoria Falls","description":"Matetsi Victoria Falls is set on the banks of the mighty Zambezi River within a private game reserve on the Zimbabwean side of the Falls. Matetsi allows guests to combine an action-packed visit to Victoria Falls with a luxurious safari.  ","image":"/AUB/optimized-images/cities/victoria-falls/matetsi-victoria-falls/1matetsivictoriafalls-small.webp","folderName":"cities/victoria-falls/matetsi-victoria-falls"},{"title":"Rovos Rail","description":"Rovos Rail offers a luxury train holiday like no other.   Apart from owning &amp; operating the most luxurious trains in the world, Rovos Rail offers guests a variety of train journeys - each ranging from 2 nights to 2 weeks.","image":"/AUB/optimized-images/cities/victoria-falls/rovos-rail/1rovosrail-small.webp","folderName":"cities/victoria-falls/rovos-rail"},{"title":"Stanley & Livingstone Boutique Hotel","description":"The Stanley &amp; Livingstone is a small boutique hotel with only 16 suites set in a 6 000-acre private game reserve about 10km from Victoria Falls on the Zimbabwean side. A safari hotel in Victorian style reflects the old-world charm of that bygone era.  ","image":"/AUB/optimized-images/cities/victoria-falls/stanley--livingstone-boutique-hotel/1stanley&livingstoneboutiquehotgel-small.webp","folderName":"cities/victoria-falls/stanley-livingstone-boutique-hotel"},{"title":"The Elephant Camp","description":"The Elephant Camp is located within in a private concession, a short drive from the magnificent Victoria Falls on the Zimbabwean side of the Zambezi River. The camp overlooks a waterhole that is fed by natural streams in the rainy season that rush down to meet the Masuwe River &amp; the Zambezi gorges below the Falls. ","image":"/AUB/optimized-images/cities/victoria-falls/the-elephant-camp/1theelephantcamp-small.webp","folderName":"cities/victoria-falls/the-elephant-camp"},{"title":"The Victoria Falls Hotel","description":"The Victoria Falls Hotel, also known as “the grand old lady of the Falls,” is situated in the Victoria Falls National Park, a World Heritage Site on the Zimbabwean side of the Zambezi River. The Edwardian-style 5-star hotel was built in 1904 &amp; is a proud member of the exclusive Leading Hotels of the World group.  For more than 110 years The Victoria Falls Hotel has been a luxury icon in Africa.","image":"/AUB/optimized-images/cities/victoria-falls/the-victoria-falls-hotel/1thevictoriafallshotel-small.webp","folderName":"cities/victoria-falls/the-victoria-falls-hotel"},{"title":"Victoria Falls River Lodge","description":"Overlooking the mighty Zambezi River, Victoria Falls River Lodge was Zambezi National Park’s very first private game lodge.   Its amazing location – so close to the majestic Victoria Falls – offers guests the unique opportunity to see the spray of the Falls in the distance!","image":"/AUB/optimized-images/cities/victoria-falls/victoria-falls-river-lodge/1victoriafallsriverlodge-small.webp","folderName":"cities/victoria-falls/victoria-falls-river-lodge"}],"parentCards":[{"title":"SAFARIS","image":"/AUB/optimized-images/safaris/1safaris-small.webp","folderName":"safaris","isCurrentFolder":false},{"title":"CITIES","image":"/AUB/optimized-images/cities/1cities-small.webp","folderName":"cities","isCurrentFolder":true},{"title":"ISLANDS","image":"/AUB/optimized-images/islands/1islands-small.webp","folderName":"islands","isCurrentFolder":false}],"h1Title":"Victoria Falls","h2Title":"CITIES","h3Title":"Victoria Falls","whatWeLoveItems":["Home to one of the 7 Natural Wonders of the World – the majestic Victoria Falls","Africa’s adventure capital – plenty of action-packed activities","Swim at Devil’s Pool: the edge of Vic Falls","Helicopter flights, sunset boat cruises, river rafting  & elephant interactions","Walk to Zambia  & see the Falls from both countries","A variety of luxurious lodges  & boutique hotels"],"params":{"slug":["cities","victoria-falls"]},"level":2},"__N_SSG":true}