{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","canon":true,"lodges":"?\nVOLCANOES NATIONAL PARK\nBWINDI IMPENETRABLE NATIONAL PARK\n"},"content":"<p>Talking about Bucket List adventures?  Look no further, because trekking through the jungles of Africa &amp; coming face to face with endangered mountain gorillas is as good as it gets!</p>\n<p>The fact that gorillas as a species are on the verge of extinction &amp; treks are a highly restricted activity, puts gorilla-trekking on top of the list when it comes to once-in-a-lifetime travel experiences.</p>\n<p>The rainforest is a challenging environment, so if you want to trek, you need to be fairly fit, in good health &amp; equipped for humid, muddy conditions.  Even in the dry season, the steep slopes &amp; thick vegetation can be challenging for some, but if you’re up for the hike, it is worth every moment.</p>\n<p>Gorillas are susceptible to human illnesses, but don’t have our immunities – so a common cold can be fatal to a gorilla family, which means that you won’t be able to trek if you are unwell.</p>\n<p>You are not allowed to use a flash when taking a picture &amp; have to wear a protective face mask when approaching the gorillas to prevent spreading viral &amp; bacterial diseases from humans to primates.</p>\n<p>Each group (a maximum of 6 guests) is led by a professional guide &amp; tracker that will take you into the thick of the forest, in search of a habituation gorilla family.  Once found, you’ll be able to spend an hour with the gorillas, watching the adults groom each other &amp; the babies tumble &amp; play.</p>\n<p>Those wishing to spend more time with the gorillas can purchase a Gorilla Habituation permit, which will allow them – along with researchers &amp; park rangers – to help train gorillas to get used to people.  Gorilla Habituation may take between 2 to 3 years to be completed, so being able to actively engage in conservation is an experience of a lifetime.</p>\n<p>Chimp-trekking is quite different to gorilla-trekking.  Although the trekking conditions are much easier, they are wary of humans &amp; a little harder to find.  Chimps &amp; other primate species can also be seen on a gorilla-trek – but there are several other superb chimpanzee trekking destinations like Uganda’s Kibale Forest, Queen Elizabeth National Park &amp; Murchison Falls National Park or Rwanda’s Nyungwe Forest National Park.  You can also spot them in Tanzania’s Mahale Mountains National Park &amp; Gombe Stream National Park.</p>\n<p>If you are coming all the way to Africa, you may as well add a gorilla safari to your itinerary.  After all, it is a once-in-a-lifetime experience that will leave you with lasting memories.</p>\n<p>For the best gorilla-trekking adventure, visit one of the following African destinations.</p>\n<h4>1. Volcanoes National Park – Rwanda</h4>\n<p>The beautiful Volcanoes National Park in north-western Rwanda is Rwanda’s prime rainforest &amp; home to 5 of 8 volcanoes in the Virunga Mountains range.  The park was also the base for the revolutionary primatologist, Dian Fossey, &amp; is home to a staggering amount of mountain gorillas, rare golden monkeys &amp; a variety of forest birds.</p>\n<h4>2. Bwindi Impenetrable National Park – Uganda</h4>\n<p>The mountain gorillas of Uganda can be found in Bwindi Impenetrable Forest National Park – a World Heritage Site of both montane &amp; lowland forest that is home to 120 species of mammals, 350 bird species &amp; 220 butterfly species.  Hosting half of the world’s population of mountain gorillas, Bwindi also offers thrilling encounters with colobus monkeys &amp; chimpanzees.</p>\n","images":["optimized-images/bucket-list/5go-gorilla-trekking/1gogorilla-trekking-large.webp","optimized-images/bucket-list/5go-gorilla-trekking/2gogorilla-trekking-large.webp","optimized-images/bucket-list/5go-gorilla-trekking/3gogorilla-trekking-large.webp","optimized-images/bucket-list/5go-gorilla-trekking/4gogorilla-trekking-large.webp","optimized-images/bucket-list/5go-gorilla-trekking/5gogorilla-trekking-large.webp","optimized-images/bucket-list/5go-gorilla-trekking/6gogorilla-trekking-large.webp","optimized-images/bucket-list/5go-gorilla-trekking/7gogorilla-trekking-large.webp","optimized-images/bucket-list/5go-gorilla-trekking/8gogorilla-trekking-large.webp"],"subfolders":[{"title":"VOLCANOES NATIONAL PARK","description":"The dramatic, thickly forested Virunga Volcanoes Mountain range is spread out between Uganda, the DRC & Rwanda & comprises 6 extinct & 3 active volcanoes.\nThe Volcanoes National Park is the Rwandan portion of the Virungas Volcanoes range & protects 300 mountain gorillas – around half the world’s existing population.\nOver a period of 20 years, the conservationist Dianne Fossey spent her time studying the gorillas of Volcanoes National Park after which the international blockbuster ‘Gorillas in the Mist’ was filmed here.\nThe park is often described as Africa’s easiest gorilla trekking & can be reached from Kigali, the country’s capital that is located only 80kms away.\nIn addition to spending time with the iconic mountain gorillas, guests can also see a range of monkeys & over 180 different species of bird.\nVolcanoes National Park Gorilla Trek: Your visit to Volcanoes National Park is incomplete without embarking on a thrilling gorilla trek. It's the ultimate luxury gorilla safari experience in Rwanda, getting up close with these majestic creatures.\n\nNot only will guests be able to set off on an unforgettable gorilla-trekking expedition during their stay at Volcanoes National Park, but they can also go on forest hikes to find the rare golden monkey or visit the beautiful lakes of Kivo, Burera, Ruhondo & Karago.\nPrimate Encounters in Volcanoes: Beyond gorillas, Volcanoes National Park offers incredible primate encounters. Seek out the enchanting golden monkeys, adding a unique dimension to your safari.\nVolcanoes National Park Birdwatching: Bird enthusiasts will be delighted by the park's diverse avian population. Explore the lush landscapes while spotting over 180 bird species.\nGuided Forest Hikes Rwanda: Guided forest hikes allow you to immerse yourself in the pristine wilderness of Volcanoes National Park, unveiling its hidden treasures.\nScenic Flights Over Virunga Volcanoes: Opt for a scenic helicopter flight to witness the breathtaking forested terrain from a bird’s eye view. It's an extraordinary perspective of this remarkable landscape.\nDian Fossey Memorial Visit: Pay homage to Dian Fossey by embarking on a nature walk to her grave, a touching experience that adds depth to your journey.\n\nNot only will guests be able to set off on an unforgettable gorilla-trekking expedition during their stay at Volcanoes National Park, but they can also go on forest hikes to find the rare golden monkey or visit the beautiful lakes of Kivo, Burera, Ruhondo & Karago.\nPrimate Encounters in Volcanoes: Beyond gorillas, Volcanoes National Park offers incredible primate encounters. Seek out the enchanting golden monkeys, adding a unique dimension to your safari.\nVolcanoes National Park Birdwatching: Bird enthusiasts will be delighted by the park's diverse avian population. Explore the lush landscapes while spotting over 180 bird species.\nGuided Forest Hikes Rwanda: Guided forest hikes allow you to immerse yourself in the pristine wilderness of Volcanoes National Park, unveiling its hidden treasures.\nScenic Flights Over Virunga Volcanoes: Opt for a scenic helicopter flight to witness the breathtaking forested terrain from a bird’s eye view. It's an extraordinary perspective of this remarkable landscape.\nDian Fossey Memorial Visit: Pay homage to Dian Fossey by embarking on a nature walk to her grave, a touching experience that adds depth to your journey.","image":"optimized-images/default.webp","folderName":"safaris/rwanda/volcanoes-national-park","created":null},{"title":"BWINDI IMPENETRABLE NATIONAL PARK","description":"Gorilla Trekking Safaris Uganda: Encounter mountain gorillas in their natural habitat in Bwindi Impenetrable Forest.\nBwindi Impenetrable Park is an ancient, deep forest situated along the southwestern border of Uganda.\nBreathtakingly beautiful, the forest is not only a UNESCO World Heritage Site but is home to half the world’s remaining population of endangered mountain gorillas. Out of these, several families have become habituated to humans, allowing intimate groups of trekkers to spend an hour in their company under the supervision of expert guides.\nSet against the slopes of a mountain range, the forest offers a wealth of biodiversity, including forest elephants, giant forest hogs &amp hundreds of butterflies. Several types of primates also roam beneath the thick canopy of trees.\nOver &amp above gorilla trekking safaris, Bwindi also offers guests the rare opportunity to be part of the Gorilla Habituation Experience – the slow &amp gentle introduction of a family of wild gorillas to the presence of humans. This means that trekkers can have more time with the gorillas while contributing to conservation.\n\nApart from trekking endangered mountain gorillas in Bwindi Impenetrable Forest, other exciting activities are also offered, including hiking, bird watching &amp meeting the local Batwa people – an interesting cultural experience.\n\nBwindi is open for gorilla trekking all year long, but the best times to go are from June to September &amp December to February. At these times, the forest trails are drier &amp therefore less slippery. Also, your chance of a dry gorilla viewing experience is higher during these months.\nGorilla treks can be physically challenging, especially during Uganda’s rainy seasons, which are from March to May &amp then again in October &amp November.\nDepending on the gorilla’s last location, the trek can take anywhere between 40 minutes to 6 hours, after which guests will be able to spend time with the gorillas for 1 hour.","image":"optimized-images/default.webp","folderName":"safaris/uganda/bwindi-impenetrable-national-park","created":null}],"parentCards":[{"title":"Tick Off The Big 5","image":"optimized-images/bucket-list/1tick-off-the-big-5/1tickoffthebig5-small.webp","folderName":"bucket-list/1tick-off-the-big-5","isCurrentFolder":false},{"title":"Sleep In a Treehouse","image":"optimized-images/bucket-list/2sleep-in-a-treehouse/1sleepinatreehouse-small.webp","folderName":"bucket-list/2sleep-in-a-treehouse","isCurrentFolder":false},{"title":"Enjoy a Water-based Safari","image":"optimized-images/bucket-list/3enjoy-a-water-based-safari/1enjoyawater-basedsafari-small.webp","folderName":"bucket-list/3enjoy-a-water-based-safari","isCurrentFolder":false},{"title":"Float In a Hot Air Balloon","image":"optimized-images/bucket-list/4float-in-a-hot-air-balloon/1floatinahotairballoon-small.webp","folderName":"bucket-list/4float-in-a-hot-air-balloon","isCurrentFolder":false},{"title":"Go Gorilla-Trekking","image":"optimized-images/bucket-list/5go-gorilla-trekking/1gogorilla-trekking-small.webp","folderName":"bucket-list/5go-gorilla-trekking","isCurrentFolder":true},{"title":"Stay On a Private Island","image":"optimized-images/bucket-list/6stay-on-a-private-island/1stayonaprivateisland-small.webp","folderName":"bucket-list/6stay-on-a-private-island","isCurrentFolder":false}],"h1Title":"Go Gorilla-Trekking","h2Title":"Bucket List Experiences","h3Title":"Go Gorilla-Trekking","whatWeLoveItems":[],"params":{"slug":["bucket-list","5go-gorilla-trekking"]},"level":2},"__N_SSG":true}