{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","canon":true,"lodges":"?\nNORTH ISLAND\nMALDIVES\nAZURA QUILALEA PRIVATE ISLAND\nANANTARA MEDJUMBE ISLAND RESORT\nMNEMBA ISLAND LODGE\nFOUR SEASONS DESROCHES ISLAND\nHILTON SEYCHELLES LABRIZ RESORT &amp;amp; SPA\nSIX SENSES ZIL PASYON\nCONSTANCE TSARABANJINA\nTIME + TIDE MIAVANA\nDenis Private Island\nCOUSINE ISLAND\nENCHANTED ISLAND RESORT\nMagical Maldives\n"},"content":"<p>Nothing screams luxury quite like private island living.  And Africa’s Indian Ocean offers you a selection of private islands, each boasting pristine beaches, crystal-clear water &amp; total exclusivity. </p>\n<p>A magnet for discerning travellers – romantics, honeymooners &amp; even families – a private island holiday is the perfect way to relax.  Snorkel, dive, swim, eat fresh seafood, get relaxing massages &amp; enjoy a wide selection of water sports.  </p>\n<p>Apart from the fact that private islands allow for total exclusivity, (no other resorts are found on the island) you can enjoy unspoilt beaches, untouched coral reefs &amp; even private butler services.</p>\n<p>This is luxury at its best.</p>\n<p>Want to experience the best of both worlds?  Why not combine an African safari with an Indian Ocean holiday – &amp; experience your own slice of paradise?</p>\n<p>Start dreaming as we share our list of Africa’s most amazing private islands.</p>\n<h4>1. North Island - Seychelles</h4>\n<p>Located on one of the world’s most astonishing private islands, North Island is a rare sanctuary for those seeking a luxurious, unspoiled &amp; completely exclusive tropical haven.  Fit for royalty, it was chosen as the 2011 honeymoon escape for Prince William &amp; Kate.</p>\n<h4>2. Maldives Islands (most are private islands)</h4>\n<p>The Maldives is comprised of 1,190 coral islands, of which 200 are inhabited &amp; only 98 are tourist resorts.  This string of idyllic islands is encircled by translucent, ever-changing waters of the Indian Ocean, offering beach-lovers the chance to discover a luxurious island retreat like no other.</p>\n<h4>3. Azura Quilalea Private Island, Quirimbas Archipelago – Mozambique</h4>\n<p>Azura Quilalea Private Island is an exclusive beach resort set in the gorgeous &amp; remote Quirimbas Archipelago in northern Mozambique.  It is a classic ‘desert island’ destination, offering the best in service, accommodation &amp; dining.</p>\n<h4>4. Anantara Medjumbe Island Resort, Quirimbas Archipelago – Mozambique</h4>\n<p>Medjumbe is the ultimate private island retreat, offering romantic beachfront accommodation, private plunge pools, fresh seafood directly from the ocean, exciting water sports &amp; excellent service.  So secluded, Medjumbe can only be reached by small aircraft &amp; therefore ensures an unspoilt, pristine beach experience.</p>\n<h4>5. Mnemba Island Lodge – Zanzibar</h4>\n<p>Mnemba Island is a tropical paradise of coral reefs, powdery beaches &amp; turquoise water found just off the coast of Zanzibar - &amp; just 1,5km in circumference.  Lying on this dreamy isle is Mnemba Island Lodge – a small &amp; intimate boutique-style beach resort with a dedication to providing only the best in barefoot luxury.</p>\n<h4>6. Four Seasons Desroches Island – Seychelles</h4>\n<p>Four Seasons Desroches Island is set on a private island in the Seychelles.  It is not surprising that this slice of paradise is considered one of the most pristine &amp; untouched islands in the world.</p>\n<h4>7. Hilton Seychelles Labriz Resort &amp; Spa – Seychelles</h4>\n<p>Hilton Seychelles Labriz Resort &amp; Spa is a 5* luxury resort set on the east coast of one of the most beautiful private islands in the Seychelles:  Silhouette Island.  The island is covered with jungles, mountains, rainforests &amp; pristine beaches – offering all who visit an authentic island experience.</p>\n<h4>8. Six Senses Zil Pasyon – Seychelles</h4>\n<p>The Six Senses Zil Pasyon is set on the private Felicite Island off the coast of La Digue &amp; is a short helicopter or boat ride from Praslin Island, making it a well-placed destination for island-hopping excursions.</p>\n<h4>9. Constance Tsarabanjina – Madagascar</h4>\n<p>Set on Tsarabanjina, a small private island in the northwestern Mitsio Archipelago in Madagascar, lies Constance Tsarabanjina – a luxury island retreat surrounded by powder-soft beaches, lush tropical vegetation &amp; rich coral reefs.</p>\n<h4>10. Time + Tide Miavana – Madagascar</h4>\n<p>Off the northeast coast of Madagascar, on Nosy Ankao – the largest of 5 pristine islands that form a protected archipelago – you will find Time + Tide Miavana.  Forming part of a 37,000-hectare protected marine area that is only accessible by helicopter, Miavana offers jaw-dropping views over the endless Indian Ocean &amp; direct access to the beach from each villa.</p>\n<h4>11. Denis Private Island Lodge – Seychelles</h4>\n<p>Denis Private Island, a 375-acre private coral island is located amid the warm waters of the Indian Ocean in beautiful Seychelles.  The island is home to lush palm trees &amp; white powdery beaches, ensuring an authentic island experience.</p>\n<h4>12. Cousine Island – Seychelles</h4>\n<p>The lavish Cousine Island is not only an idyllic &amp; private tropical destination but also one that is dedicated to nature conservation.  Yes, the island might be small – around 30 hectares big – yet it is packed with wildlife.</p>\n<h4>13. Enchanted Island Resort – Seychelles</h4>\n<p>As the name suggests, Enchanted Island Resort is located on a captivating 5-acre private island, just a short boat ride from Mahe Island in the Seychelles.  Here, guests can escape the hustle &amp; bustle of everyday life &amp; embrace a luxurious island experience where private plunge pools &amp; outdoor showers are just as important as beautiful, white sandy beaches &amp; crystal-clear waters.</p>\n","images":["optimized-images/bucket-list/6stay-on-a-private-island/1stayonaprivateisland-large.webp","optimized-images/bucket-list/6stay-on-a-private-island/2stayonaprivateisland-large.webp","optimized-images/bucket-list/6stay-on-a-private-island/3stayonaprivateisland-large.webp","optimized-images/bucket-list/6stay-on-a-private-island/4stayonaprivateisland-large.webp","optimized-images/bucket-list/6stay-on-a-private-island/5stayonaprivateisland-large.webp","optimized-images/bucket-list/6stay-on-a-private-island/6stayonaprivateisland-large.webp","optimized-images/bucket-list/6stay-on-a-private-island/7stayonaprivateisland-large.webp","optimized-images/bucket-list/6stay-on-a-private-island/8stayonaprivateisland-large.webp"],"subfolders":[{"title":"NORTH ISLAND","description":"Located on one of the world’s most astonishing private islands, North Island is a rare sanctuary for those seeking a luxurious, unspoiled &amp; completely exclusive tropical haven.  \nFit for royalty, it is not surprising that North Island was recently voted Nr 1 in the World’s ‘Best of the Best’ category by Conde Nast Traveller &amp; was chosen as the 2011 honeymoon escape for Prince William &amp; Kate.\nNot only does the resort offer the best in barefoot luxury &amp; exceptional service, but also offers a range of exciting land &amp; water-based activities for the discerning traveller.  Scenic helicopter trips, romantic sunset cruises &amp; world-class diving or snorkelling will be enough to win over any guest.\n\nThe island has only 11 guest villas, each exquisitely designed in its own private space, just a few steps from the white, sandy beach.\nEach villa is 5,000 square feet in size, featuring large baths, double vanities, indoor &amp; outdoor showers, large sundecks, private pools &amp; salas.  \nThe Island Piazza is built into granite boulders &amp; set directly on the beach.  This creatively designed seating area, bar &amp; dining deck flows onto the sparkling white sands of a breathtaking bay.  The island also features a sunset bar, swimming pool, dive centre &amp; library made from blocks of coral.\n\nFor those who enjoy an active holiday, North Island promises to exceed your expectations.  \nA range of activities is on offer, such as scuba diving, snorkelling, deep-sea fishing, mountain biking, guided hikes, swimming, sunbathing, reading or spa treatments.\nScenic helicopter trips can also be arranged for those who would love to explore the Seychelles’ 115 islands from a bird’s eye view.","image":"optimized-images/default.webp","folderName":"islands/seychelles/north-island","created":null},{"title":"MALDIVES","description":"Sunny skies, white sandy beaches &amp; crystal clear water…It is not hard to enjoy a holiday in the Maldives. Relax, sip on a cocktail or snorkel next to your palm-fringed water villa. \nThe Maldives is comprised of 1,190 coral islands, of which 200 are inhabited &amp; only 98 are tourist resorts. This string of idyllic islands is encircled by translucent, ever-changing waters of the Indian Ocean, offering beach-lovers the chance to discover a luxurious island retreat like no other.\nAs far as the eye can see, you will find a skyline of coconut palm trees, snow-white sand beaches &amp; vibrant coral reefs. This tropical oasis also offers world-class diving &amp; snorkelling as well as a range of other water-based activities that can keep you busy for days.\nWater-lovers can spot turtles, whale sharks, reef manta rays & colossal whales while others can enjoy unforgettable luxury spa treatments in the comfort of their suite.\nThe Maldives is also well-known for its gourmet dining. Resorts offer a wide range of international dishes, including Italian, Japanese, Thai, Indian &amp; French cuisine. The country has become a hot spot for Michelin-starred chefs who are happy to show off their skills.\n\nThe must-visit islands in the Maldives are geared towards the discerning traveller who is looking for a luxurious island holiday.\nSurrounded by turquoise blue waters, most resorts offer guests 3 types of accommodation: luxury water villas, elegant beach villas or private villas. Visitors can even split their stay between a beach stay &amp; a water villa experience. \nSome villas have private plunge pools, others have outdoor showers – but all of them offer the highest standard of luxury.\n\nThe island is warm &amp; sunny year-round, but consists of a dry season and a wet, rainy season.\nThe best time to visit the Maldives is from November to April during the dry season when there is little rain &amp; humidity is low. The wet season is characterized by stronger winds &amp; rain; it lasts from May to October.","image":"optimized-images/default.webp","folderName":"islands/maldives","created":null},{"title":"AZURA QUILALEA PRIVATE ISLAND","description":"Azura Quilalea Private Island is an exclusive beach resort set in the gorgeous &amp; remote Quirimbas Archipelago in northern Mozambique.\nIt is a classic ‘desert island’ destination, offering the best in service, accommodation &amp; dining.  \nGuests staying at this luxury Indian Ocean retreat can enjoy the best of both worlds – romantic ocean views &amp; exciting island activities.\n\nAzura Quilalea features a total of 8 luxury villas.  Four of these are kaskazi villas, located only a few steps from the beach &amp; 4 are kusi villas with premium locations, featuring an outdoor shower &amp; beach sala.  There is also Villa Quilalea that is located on a private part of the island, offering the ultimate in island luxury.\nThe cliff-top Villa Quilalea offers the most romantic accommodation on the island – with a private plunge pool, outdoor shower &amp; own separate dining area – a honeymooner’s paradise. Guests can access the ocean from their own cliff-top step ladder, which leads into a private alcove with a small beach at low tide &amp; immediate swimming &amp; snorkelling at high tide.\nAzura Quilalea’s stylish front-of-house consists of a relaxation area, a bar with pristine beach views, a sparkling swimming pool &amp; a wellness spa.\n\nA wide range of land &amp; land &amp; water-based activities is available at Azura Quilalea.  \nWater-based activities include diving, snorkelling, fishing, kayaking, dhow sailing &amp; tours to Ibo Island.\nLand activities include romantic turtle beach picnics, nature walks, stargazing, coconut plantation tours, bird watching as well as Boabab baths &amp; walking trails.","image":"optimized-images/default.webp","folderName":"islands/mozambique/azura-quilalea-private-island","created":null},{"title":"ANANTARA MEDJUMBE ISLAND RESORT","description":"Anantara Medjumbe Island Resort is located on its own remote island in the magnificent Quirimbas Archipelago in Northern Mozambique.  \nMedjume is the ultimate island retreat, offering romantic beachfront accommodation, private plunge pools, fresh seafood directly from the ocean, exciting water sports &amp; excellent service.\nSo secluded, Medjumbe can only be reached by small aircraft &amp; therefore ensures an unspoilt, pristine beach experience.  \nThe island enjoys some of the most breathtaking coral reefs in Mozambique, which means that diving &amp; snorkelling excursions are simply breathtaking.\n\nThere are 12 palm-thatched beach pool villas dotted along the beach.  These villas are sophisticated, yet simple &amp; offer everything you need for a relaxing island getaway.  \nEach villa has direct access to the beach &amp; features an oceanfront deck with a private plunge pool &amp; cabana overlooking the ocean as well as an en-suite bathroom with an indoor &amp; outdoor shower.  \nOutside on the deck, a hammock welcomes you to pick up a book or a cocktail &amp; relax.\nAt the main area, you will find many decks &amp; shaded verandas, creating private spots for relaxing.  Upstairs is home to an informal lounge with magnificent views over the ocean.\nDelicious seafood cuisine is served indoors in the dining area &amp; outside on the deck by candlelight.\n\nAt Medjumbe Island Resort, hours can be spent lounging on the beach, enjoying gorgeous views &amp; dipping in the Indian Ocean’s turquoise waters.  \nFor those in search of more activity, a range of exciting water sports is available, such as snorkelling, scuba diving, windsurfing, fishing, waterskiing, kayaking, sailing &amp; dhow excursions.\nRelaxing massages treatments can also be booked.","image":"optimized-images/default.webp","folderName":"islands/mozambique/anantara-medjumbe-island-resort-spa","created":null},{"title":"MNEMBA ISLAND LODGE","description":"Mnemba Island is a tropical paradise of coral reefs, powdery beaches &amp; turquoise water found just off the coast of Zanzibar - &amp; just 1,5km in circumference.   \nLying on this dreamy isle is Mnemba Island Lodge – a small &amp; intimate boutique-style beach resort with a dedication to providing only the best in barefoot luxury.\nThe resort is home to a PADI dive school &amp; 2 dive boats, allowing guests to venture to the ocean when they want.  Complimentary non-motorized water sports like kayaking &amp; windsurfing are available to Mnemba Island guests &amp; the permanent beach is ideal for swimming.\nThe island is also home to a fascinating green turtle population that can be seen between April &amp; August each year.  Shoes are not necessary on the island, so enjoy the laid-back island atmosphere with no dress code…&amp; no shoes!\n\nThe resort is small &amp; intimate, consisting of only 10 thatched beach bandas that are tucked into a tropical forest.  Two of these bandas are situated within close proximity to one another &amp; can accommodate a family of four.  \nFootsteps away – you will find the beach &amp; crystal-clear ocean with warm water, great visibility &amp; around 430 species of fish, including the treasured whale shark.\nEach beach banda boasts a covered walkway leading to a shuttered en-suite bathroom.  There are built-in barazas on the veranda – a great spot for afternoon siestas &amp; private beach salas with traditional Zanzibari loungers for lazy beach days.\nIn the main area, you will find a restaurant, bar &amp; Kids Club.\n\nActivities at Mnemba Island Lodge include snorkelling, diving, fishing, kayaking, stand-up paddleboarding, windsurfing &amp; deep-sea fishing.  \nGuests can also enjoy relaxing spa treatments, book a private dinner on the beach with a butler or send little ones to the Kids Club for some island adventures.","image":"optimized-images/default.webp","folderName":"islands/zanzibar/mnemba-island-lodge","created":null},{"title":"FOUR SEASONS DESROCHES ISLAND","description":"Four Seasons Desroches Island is set on a private island in the Seychelles.  It is not surprising that this slice of paradise is considered one of the most pristine &amp; untouched islands in the world.  \nDesroches is fortunate in that it enjoys a healthy climate year-round, along with miles of unspoilt beaches &amp; picturesque scenery.  \nA wonderful choice for discerning families, Four Seasons Desroches’s villas have private pools &amp; direct beach access, making it especially convenient for parents travelling with young children.  \nThe resort offers world-class diving &amp; snorkelling, along with a range of exciting water sports &amp; land-based activities.\n\nA variety of luxurious suites &amp; villas are scattered throughout the island.  These suites &amp; villas consist of ocean view pool villas, beach pool villas, sunset view pool villas as well as two-, three, five- &amp; seven-bedroom presidential villas.\nThe ocean view pool villas are located close to the recreational facilities, boasting a private garden, pool &amp; beautiful sea views.  Tucked away under palm trees, the beach pool villas have partial sea views &amp; also feature private pools as well as indoor &amp; outdoor showers.\nEach sunset view pool villa offers glorious ocean views from the upper balcony &amp; features a lounge &amp; pool cabana. There are also a variety of presidential villas, each beautifully designed to accommodate families or friends travelling in style.\nDining at Desroches Island Resort is an experience you will never forget.  Delicious Creole cuisine is served either on the beach, under the trees or in its signature restaurant, Le Ve Loutier.  Private in-villa dining or alfresco on the beach can also be arranged.\nResort facilities include a swimming pool, gym, spa, tennis court, water sports centre as well as Kids &amp; Teens Clubs.\n\nActivities at Desroches Island include snorkelling, biking, fishing, fly-fishing, guided walks, kayaking, picnics, sunset cruises, tennis, deep-sea fishing &amp; spa treatments.","image":"optimized-images/default.webp","folderName":"islands/seychelles/four-seasons-desroches-island","created":null},{"title":"HILTON SEYCHELLES LABRIZ RESORT &amp;amp; SPA","description":"Hilton Seychelles Labriz Resort &amp; Spa is a 5* luxury resort set on the east coast of one of the most beautiful private islands in the Seychelles:  Silhouette Island.\nThe island is covered with jungles, mountains, rainforests &amp; pristine beaches – offering all who visit an authentic island experience.  \nAn ideal choice amongst honeymooners &amp; romantics, the island offers only the best in barefoot luxury &amp; exceptional service.  The wellness spa offers a wide range of relaxing treatments &amp; with a choice of 7 impeccable restaurants, guests can dine at a different location each night.\nThe island is a short transfer from the Seychelles capital, Mahe.\n\nThe Hilton Labriz offers luxurious villa-style accommodation for the discerning traveller.  \nThere are different types of villa options to choose from.  These include garden villas, beachfront villas, beachfront villas with plunge pool, garden oasis pool villas, sanctuary pool villas, deluxe beachfront pool villas, family connecting pool villas &amp; the 2-bedroom Silhouette Estate.\nThe garden villas enjoy wonderful views over the mountains &amp; the beachfront villas are set a few steps away from the white, sandy beach.  \nThe garden oasis villas feature private gardens, outdoor rain showers &amp; large bathtubs &amp; the sanctuary pool villas offer forest views &amp; private pools.  \nThe 2-bedroom Silhouette Estate offers only the best in island luxury, privacy &amp; service.\nThe resort is home to 7 elegant restaurants, each unique in style &amp; setting.  There is also a large swimming pool, gym, putting green &amp; PADI dive centre.\n\nGuests staying at The Hilton Seychelles Labriz Resort &amp; Spa will be able to enjoy a large range of exciting island activities. \nSome of these include scuba diving, snorkelling, biking, day tours, fishing, jogging trails, sailing, tennis, kayaking &amp; sunset cruises.","image":"optimized-images/default.webp","folderName":"islands/seychelles/hilton-seychelles-labriz-resort-spa","created":null},{"title":"SIX SENSES ZIL PASYON","description":"The Six Senses Zil Pasyon is set on the private Felicite Island off the coast of La Digue &amp; is a short helicopter or boat ride from Praslin Island, making it a well-placed destination for island-hopping excursions.\nOffering a wide range of accommodation for honeymooners, couples as well as families &amp; friends travelling together – Zil Pasyon is the quintessential Seychelles experience.\nThe resort offers an endless list of facilities &amp; services – from private, white sandy beaches &amp; a high tech fitness centre to an exquisite spa &amp; in-villa dining.  Your personal butler will ensure that every request is taken care of &amp; every expectation exceeded.\nZil Pasyon is the only resort on the island, providing an exclusive island experience for the discerning traveller.\n\nSix Sense Zil Pasyon offers 28 one-bedroom pool villas, along with two-, three- &amp; four-bedroom private residences.  All villas &amp; residences boast private infinity pools &amp; beautiful views.\nThe hideaway villas are tucked away in lush vegetation &amp; feature private decks.  The panorama villas look out over the surrounding islands &amp; the oceanfront villas are located close to the water, offering glorious views of the crystal-clear sea.  \nSet against the hill &amp; facing the ocean, you will find the pasyon villas – each boasting a private garden.  The signature villas offer ocean &amp; sunset views &amp; the signature two-bedroom villas each boast spectacular views over the ocean &amp; garden.\nThe Sanctuary, Seascape &amp; Ocean Sounds are three- &amp; four-bedroom residences that are built over 2 levels, offering 300 degrees ocean views.  They are great for families or friends looking for the utmost privacy.\nResort facilities include an ocean-facing swimming pool, wellness spa, gym &amp; library.  Guest can make use of the electric buggy &amp; have a personal butler who will take care of their every whim.\n\nActivities include diving, snorkelling, hiking, island-hopping, fishing, sunset boat cruises, watching turtles hatch in season &amp; even watching movies under a glittering canopy of stars.","image":"optimized-images/default.webp","folderName":"islands/seychelles/six-senses-zil-pasyon","created":null},{"title":"CONSTANCE TSARABANJINA","description":"Set on Tsarabanjina, a small private island in the north-western Mitsio Archipelago in Madagascar lies Constance Tsarabanjina – a luxury island retreat surrounded by powder-soft beaches, lush tropical vegetation &amp; rich coral reefs.\nThis eco-friendly resort overlooks the renowned scuba-diving location:  Les Quatre Freres (The Four Brothers), four islets of silver basalt rocks that is home to a variety of colourful fish &amp; other sea creatures.\nWith a laid-back atmosphere, this barefoot chic retreat offers an unspoilt Robinson Crusoe-like island experience in one of Madagascar’s most remote &amp; pristine locations.\nHere guests can feast on fresh seafood &amp; Malagasy specialities or enjoy the ocean views from their private hammock.\n\nBathed in sunshine almost 365 days a year, Constance Tsarabanjina boasts 25 ocean-facing beach villas that are scattered along the white, sandy beach.  (13 north beach villas &amp; 12 south beach villas)\nEach villa has a thatched roof &amp; private terrace with deck chairs, sun loungers &amp; an umbrella provided on the beach.  \nThe north beach villas are completely air-conditioned &amp; the south beach villas have their bed area air-conditioned.\nConstance Tsarabanjina’s main area includes a bar that is built on soft sand overlooking a beautiful lagoon as well as a unique ‘Spa on the Rocks’ - a special open-air massage room set up on red rocks at the water’s edge.\n\nFun water activities at Constance Tsarabanjina include snorkelling, scuba diving, sailing, paddleboarding, kayaking &amp; fishing.  \nGuests can also enjoy a variety of land activities like guided nature walks, tennis or volleyball.","image":"optimized-images/default.webp","folderName":"islands/madagascar/constance-tsarabanjina","created":null},{"title":"TIME + TIDE MIAVANA","description":"Off the northeast coast of Madagascar, on Nosy Ankao – the largest of 5 pristine islands that form a protected archipelago – you will find Time + Tide Miavana.\nForming part of a 37,000-hectare protected marine area that is only accessible by helicopter, Miavana offers jaw-dropping views over the endless Indian Ocean &amp; direct access to the beach from each villa.\nBetween December &amp; February, guests can watch turtles lay eggs &amp; until April, the little hatchlings make their way across the beach to reach the ocean safely.  \nGuests who visit between June &amp; August will have the rare chance to witness terns nest on a nearby deserted island – the biggest nesting site in the Indian Ocean.  Each year, between 40,000 &amp; 90,000 seabirds nest here.\n\nDotted along the pristine beach, Time + Tide Miavana’s 14 villas boast awe-inspiring views of the endless Indian Ocean.\nEach one, two &amp; three-bedroom villa offer ample space (minimum 450 square meters), a private pool overlooking the ocean, a comfortable lounge, butler service &amp; an additional bathroom &amp; study which can be converted into a children’s room.\nMiavana’s main beach piazza features an infinity pool &amp; rooftop bar, boasting one of the most amazing views in the world.  Their comfortable lounge is the perfect place to unwind with a drink &amp; the wine cellar offers an eclectic mix of the finest local and international wines.\n\nA wide range of exciting island activities is available at Miavana.  \nThese include snorkelling, scuba diving, kayaking, kite surfing &amp; fishing as well as boat trips to see dolphins, manta rays &amp; whales.\nGuests can also explore the island on foot or bicycle, hop in a helicopter for a half-day escape to nearby reserves or enjoy relaxing spa treatments in the comfort of your villa.","image":"optimized-images/default.webp","folderName":"islands/madagascar/time-tide-miavana","created":null},{"title":"DENIS PRIVATE ISLAND","description":"Denis Private Island, a 375-acre private coral island is located amid the warm waters of the Indian Ocean in the beautiful Seychelles.  \nThe island is home to lush palm trees &amp; white powdery beaches, ensuring an authentic island experience.  Many will agree that this is a tropical paradise that is all about simple exclusivity.\nDenis Island offers a relaxing beach atmosphere &amp; exceptional service.  Guests staying here will be in good hands as the staff will cater to your every whim.\nThe PADI dive centre provides diving lessons &amp; excursions to explore the tropical waters for turtles, dolphins &amp; even whale sharks.  The island has a great reputation for deep-sea fishing, so guests can charter a vessel &amp; crew to find out what is lurking in the waters below.\n\nThe island is home to 25 free-standing cottages &amp; villas, scattered at various walking distances from the beach &amp; separated by the island’s natural vegetation.  \nThere are 3 beach cottages, 10 deluxe beach cottages, 10 beachfront spa cottages &amp; a beach villa.\nThe beach cottages lie directly on the beachfront &amp; feature private sun loungers &amp; a furnished sea-facing veranda.  The deluxe beach cottages are sea-facing &amp; feature an open terrace leading into a private garden &amp; onto the beach.  They come complete with sun loungers, a personal sala &amp; daybed.\nExquisite beachfront spa cottages lie directly on the beachfront.  Each spa cottage boasts a secluded deck with a sala &amp; day bed as well as a private courtyard &amp; garden with a massage pavilion.\nThe beach villa has a private beachfront setting, with an extensive outdoor living &amp; relaxation area complete with a plunge pool &amp; daybed.  The private courtyard features twin alfresco showers.\nResort facilities include a library, swimming pool &amp; bar.\n\nApart from diving &amp; snorkelling, guests can enjoy canoeing, village visits, tennis, jogging or bird watching.","image":"optimized-images/default.webp","folderName":"islands/seychelles/denis-private-island-lodge","created":null},{"title":"COUSINE ISLAND","description":"Have you ever dreamt of staying on a secluded, private island - surrounded by miles &amp; miles of warm, turquoise water &amp; lush, palm trees?  The lavish Cousine Island is not only an idyllic &amp; private tropical destination but also one that is dedicated to nature conservation.\nYes, the island might be small – around 30 hectares big – yet it is packed with wildlife.\nApart from seeing green turtles nest all year round, guests can also encounter Aldabra giant tortoises as well as 7 breeding species of sea birds.  Seasonal hawkbills can be seen between September &amp; April.\nOffering a boutique experience, Cousine Island only sleeps a maximum of 12 adults &amp; 6 kids, which means that the island can also be booked on an exclusive-use basis.\nNot only will guests be able to enjoy a variety of exciting water sports &amp; spa treatments, but kids will have fun building sandcastles, going on treasure hunts or doing fun science experiments.\n\nBeing the only resort on the entire island, accommodation remains small &amp; intimate.  There are only 4 luxury villas &amp; 1 presidential villa, all boasting infinity pools &amp; access to a gorgeous, sandy beach.\nCousine Island offers world-class facilities &amp; cuisine, providing only the best in barefoot luxury.  The Pavilion houses the fresh-water swimming pool, lounge &amp; library as well as a terrace where guests can enjoy spectacular views.   \nThere is also a dining area &amp; bar as well as an open-plan kitchen that allows guests to interact with the chef while he prepares meals from the freshest local ingredients.\n\nThe concierge will assist guests in planning their activities.  There are many options to choose from, including helicopter sightseeing, afternoon boat cruises, champagne picnics on a deserted beach &amp; diving or snorkelling.\nOther exciting options are kayaking, stand-up paddleboarding, volleyball, nature walks, Creole cooking lessons, spa treatments &amp; caving.  Kids can go on treasure hunts, build sandcastles or do fun science experiments.","image":"optimized-images/default.webp","folderName":"islands/seychelles/cousine-island","created":null},{"title":"ENCHANTED ISLAND RESORT","description":"As the name suggests, Enchanted Island Resort is located on a captivating 5-acre private island, just a short boat ride from Mahe Island in the Seychelles.\nHere, guests can escape the hustle &amp; bustle of everyday life &amp; embrace a luxurious island experience where private plunge pools &amp; outdoor showers are just as important as beautiful, white sandy beaches &amp; crystal-clear waters.\nOffering a boutique island experience, Enchanted Island Resort is a great pick for honeymooners or romantics looking for an intimate &amp; secluded stay.\nRomantic island activities include kayaking together to a nearby island or enjoying couple’s massages in the spa’s massage pavilion.\n\nInspired by Creole-Seychellois heritage, the 10 one-bedroom private pool villas are scattered along the beach.\nEach villa features an open-air bathroom &amp; a spacious indoor area with floor-to-ceiling windows that open to an outdoor deck with an infinity pool.  \nAt the main lodge area, you will find an inviting restaurant &amp; bar overlooking the swimming pool &amp; deck area.  Walkways connect each villa to the beaches &amp; other lodge facilities.  \nAt the centre of the island, the spa is perched on a hill offering tranquil views over the ocean.  Here, guests can either opt for the private therapy room or enjoy the couples’ treatment room with a  private steam room, outdoor bathtub &amp; viewing deck.\nOther facilities include a gym, relaxation pavilion &amp; a helipad situated on the jetty.\n\nActivities at Enchanted Island Resort include diving, snorkelling, fishing, kayaking &amp; exciting boating excursions to nearby islands.\nGuests can also enjoy relaxing treatments at the hilltop spa, take a dip in their private pool or work up a sweat in the gym.","image":"optimized-images/default.webp","folderName":"islands/seychelles/enchanted-island-resort","created":null},{"title":"Magical Maldives","description":"Discover paradise at Meeru Island Resort in the Maldives. Experience luxury and natural beauty. Visit Meeru Island Resort in the Maldives.\n\nThe Maldives is paradise on earth, known for its stunning beaches, crystal-clear waters, & luxury resorts. If you are looking for a dreamy beach vacation, then the Maldives should be on top of your list. \n\nWe get it, with so many resorts to choose from, it can be overwhelming to pick the perfect one. That’s why, at Africa Unwind, we’ve spent time exploring the best that the Maldives has to offer. One slice of Maldives paradise we believe you have to try is Meeru Island Resort. \nHere's why it is one of the best luxury resorts in the Maldives & how you can combine your Maldives holiday with a safari in Africa for the perfect bush & beach getaway.","image":"optimized-images/default.webp","folderName":"blog/all-things-africa/magical-maldives","created":null}],"parentCards":[{"title":"Tick Off The Big 5","image":"optimized-images/bucket-list/1tick-off-the-big-5/1tickoffthebig5-small.webp","folderName":"bucket-list/1tick-off-the-big-5","isCurrentFolder":false},{"title":"Sleep In a Treehouse","image":"optimized-images/bucket-list/2sleep-in-a-treehouse/1sleepinatreehouse-small.webp","folderName":"bucket-list/2sleep-in-a-treehouse","isCurrentFolder":false},{"title":"Enjoy a Water-based Safari","image":"optimized-images/bucket-list/3enjoy-a-water-based-safari/1enjoyawater-basedsafari-small.webp","folderName":"bucket-list/3enjoy-a-water-based-safari","isCurrentFolder":false},{"title":"Float In a Hot Air Balloon","image":"optimized-images/bucket-list/4float-in-a-hot-air-balloon/1floatinahotairballoon-small.webp","folderName":"bucket-list/4float-in-a-hot-air-balloon","isCurrentFolder":false},{"title":"Go Gorilla-Trekking","image":"optimized-images/bucket-list/5go-gorilla-trekking/1gogorilla-trekking-small.webp","folderName":"bucket-list/5go-gorilla-trekking","isCurrentFolder":false},{"title":"Stay On a Private Island","image":"optimized-images/bucket-list/6stay-on-a-private-island/1stayonaprivateisland-small.webp","folderName":"bucket-list/6stay-on-a-private-island","isCurrentFolder":true}],"h1Title":"Stay On a Private Island","h2Title":"Bucket List Experiences","h3Title":"Stay On a Private Island","whatWeLoveItems":[],"params":{"slug":["bucket-list","6stay-on-a-private-island"]},"level":2},"__N_SSG":true}