{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","canon":true,"lodges":"?\nLION SANDS RIVER LODGE\nLION SANDS IVORY LODGE\nLION SANDS TINGA LODGE\nLION SANDS NARINA LODGE\nNGALA SAFARI LODGE\nNGALA TENTED CAMP\nABU CAMP\nSANCTUARY BAINES’ CAMP\nRUCKOMECHI CAMP\nMOTSWARI SAFARI LODGE\nJAO CAMP\nTUBU TREE CAMP\nPUKU RIDGE\nKAINGO CAMP\n"},"content":"<p>SLEEP UNDER A CANOPY OF STARS</p>\n<p>An African honeymoon is a once-in-a-lifetime dream vacation.  And since most of us have dreamt about spending a night under a canopy of stars, there is no better time or place to make this happen.<br>For a bucket list experience under the African skies, choose one of our romantic treehouses &amp; enjoy a night of adventure, romance &amp; luxury.<br>Each treehouse is luxuriously set up for you, usually accompanied by a special dinner under the stars, a radio &amp; a starry sky as canopy.  Some treehouses are located in the middle of the bush (close enough to camp) while others come in the form of ‘star beds’ on your chalet’s open rooftop deck.<br>Are you excited yet?  Let’s see which treehouse brings out the romantic in you!<br>(Please note that most treehouse stays are only available when booking a room at the lodge, in the event that you have to return to your room due to bad weather.)</p>\n<ol>\n<li>Lion Sands Treehouses, Sabi Sand Game Reserve – South Africa<br>The crème de la crème of treehouses can be found in the game-packed Big 5 Sabi Sand Game Reserve &amp; the Kruger Private Concession in South Africa.  Lion Sands have 4 lodges to choose from:  River Lodge, Ivory Lodge, Tinga Lodge &amp; Narina Lodge – all offering an unforgettable night under the stars.  Their luxury treehouses include Chalkley Treehouse &amp; Kingstone Treehouse which sleep 2 adults each &amp; Tinyeleti Treehouse which sleeps 2 adults &amp; 2 children under the age of 15.</li>\n<li>The Ngala Treehouse, Timbavati Game Reserve – South Africa<br>You get treehouses &amp; you get treehouses.  The contemporary Ngala Treehouse will not disappoint.  It is the perfect fit for the discerning traveller who wants to be surrounded by nature, but still spend the night in the lap of luxury.   </li>\n<li>Abu Camp Elephant Star Bed – Okavango Delta – Botswana<br>The opportunity to ‘sleep with elephants’ is found nowhere else in Africa.  Abu Camp offers a treehouse that overlooks the elephant boma, so you can fall asleep by the contented rumbling &amp; low snores of Africa’s gentle giants.</li>\n<li>Sanctuary Baines’ Camp Star Bed, Okavango Delta – Botswana<br>This intimate safari camp only offers 6 suites, &amp; each comes with a private deck boasting a romantic ‘sky bed’ &amp; ‘star bath’ – the ideal romantic oasis for couples or honeymooners looking for a unique safari experience.</li>\n<li>Ruckomechi Camp Star Bed, Mana Pools - Zimbabwe<br>What is more magical than falling asleep to the sounds of nature? Ruckomechi’s secluded Star Bed Treehouse overlooks a game-packed waterhole, so you’ll be able to enjoy front-row seats to one of Mana Pool’s prime wildlife spots.</li>\n<li>Giraffe’s Nest at Motswari, Timbavati Reserve – South Africa<br>Motswari’s Giraffe’s Nest is a must for those seeking the ultimate, exclusive romantic experience.  This stilted treehouse is perched 3 meters above the ground &amp; overlooks the Xanatsi Dam – an active waterhole that attracts all kinds of wild visitors.</li>\n<li>Jao Treehouse, Okavango Delta – Botswana<br>Jao’s Treehouse is simply beautiful &amp; beautifully simple.  With billowing mosquito nets &amp; polished wood floors, the treehouse boasts beautiful views over the bush &amp; there’s even the bonus of a sharp-eyed watchman-cum-butler who will look after your safety &amp; take care of your every need.  Bring on the champagne!</li>\n<li>Tubu’s Treehouse Hide, Okavango Delta - Botswana<br>Deep in the heart of the Okavango Delta, you will find Tubu Tree Camp’s Treehouse Hide (located near camp).  At night, the hide is transformed into a magical star-bed experience &amp; before the sun sets, you can enjoy spectacular views over the bush &amp; its passing wildlife.</li>\n<li>Puku Ridge Star Bed, South Luangwa – Zambia<br>It is not only guided walking safaris that will get you close to Africa’s wildlife.  Puku Ridge is home to Zambia’s best star bed experience.  Each of the tented suites is built on elevated decks overlooking a game-rich plain &amp; include multi-level verandas with plunge pools as well as towers furnished with ‘star beds.’</li>\n<li>Kaingo Elephant Hide Star Bed, South Luangwa - Zambia<br>Set in an ebony tree on the Luangwa River, The Elephant Hide Star Bed is a wonderful opportunity to immerse yourself in the wild.  Listen to the sounds of Africa while looking up at Africa’s beautiful blanket of stars.</li>\n</ol>\n","images":["optimized-images/honeymoons/4sleep-under-a-canopy-of-stars/1sleepinatreehouse-large.webp","optimized-images/honeymoons/4sleep-under-a-canopy-of-stars/2sleepinatreehouse-large.webp","optimized-images/honeymoons/4sleep-under-a-canopy-of-stars/3sleepinatreehouse-large.webp","optimized-images/honeymoons/4sleep-under-a-canopy-of-stars/4sleepinatreehouse-large.webp","optimized-images/honeymoons/4sleep-under-a-canopy-of-stars/5sleepinatreehouse-large.webp","optimized-images/honeymoons/4sleep-under-a-canopy-of-stars/6sleepinatreehouse-large.webp","optimized-images/honeymoons/4sleep-under-a-canopy-of-stars/7sleepinatreehouse-large.webp","optimized-images/honeymoons/4sleep-under-a-canopy-of-stars/8sleepinatreehouse-large.webp"],"subfolders":[{"title":"LION SANDS RIVER LODGE","description":"Lion Sands River Lodge is the heart &amp; soul of Lion Sands &amp; is built on the banks of the Sabie River in the Southern section of the Sabi Sand Reserve, adjacent to the Kruger National Park.\nThis area is well known for its spectacular game viewing.  In fact, guests don’t have to leave the lodge for excellent sightings – it is not uncommon to spot animals wandering by while relaxing in a lounger by the swimming pool.\n\nLion Sands River Lodge features 8 luxury rooms, 6 superior luxury suites, 3 river suites &amp; 1 family river suite.\nEach of the 8 luxury rooms has an en-suite bathroom, lounge &amp; wooden deck with bush views.\nThe 6 superior luxury rooms are larger &amp; have ample open-plan bathrooms &amp; outdoor showers – 2 sets are inter-leading, making them ideal for families.\nEach of the 3 river suites is located further away from the main lodge &amp; enjoy a more private setting.  The river views from these suites are fantastic &amp; best appreciated from the expansive decks.  The river suites also have romantic outdoor showers.\nThe family river suite has 2 bedrooms with inter-leading doors &amp; therefore an ideal choice for families travelling with young children.\nThe main lodge area features a spa, bar, large deck with pool, gym, library &amp; computer facilities.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/kruger-national-park/sabi-sand-private-game-reserve/lion-sands-river-lodge","created":null},{"title":"LION SANDS IVORY LODGE","description":"Lion Sands Ivory Lodge is built on the banks of the Sabie River in the world-renowned Sabi Sand Reserve, with views extending onto the open sandbanks of the Kruger National Park.\nThis southern section of the Sabi Sand Reserve is well known for its sensational Big 5 game viewing as well as frequent cat sightings.\n\nLion Sands Ivory Lodge features 8 one-bedroom villas, which operate as 8 private villas.  Positioned at least 20m apart, the villas are designed to enjoy absolute exclusivity &amp; privacy.  \nEach villa consists of a beautiful bedroom, large living area, viewing deck &amp; plunge pool with spectacular views over the bush &amp; Sabie River.  All rooms have been tastefully decorated &amp; reflect contemporary Africa at its best.\nThe public areas include a private bar with fireplace, a library lounge, a well-stocked wine cellar, wooden viewing decks, a magnificent River Island Deck built on the river, a health spa &amp; gym as well as both an indoor &amp; open-air dining area. (boma)","image":"optimized-images/default.webp","folderName":"safaris/south-africa/kruger-national-park/sabi-sand-private-game-reserve/lion-sands-ivory-lodge","created":null},{"title":"LION SANDS TINGA LODGE","description":"Lion Sands Tinga Lodge enjoys a spectacular setting in the Kruger National Park’s Tinga Concession &amp; overlooks the Sabie River.  \nThe 5,000 hectares private concession invites a variety of wildlife &amp; exciting safari activities.  Guests can explore off-road driving, night drives, follow in the footsteps of a leopard, track down a herd of elephants, or simply wait for them to come to you.\n\nLion Sands Tinga Lodge includes 9 contemporary safari suites overlooking the Sabie River.   \nEach air-conditioned suite features an en-suite bathroom with an indoor &amp; outdoor shower as well as a private plunge pool where lazy afternoons can be spent relaxing in the sun. Each suite has an open-plan design with a lounge &amp; dining area. \nThere is also a 2-bedroom family villa.  Hi’Nkweni Villa offers total privacy &amp; wonderful views of the Sabie River from its private viewing deck &amp; pool.  This villa is ideal for families with younger children desiring to have a more exclusive safari experience.  Guests staying at Hi’Nkweni Villa will have a dedicated butler, field guide &amp; safari vehicle for the duration of their stay.\nThe main lodge area features a large wooden river deck, cosy lounge &amp; bar area, swimming pool &amp; spa.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/kruger-national-park/kruger-private-concession/lion-sands-tinga-lodge","created":null},{"title":"LION SANDS NARINA LODGE","description":"Lion Sands Narina Lodge enjoys a spectacular setting in the Kruger National Park’s Tinga Concession &amp; overlooks the Sabie River.  \nThe 5,000 hectares private concession invites a variety of wildlife &amp; exciting safari activities.  Guests can explore off-road driving, night drives, follow in the footsteps of a leopard, track down a herd of elephants, or simply wait for them to come to you.\n\nLion Sands Narina Lodge includes 9 luxury stilted suites perched among 100-year old trees overlooking the Sabie River.   \nEach air-conditioned suite features an en-suite bathroom with an indoor &amp; outdoor shower as well as a private plunge pool where lazy afternoons can be spent relaxing in the sun.  The suites are designed with privacy in mind, so guests can watch the animals come down to the river from their pool, viewing deck, as well as bed &amp; bath!\nThe suites are linked to the central lodge area via elevated wooden walkways.\nThe main area features a large wooden river deck, cosy lounge &amp; bar area, swimming pool &amp; an outdoor boma where guests can enjoy al fresco dinners &amp; barbeques.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/kruger-national-park/kruger-private-concession/lion-sands-narina-lodge","created":null},{"title":"NGALA SAFARI LODGE","description":"Set in the heart of the Timbavati Reserve in South Africa’s Greater Kruger region, Ngala provides guests with an extraordinary Big 5 safari experience.\nNgala features 2 unique safari lodges - Ngala Safari Lodge &amp; Ngala Tented Camp.  Ngala Safari Lodge is a great option for families &amp; Ngala Tented Camp is ideal for couples or honeymooners.\n\nNgala Safari Lodge is a colonial-style safari lodge &amp; is renowned for its superb accommodation.  There are 20 thatched cottages, 3 family cottages &amp; a family suite.\nThe thatched cottages are shaded by Mopane trees, each boasting an en-suite bathroom with a shower, twin basins, a bathtub &amp; a private verandah.\nThe family cottages comprise 2 suites that are conveniently interlinked via a door for easy access, making this an ideal choice for families.  These cottages come complete with alfresco showers.\nThe main lodge at Ngala Safari Lodge comprises a lounge, dining room, swimming pool &amp; traditional African boma where dinners are enjoyed under the African skies.\nThe family suite is located on the banks of the seasonal Maponi River &amp; consists of 2 en-suite bedrooms as well as a cosy dining area.  Guests staying here will have a dedicated butler as well as a ranger, tracker &amp; private vehicle. The suite also features a private swimming pool &amp; each bedroom includes a private deck with views over the river.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/kruger-national-park/timbavati-private-game-reserve/ngala-safari-lodge","created":null},{"title":"NGALA TENTED CAMP","description":"Set in the heart of the Timbavati Reserve in South Africa’s Greater Kruger region, Ngala provides guests with an extraordinary Big 5 safari experience.\nNgala features 2 unique safari lodges - Ngala Safari Lodge &amp; Ngala Tented Camp.  Ngala Safari Lodge is a great option for families &amp; Ngala Tented Camp is ideal for couples or honeymooners.\n\nNgala Tented Camp is a sophisticated, intimate camp set in the heart of Big 5 Country, overlooking a seasonal riverbed.  There are only 9 tented suites built on raised wooden platforms, each equipped with an en-suite bathroom &amp; outdoor shower.\nThe main area at Ngala Tented Camp features a lounge, dining room, swimming pool &amp; traditional African boma where dinners are enjoyed under the African skies.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/kruger-national-park/timbavati-private-game-reserve/ngala-tented-camp","created":null},{"title":"ABU CAMP","description":"Abu Camp is set in a 180,000-hectare private reserve in the heart of Botswana’s Okavango Delta, one of the world’s most important wetland ecosystems.\nThe Okavango Delta, one of the most iconic natural areas on the planet is a UNESCO World Heritage Site &amp; home to a great variety of wildlife, including the Abu Herd – elephants that have been rescued from exploitative situations, &amp; which will ultimately be re-introduced back into the wild.\nGuests staying at Abu Camp will have the opportunity to interact with elephants in their natural habitat – a truly transformative experience.\n\nAccommodation at Abu Camp consists of 6-ensuite luxurious tents, each kitted out in stylish antique furnishings &amp; fittings.  Private decks, outdoor copper baths &amp; private plunge pools with endless lagoon views are standard in all tents.\nThe main lounge &amp; dining areas are connected by well-lit pathways.  A well-stocked bar provides drinks &amp; cocktails around an inviting campfire setting.  The lodge also has a secluded plunge pool for guests to cool off &amp; relax.","image":"optimized-images/default.webp","folderName":"safaris/botswana/okavango-delta/abu-camp","created":null},{"title":"SANCTUARY BAINES’ CAMP","description":"Sanctuary Baines’ Camp is located within a private concession, bordering the Moremi Game Reserve &amp; is home to some of the most spectacular wildlife on earth.\nSet among the shady trees on the southern edge of the Okavango Delta, this eco-friendly lodge provides an intimate African experience.  The camp overlooks a large lagoon, making this a prime location for water safaris.\n\nSmall &amp; intimate, Sanctuary Baines’ Camp consists of only 6 suites set on elevated platforms in the tree line.  Romantic 4-poster beds are provided in each suite, completely mobile – allowing guests to sleep under the stars.  This is Botswana luxury at its best.  Wi-Fi is available in the rooms.\nThe main area at Sanctuary Baines’ Camp features a lounge, dining area &amp; large viewing deck for a truly African outdoor experience.  A sparkling swimming pool offers guests the opportunity to cool off after a day out in the African sun.","image":"optimized-images/default.webp","folderName":"safaris/botswana/okavango-delta/sanctuary-baines-camp","created":null},{"title":"RUCKOMECHI CAMP","description":"Ruckomechi Camp is located on the banks of the hippo-filled Zambezi River &amp; one of only a handful of lodges scattered around Zimbabwe’s Mana Pools National Park.  \nThe camp offers a true wilderness experience combined with ‘just the right amount’ of luxury.  Adventure seekers who are looking for an off-the-beaten-track safari experience will adore Ruckomechi Camp.\nMana Pools, a World Heritage Site, is best reached by small plane - &amp; en-route to camp guests can enjoy a bird’s eye view over this under-explored wildlife-rich landscape.\nThe life-giving Zambezi River is set close to the lodge, offering guests an ‘armchair’ wildlife experience without ever having to leave the lodge.\n\nThere are 8 luxury tents &amp; 2 stylish family suites at Ruckomechi Camp, each built on low wooden decks offering a veranda with panoramic views of the Zambezi River.\nEach tent comprises an en-suite bathroom with a shower, a lounge area &amp; a veranda with deck chairs.\nThe 2 generous family suites offer the same amenities as the luxury tents, with the addition of having 2 en-suite bedrooms.\nThe main lodge area includes a lounge, dining room, bar &amp; rim-flow pool with excellent views of the river &amp; the animals that frequent it.  There are also numerous hammocks &amp; day beds where guests can put up their feet &amp; relax.","image":"optimized-images/default.webp","folderName":"safaris/zimbabwe/mana-pools-national-park/ruckomechi-camp","created":null},{"title":"JAO CAMP","description":"Jao Camp lies on a remote island in the heart of the Okavango Delta in an area fringed with riverine forests, vast floodplains &amp; prolific wildlife.\nSome would argue that this area provides some of the most stunning scenery in Botswana.\nThe 60,000 hectares Jao Concession borders the Moremi Game Reserve &amp; offers fantastic land &amp; water-based wildlife viewing year-round.  The area comprises a superb variety of habitats, ranging from permanent waterways &amp; lagoons to thick Kalahari soils.\n\nJao Camp has 5 luxury tents, all set beneath a canopy of shady trees.  Each tent has an en-suite bathroom with a romantic outdoor shower.\nA favourite among Jao visitors is the private sala set on your viewing deck where afternoon siestas &amp; wonderful views of the floodplains can be enjoyed.  \nThere are also 2 villas, each one comprising 2 en-suite tents that accommodate 4 people in total.\nThese tented villas are ideal for families or friends travelling together as the tents are connecting by a shared lounge &amp; dining area, private butler, kitchenette with private chef, fire deck &amp; private plunge pool.  Guests staying in the villas will also have access to a private vehicle &amp; guide.\nThe main area consists of a lounge &amp; dining area as well as 2 large plunge pools &amp; an outdoor boma for dining under the stars.","image":"optimized-images/default.webp","folderName":"safaris/botswana/okavango-delta/jao-camp","created":null},{"title":"TUBU TREE CAMP","description":"Tubu Tree Camp is located on Hunda Island, the largest area of permanently dry land in the Okavango Delta.  The diverse habitats, including mopane, riverine forest &amp; dry Kalahari sandveld allow for diverse &amp; spectacular wildlife viewing.\nBecause the camp is situated in an area with the most palatable grasses, animals flock here daily &amp; often guests can experience fantastic plains game viewing from the main viewing deck.\n\nTubu Tree Camp is built in traditional style &amp; consists of only 6 double tents, all raised on wooden platforms overlooking the picturesque vistas of the Okavango Delta’s floodplains.  There is also 1 honeymoon tent &amp; 1 family unit, consisting of 2 en-suite bedrooms with adjoining lounge.  \nEach tent has an en-suite bathroom &amp; outdoor shower for those wishing to enjoy feeling close to nature.  \nThe main area features a dining, lounge &amp; pool area – also on raised platforms &amp; facilitating the beautiful views of Botswana’s bushveld.","image":"optimized-images/default.webp","folderName":"safaris/botswana/okavango-delta/tubu-tree-camp","created":null},{"title":"KAINGO CAMP","description":"Kaingo Camp is nestled amongst shady trees on the banks of the beautiful Luangwa River &amp; one of the few owner-run camps in South Luangwa National Park.\nThis camp, with its friendly atmosphere &amp; top-notch guiding, is perfect for wildlife enthusiasts of every calibre as well as families looking for a laid-back Zambian holiday.\nDelivering amazing big game encounters even after your safari activity has ended, Kaingo has a few photographic hides set in prolific locations.\nIt even offers a sleep-out in the elephant hide – an experience that should be added to everyone’s bucket list!\n\nKaingo offers 5 brick &amp; thatch chalets as well as 1 deluxe suite, called the First House.  \nThe chalets boast a spectacular location on the bans of the Luangwa River &amp; have en-suite bathrooms with outdoor bathtubs tucked under the ebony trees.\nEach chalet has a main deck set low on the river, a patio with a day bed &amp; seating area as well as a private deck overhanging the banks of the Luangwa River providing superb views of the animals coming down to drink.\nThe First House – Kaingo’s deluxe suite – is ideal for couples wanting a little extra luxury or families looking for ample privacy &amp; space.  The suite can sleep 6 people comfortably &amp; comes with a private vehicle, butler &amp; private dining.  It comprises a lounge, large patio, dining table, en-suite bathroom, guest toilet as well as an outdoor shower &amp; bath.","image":"optimized-images/default.webp","folderName":"safaris/zambia/south-luangwa-national-park/kaingo-camp","created":null}],"parentCards":[{"title":"Honeymoons","image":"optimized-images/honeymoons/1honeymoons-small.webp","folderName":"honeymoons","isCurrentFolder":true}],"h1Title":"4Sleep Under a Canopy of Stars","h2Title":"Honeymoons","h3Title":"4Sleep Under a Canopy of Stars","whatWeLoveItems":[],"params":{"slug":["honeymoons","4sleep-under-a-canopy-of-stars"]},"level":2},"__N_SSG":true}