{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","created":"1 October 2022","category":"We Say","canon":true},"content":"<p>If you know me well, you’ll know that I get excited about these 3 things:  People, travel &amp; spa treatments!</p>\n<p>So, when our friends decided to spoil us with a spa day, we could not refuse.  (Everyone needs friends like ours!)<br>The thought of getting pampered, detoxing in the steam room &amp; swimming in a heated pool got us so excited, we decided to stay the entire weekend.<br>And the reason I am blogging about this, is because we all know how amazing (&amp; tiring) travel can be.  When booking a holiday, we spend so much time exploring the area, dining out &amp; taking pictures, that we forget about the ‘unwinding part of the trip!’<br>So, I say: ‘Go for it!”  Treat yourself.  By all means – explore, travel &amp; repeat.  But balance it with something that relaxes you.  For me, that is massages &amp; facials!<br>So off we went…<br>Upon arrival at Majeka House, a boutique hotel set in the historic town of Stellenbosch in the Cape Winelands, we checked into our room &amp; decided to spend the afternoon relaxing by the heated pool.  After sunset, we enjoyed a lovely dinner next to the fireplace – the perfect ending to a day in the Winelands.  We particularly enjoyed their healthy poke bowls – in fact – we had it twice during our stay!<br>The next morning, after a delicious breakfast served in the restaurant overlooking lush gardens, we were ready for our day of pampering!<br>The Wellness Spa at Majeka House offers a wide range of spa treatments, including the complimentary use of the heated pool, steam room, sauna &amp; Jacuzzi.<br>Their Spa Menu includes massages, facials, body wraps &amp; scrubs, hand &amp; feet treatments, waxing, nail treatments &amp; much more.<br>You are also more than welcome to tailor your own package from their Spa Menu.<br>We decided on the Majeka Magic Package, which includes a 45 min back &amp; foot massage, a 60 min bespoke facial &amp; a lunch.  This package is tailored to couples, so we were booked into the larger treatment room with 2 massage beds.<br>Their well-trained &amp; experienced therapists were attentive to our personal needs &amp; treated us like royalty.<br>After our pampering session, we put on white, fluffy robes &amp; enjoyed an amazing lunch in the gardens.  The rest of the day was spent reading on the pool loungers, swimming &amp; detoxing in the steam room &amp; Jacuzzi.<br>When travelling, we enjoy staying at properties that offer spa facilities, because there is always time for a little bit of pampering.<br>Most of Africa Unwind’s clients enjoy booking private tours to Cape Town &amp; the Winelands, but that doesn’t mean there isn’t time for a relaxing treatment in the afternoon.<br>Or even better – stay an extra night &amp; get pampered properly before flying back home!<br>Aren’t holidays about relaxing…?  So, do that!<br>Come to Africa…&amp; Unwind.</p>\n","images":["optimized-images/blog/we-say/spa-surprise/1SpaSurprise-large.webp","optimized-images/blog/we-say/spa-surprise/2SpaSurprise-large.webp","optimized-images/blog/we-say/spa-surprise/3SpaSurprise-large.webp","optimized-images/blog/we-say/spa-surprise/4SpaSurprise-large.webp","optimized-images/blog/we-say/spa-surprise/5SpaSurprise-large.webp","optimized-images/blog/we-say/spa-surprise/6SpaSurprise-large.webp","optimized-images/blog/we-say/spa-surprise/7SpaSurprise-large.webp","optimized-images/blog/we-say/spa-surprise/8SpaSurprise-large.webp"],"subfolders":[{"title":"Family Fun","description":"OK, Let’s be honest – traveling with kids can be fun (or not).  It all depends on one crucial holiday ingredient:  activities! “What are we going to do today?” is often the one question parents hear while on holiday - &amp; often repetitively. So, I made it my mission to find a holiday that offers of a bagful of fun for the whole family – including Mum &amp; Dad. OK, Let’s be honest – traveling with kids can be fun (or not).  It all depends on one crucial holiday ingredient:  activities!","image":"optimized-images/blog/we-say/family-fun/1FamilyFun-small.webp","folderName":"blog/we-say/family-fun"},{"title":"Island Extraordinaire","description":"There are two things that excite me when it comes to travel:  Islands &amp; luxury…And for some reason, these two things are like cookies &amp; cream – they create the perfect balance to a holiday. So, from now on I will refer to this term (Islands + Luxury) as ‘Island Extraordinaire’, because if you continue to read until the end, you’ll understand why our recent trip to Mozambique was exactly that - Extraordinary!","image":"optimized-images/blog/we-say/island-extraordinaire/1IslandExtraordinaire-small.webp","folderName":"blog/we-say/island-extraordinaire"},{"title":"Mother City","description":"Everyone loves Cape Town.  Full stop.  This article is finished. The only reason I continue to write, is because there is so much to say about South Africa’s most beautiful city.  You may think I am biased since I was born here & grew up here – but then I meet people from other countries around the world who agree with me - & I realise, I am right! (She said humbly.)","image":"optimized-images/blog/we-say/mother-city/1MotherCity-small.webp","folderName":"blog/we-say/mother-city"},{"title":"Spa Surprise","description":"If you know me well, you’ll know that I get excited about these 3 things:  People, travel &amp; spa treatments! So, when our friends decided to spoil us with a spa day, we could not refuse.  (Everyone needs friends like ours!)","image":"optimized-images/blog/we-say/spa-surprise/1SpaSurprise-small.webp","folderName":"blog/we-say/spa-surprise"},{"title":"Sunny Safari","description":"“Wow, I am excited about this trip!” I thought while packing. Safari outfits?  Check.  Camera?  Check.  Swim gear?  Check.  After I have packed these three essentials, I almost felt like the rest of the things on my list were suddenly not so important anymore.  (But with kids, you always need to pack more!  So I did.)","image":"optimized-images/blog/we-say/sunny-safari/1SunnySafari-small.webp","folderName":"blog/we-say/sunny-safari"},{"title":"Wine & Whales","description":"Apart from seeing the Big 5 on safari, there are 2 things that get most travellers excited:  Wine &amp; Whales – in no particular order! But we are not most people.  My husband &amp; I don’t even drink wine (please don’t judge us!) – but we decided to investigate 2 of the most popular self-drive routes in South Africa to see if they are truly as spectacular as everyone says.","image":"optimized-images/blog/we-say/wine--whales/1Wine&Whales-small.webp","folderName":"blog/we-say/wine-whales"}],"parentCards":[{"title":"All Things Africa","image":"optimized-images/blog/all-things-africa/1-all-things-africa-small.webp","folderName":"blog/all-things-africa","isCurrentFolder":false},{"title":"Our Clients Say","image":"optimized-images/blog/our-clients-say/1-clients-say-small.webp","folderName":"blog/our-clients-say","isCurrentFolder":false},{"title":"We Say","image":"optimized-images/blog/we-say/1-we-say-small.webp","folderName":"blog/we-say","isCurrentFolder":true}],"h1Title":"Spa Surprise","h2Title":"We Say","h3Title":"Spa Surprise","whatWeLoveItems":[],"params":{"slug":["blog","we-say","spa-surprise"]},"level":3},"__N_SSG":true}