{"pageProps":{"frontmatter":{"title":"EMERSON SPICE HOTEL","subtitle":"","article_title":"","canon":true},"content":"<h4>Experience</h4>\n<p>An ancient Merchant’s House has been lovingly restored over the years &amp; is now one of Stone Town’s most renowned hotels:  The Emerson Spice.<br>With an ideal setting in colourful Stone Town, it is here where guests will experience the real Zanzibar in contrast to glossy travel brochures.<br>Stone Town is the oldest part of Zanzibar City.  Named a UNESCO World Heritage Site in 2000, it is known for its rich cultural heritage of Arab, Persian, Indian, and European elements.<br>Emerson Spice boasts 2 restaurants.<br>The rooftop Tea House is one of Stone Town’s most renowned restaurants, offering a stylish ambience amidst the sound of calls to prayer from the town’s many mosques.  The Tea House boasts gorgeous sea &amp; city views.<br>The Secret Garden Restaurant offers delicious local cuisine &amp; is located within the distinctive ruins of the adjacent garden.</p>\n<h4>Stay</h4>\n<p>Furnished with antique Zanzibar furniture, each of the 10 rooms is individually decorated &amp; overlooks the hotel’s central courtyard.<br>Designed with romance in mind, the en-suite bathrooms are partially open to the bedrooms.</p>\n<h4>Activities</h4>\n<p>Stonetown has a variety of fun-filled activities on the to-do list.<br>Guests can enjoy exotic spice tours, explore the streets of Stone Town with a local guide, see giant tortoises on Prison Island, sample the street food at a local market or visit Freddy Mercury’s house.<br>They can also try their hand at coffee roasting, embark on a traditional dhow cruise, visit Jozani Forest or enjoy a rooftop dinner at Emerson on Hurumzi while watching the sun go down.<br>Photographers &amp; Instagrammers love taking pictures of the narrow streets of Stone Town, with its iconic Zanzibar doors.</p>\n","images":["optimized-images/islands/zanzibar/emerson-spice-hotel/1emersonspicehotel-large.webp","optimized-images/islands/zanzibar/emerson-spice-hotel/2emersonspicehotel-large.webp","optimized-images/islands/zanzibar/emerson-spice-hotel/3emersonspicehotel-large.webp","optimized-images/islands/zanzibar/emerson-spice-hotel/4emersonspicehotel-large.webp","optimized-images/islands/zanzibar/emerson-spice-hotel/5emersonspicehotel-large.webp","optimized-images/islands/zanzibar/emerson-spice-hotel/6emersonspicehotel-large.webp","optimized-images/islands/zanzibar/emerson-spice-hotel/7emersonspicehotel-large.webp","optimized-images/islands/zanzibar/emerson-spice-hotel/8emersonspicehotel-large.webp"],"subfolders":[{"title":"Baraza Resort & Spa","description":"Baraza Resort &amp; Spa is Zanzibar’s most exclusive boutique resort &amp; is located along the beach that was named as one of the top 30 in the world by the prestigious Conde Nast Traveler magazine. This all-inclusive resort evokes the heritage of Zanzibar dating back to the era of the Sultans.  Baraza’s design is an interesting mix of Arabic, Swahili &amp; Indian influence, with intricate hand-carved cement décor, beautiful antiques, handmade furniture &amp; brass lanterns.  ","image":"optimized-images/islands/zanzibar/baraza-resort-spa/1barazaresort-spa-small.webp","folderName":"islands/zanzibar/baraza-resort-spa"},{"title":"Emerson Spice Hotel","description":"An ancient Merchant’s House has been lovingly restored over the years &amp; is now one of Stone Town’s most renowned hotels:  The Emerson Spice. With an ideal setting in colourful Stone Town, it is here where guests will experience the real Zanzibar in contrast to glossy travel brochures.","image":"optimized-images/islands/zanzibar/emerson-spice-hotel/1emersonspicehotel-small.webp","folderName":"islands/zanzibar/emerson-spice-hotel"},{"title":"Fundu Lagoon","description":"Fundu Lagoon is located on Pemba Island, the sister island to Zanzibar lying across the Pemba Channel to the North.  Romantic, secluded &amp; only accessible by boat, Fundu Lagoon provides only the best in barefoot luxury.  ","image":"optimized-images/islands/zanzibar/fundu-lagoon/1fundulagoon-small.webp","folderName":"islands/zanzibar/fundu-lagoon"},{"title":"Gold Zanzibar Beach House & Spa","description":"Located on Kendwa Beach in the far north-east of the spice island, you will find Gold Zanzibar Beach House &amp; Spa. Virtually unaffected by the Indian Ocean’s tides, the resort overlooks one of the island’s best swimming beaches - the ideal place to float in the crystal-clear ocean or bask in the sun with a cocktail in hand.","image":"optimized-images/islands/zanzibar/gold-zanzibar-beach-house-spa/1goldzanzibarbeachhouse-spa-small.webp","folderName":"islands/zanzibar/gold-zanzibar-beach-house-spa"},{"title":"Kilindi Zanzibar","description":"The mesmerizing Kilindi Zanzibar is an exclusive boutique hotel located on the northwest coast of the island, overlooking the turquoise waters of the Indian Ocean. In a class of its own, Kilindi was originally designed by Benny Andersson, one of the members of the world-famous Abba pop music group.  The resort is a true blend of sophistication &amp; barefoot luxury.","image":"optimized-images/islands/zanzibar/kilindi-zanzibar/1kilindizanzibar-small.webp","folderName":"islands/zanzibar/kilindi-zanzibar"},{"title":"Matemwe Retreat","description":"Matemwe Retreat is perched on an outcrop overlooking a shallow coral-fringed lagoon on the quieter northeast coast of Zanzibar island. Totally secluded from the mainstream tourist areas, Matemwe Retreat is adjacent to one of the best stretches of beach on the East Coast &amp; offers 4 exclusive private villas set just meters from the Indian Ocean. ","image":"optimized-images/islands/zanzibar/matemwe-retreat/1matemweretreat-small.webp","folderName":"islands/zanzibar/matemwe-retreat"},{"title":"Melia Zanzibar","description":"Set on the quiet northeast coast of Zanzibar – which is known as ‘Unguja’ in Swahili - &amp; overlooking the gorgeous Indian Ocean, lies the lushly-landscaped private estate, Melia Zanzibar. This all-inclusive luxury beach resort boasts a 300m long white, sandy beach, a private beach club &amp; a Kids Club to keep the little ones entertained.","image":"optimized-images/islands/zanzibar/melia-zanzibar/1meliazanzibar-small.webp","folderName":"islands/zanzibar/melia-zanzibar"},{"title":"Mnemba Island Lodge","description":"Mnemba Island is a tropical paradise of coral reefs, powdery beaches &amp; turquoise water found just off the coast of Zanzibar - &amp; just 1,5km in circumference.    Lying on this dreamy isle is Mnemba Island Lodge – a small &amp; intimate boutique-style beach resort with a dedication to providing only the best in barefoot luxury.","image":"optimized-images/islands/zanzibar/mnemba-island-lodge/1mnembaislandlodge-small.webp","folderName":"islands/zanzibar/mnemba-island-lodge"},{"title":"Park Hyatt Zanzibar","description":"Park Hyatt is a 5-star luxury hotel in the heart of Stone Town, the capital of Zanzibar.   Stone Town is the oldest part of Zanzibar City.  Named a UNESCO World Heritage Site in 2000, it is known for its rich cultural heritage of Arab, Persian, Indian, and European elements. ","image":"optimized-images/islands/zanzibar/park-hyatt-zanzibar/1parkhyattzanzibar-small.webp","folderName":"islands/zanzibar/park-hyatt-zanzibar"},{"title":"The Manta Resort","description":"Situated in the far north of Tanzania’s Pemba Island, Manta Resort is the quintessential secluded island getaway that is on everyone’s bucket list! Overlooking a pristine, white beach with a vibrant coral reef, this is the perfect holiday destination for blissful honeymoons or fun family getaways.  ","image":"optimized-images/islands/zanzibar/the-manta-resort/1themantaresort-small.webp","folderName":"islands/zanzibar/the-manta-resort"},{"title":"The Residence Zanzibar","description":"The Residence Zanzibar is set in isolated splendour on the southwest coast of the island, on 32 hectares of pristine land once occupied by Shirazi Princes.   Only 55 minutes from the capital of Stone Town, The Residence Zanzibar lies on a mile-long powdery, white sand beach defined by palm trees &amp; the warm waters of the Indian Ocean.  ","image":"optimized-images/islands/zanzibar/the-residence-zanzibar/1theresidencezanzibar-small.webp","folderName":"islands/zanzibar/the-residence-zanzibar"},{"title":"Tui Blue Bahari Zanzibar","description":"Set directly on a breathtaking white, sandy beach on Zanzibar’s secluded northeast coast, lies Tui Blue Bahari, a 5-star resort-styled like an Arabian palace. The resort entices couples, honeymooners &amp; families with a large selection of restaurants, bars &amp; swimming pools, along with flood-lit tennis courts &amp; an exquisite wellness spa.","image":"optimized-images/islands/zanzibar/tui-blue-bahari-zanzibar/1tuibluebaharizanzibar-small.webp","folderName":"islands/zanzibar/tui-blue-bahari-zanzibar"},{"title":"Tulia Zanzibar Unique Beach Resort","description":"Staying true to its name, Tulia Zanzibar Unique Beach Resort is unlike any other in Zanzibar.  Set on the popular Pongwe Beach, guests can look forward to exceptional service, stunning sea views &amp; tailor-made itineraries. Exciting water sports &amp; day excursions are available at Tulia Zanzibar, including diving, snorkelling &amp; amazing dolphin safaris.","image":"optimized-images/islands/zanzibar/tulia-zanzibar-unique-beach-resort/1tuliazanzibaruniquebeachresort-small.webp","folderName":"islands/zanzibar/tulia-zanzibar-unique-beach-resort"},{"title":"Zanzibar Serena Hotel","description":"With an ideal setting on the seafront of Zanzibar’s ancient Stone Town, lies The Zanzibar Serena Hotel – a member of Small Luxury Hotels of the World. Boasting a truly beautiful location, the hotel is ideal for romantics who want to experience a vibrant island getaway combined with traditional dhow boats &amp; bright bazaars.","image":"optimized-images/islands/zanzibar/zanzibar-serena-hotel/1zanzibarserenahotel-small.webp","folderName":"islands/zanzibar/zanzibar-serena-hotel"},{"title":"Zawadi Hotel","description":"Zawadi Hotel is perched atop a cliff overlooking the gorgeous Indian Ocean on the quiet southeast coast of Zanzibar Island. With an unspoiled beach that is ideal for swimming &amp; snorkelling, an exquisite spa offering relaxing treatments &amp; a beautiful infinity pool, the resort is perfect for honeymooners or couples looking for an indulgent, romantic getaway.","image":"optimized-images/islands/zanzibar/zawadi-hotel/1zawadihotel-small.webp","folderName":"islands/zanzibar/zawadi-hotel"},{"title":"Zuri Zanzibar","description":"Situated in Kendwa, a long, private beach on Zanzibar’s sunset-facing west coast, lies Zuri Zanzibar – the first hotel in the world to be award EarthCheck’s Sustainable Design Gold Certification. A gorgeous clifftop &amp; 300 meters of white, sandy beach welcome guests as they arrive at this tropical slice of paradise.  Its remarkable setting enjoys favourable tidal patterns that ensure safe swimming conditions all day long.  ","image":"optimized-images/islands/zanzibar/zuri-zanzibar/1zurizanzibarhotel-resort-small.webp","folderName":"islands/zanzibar/zuri-zanzibar"}],"parentCards":[{"title":"Madagascar","image":"optimized-images/islands/madagascar/1madagascar-small.webp","folderName":"islands/madagascar","isCurrentFolder":false},{"title":"Maldives","image":"optimized-images/islands/maldives/1maldives-small.webp","folderName":"islands/maldives","isCurrentFolder":false},{"title":"Mauritius","image":"optimized-images/islands/mauritius/1mauritius-small.webp","folderName":"islands/mauritius","isCurrentFolder":false},{"title":"Mozambique","image":"optimized-images/islands/mozambique/1mozambique-small.webp","folderName":"islands/mozambique","isCurrentFolder":false},{"title":"Seychelles","image":"optimized-images/islands/seychelles/1seychelles-small.webp","folderName":"islands/seychelles","isCurrentFolder":false},{"title":"Zanzibar","image":"optimized-images/islands/zanzibar/1zanzibar-small.webp","folderName":"islands/zanzibar","isCurrentFolder":true}],"h1Title":"Emerson Spice Hotel","h2Title":"Zanzibar","h3Title":"Emerson Spice Hotel","whatWeLoveItems":["Ideal setting in Zanzibar’s Stone Town","Lovingly restored Merchant’s House","A rooftop Tea House restaurant with sea & city views","Dine in the ancient garden at The Secret Garden Restaurant","Rooms overlooking the courtyard","Experience the real Zanzibar"],"params":{"slug":["islands","zanzibar","emerson-spice-hotel"]},"level":3},"__N_SSG":true}