{"pageProps":{"frontmatter":{"title":"KADIZORA CAMP","subtitle":"","article_title":"","canon":true},"content":"<h4>Experience</h4>\n<p>Kadizora Camp lies between the Vumbura River &amp; Selinda Spillway in a remote northern part of the Okavango Delta in Botswana.<br>The camp enjoys beautiful views over a seasonal floodplain &amp; is the only camp in the Okavango Delta to offer hot air ballooning.  Guests can enjoy a sunrise hot air balloon safari over the Delta &amp; if lucky – see wildlife from a bird’s eye view.</p>\n<h4>Stay</h4>\n<p>Kadizora Camp consists of 9 luxury tents &amp; 4 standard tents, each one well-positioned with outdoor decking to provide privacy &amp; iconic views of Africa.  Each spacious tent has an en-suite bathroom, featuring a bath with double vanities.<br>The main area features a bar, lounge &amp; dining area, forming a horseshoe shape around a sandy fire pit.  A wooden walkway leads you to an inviting swimming pool with a view over the floodplain.</p>\n<h4>Activities</h4>\n<p>Activities at Kadizora Camp includes hot air balloon safaris over the Delta, open 4x4 game drives, mokoro safaris in dug-out canoes, boating trips &amp; guided nature walks.<br>There is the option to arrange a day trip to a traditional village &amp; fishing is available in season.</p>\n","images":["optimized-images/safaris/botswana/okavango-delta/kadizora-camp/1kadizoracamp-large.webp","optimized-images/safaris/botswana/okavango-delta/kadizora-camp/2kadizoracamp-large.webp","optimized-images/safaris/botswana/okavango-delta/kadizora-camp/3kadizoracamp-large.webp","optimized-images/safaris/botswana/okavango-delta/kadizora-camp/4kadizoracamp-large.webp","optimized-images/safaris/botswana/okavango-delta/kadizora-camp/5kadizoracamp-large.webp","optimized-images/safaris/botswana/okavango-delta/kadizora-camp/6kadizoracamp-large.webp","optimized-images/safaris/botswana/okavango-delta/kadizora-camp/7kadizoracamp-large.webp","optimized-images/safaris/botswana/okavango-delta/kadizora-camp/8kadizoracamp-large.webp"],"subfolders":[{"title":"Abu Camp","description":"Abu Camp is set in a 180,000-hectare private reserve in the heart of Botswana’s Okavango Delta, one of the world’s most important wetland ecosystems. The Okavango Delta, one of the most iconic natural areas on the planet is a UNESCO World Heritage Site &amp; home to a great variety of wildlife, including the Abu Herd – elephants that have been rescued from exploitative situations, &amp; which will ultimately be re-introduced back into the wild.","image":"optimized-images/safaris/botswana/okavango-delta/abu-camp/1abucamp-small.webp","folderName":"safaris/botswana/okavango-delta/abu-camp","created":null},{"title":"Belmond Eagle Island Lodge","description":"Belmond Eagle Island Lodge is the ultimate luxury Botswana water-focused safari lodge &amp; located in the famous Okavango Delta, one of the world’s largest inland water systems &amp; a UNESCO World Heritage Site. Perched on a private island, among a web of waterways &amp; lush vegetation, it attracts a wonderful variety of big game &amp; exotic birds.","image":"optimized-images/safaris/botswana/okavango-delta/belmond-eagle-island-lodge/1belmondeagleisland-small.webp","folderName":"safaris/botswana/okavango-delta/belmond-eagle-island-lodge","created":null},{"title":"Camp Okavango","description":"Camp Okavango is set within the heart of the Okavango Delta on Nxaragha Island.  Surrounded by water channels &amp; spectacular scenery, this lodge is perfect for guests wishing to experience a classic Okavango Delta luxury safari. Since the camp is situated on a private island, guests can experience pure tranquillity &amp; seclusion – something that can only be found in the most remote regions of Botswana.","image":"optimized-images/safaris/botswana/okavango-delta/camp-okavango/1campokavango-small.webp","folderName":"safaris/botswana/okavango-delta/camp-okavango","created":null},{"title":"Chitabe Camp","description":"Set on a private island in the south-eastern corner of the Okavango Delta, Chitabe Camp overlooks some of the most spectacular scenery in Botswana.  Open floodplains, waterways, marshlands, dry acacia, mopane woodland, riverine forest &amp; open grasslands all contribute to Chitabe’s claim to fame. Diversity is something you will find throughout your stay at Chitabe.  The diversity of wildlife, birds &amp; habitats all adds to an excellent overall safari experience.","image":"optimized-images/safaris/botswana/okavango-delta/chitabe-camp/1chitabecamp-small.webp","folderName":"safaris/botswana/okavango-delta/chitabe-camp","created":null},{"title":"Chitabe Lediba","description":"Chitabe Lediba neighbours the Moremi Game Reserve in the Okavango Delta, Botswana.  The Chitabe Concession consists of 28, 000 hectares of some of Botswana’s most diverse habitats, from savanna to tree-filled islands &amp; floodplains.   The camp is set in the same area as its sister camp, Chitabe Camp – so wildlife viewing will be identical.  ","image":"optimized-images/safaris/botswana/okavango-delta/chitabe-lediba/1chitabelediba-small.webp","folderName":"safaris/botswana/okavango-delta/chitabe-lediba","created":null},{"title":"Delta Camp","description":"Delta Camp, like the name indicates, is situated on the southwestern edge of the palm-fringed Chief’s Island in the heart of the famous Okavango Delta. The Okavango Delta has earned its reputation as one of the world’s premier wildlife areas, &amp; with its crystal-clear channels, lagoons, sweeping floodplains &amp; countless islands – is home to a variety of wildlife.  ","image":"optimized-images/safaris/botswana/okavango-delta/delta-camp/1deltacamp-small.webp","folderName":"safaris/botswana/okavango-delta/delta-camp","created":null},{"title":"Duba Explorers Camp","description":"Located away from its sister camp, Duba Plains, Duba Explorers Camp is set on a tree-covered island in the northeastern corner of the Okavango Delta &amp; is easily one of the most remote camps in Botswana.   Situated on a 30,000-hectare private concession, the surroundings are dominated by a permanent floodplain, interspersed with seasonable floodplains &amp; grasslands as well as pockets of mopane &amp; acacia woodlands.","image":"optimized-images/safaris/botswana/okavango-delta/duba-explorers-camp/1dubaexplorers-small.webp","folderName":"safaris/botswana/okavango-delta/duba-explorers-camp","created":null},{"title":"Duba Plains Camp","description":"Located on a tree-covered island in a 30,000-hectare private concession in the Okavango Delta, Duba Plains Camp is one of the most remote camps in Botswana.   Found &amp; designed by Derek &amp; Beverly Joubert, National Geographic filmmakers, conservationists &amp; explorers, the camp is famous for its access to the constant struggle between lion &amp; buffalo.  It is not surprising that they have chosen Duba Plains for their home base.","image":"optimized-images/safaris/botswana/okavango-delta/duba-plains-camp/1dubaplains-small.webp","folderName":"safaris/botswana/okavango-delta/duba-plains-camp","created":null},{"title":"Gomoti Plains Camp","description":"Gomoti Plains Camp is located within a community-run concession on the edge of the Gomoti River system southeast of the Okavango Delta.   In Botswana, the locals know the Gomoti tree as the ‘water fig’ as it grows alongside the Okavango Delta’s waterways &amp; sometimes grows no bigger than a bush.  Large concentrations of wildlife thrive on the Gomoti plains &amp; waterways as the trees provide excellent cover for nesting water birds.","image":"optimized-images/safaris/botswana/okavango-delta/gomoti-plains-camp/1gomotiplainscamp-small.webp","folderName":"safaris/botswana/okavango-delta/gomoti-plains-camp","created":null},{"title":"Gomoti Private Camp","description":"Gomoti Private Camp is located on the edge of the Gomoti River system southeast of the Okavango Delta.  As the name suggests, the camp is small &amp; intimate, offering guests total privacy &amp; exclusivity in a luxurious Botswana safari setting. In Botswana, the locals know the Gomoti tree as the ‘water fig’ as it grows alongside the Okavango Delta’s waterways &amp; sometimes grows no bigger than a bush.  Large concentrations of wildlife thrive on the Gomoti plains &amp; waterways as the trees provide excellent cover for nesting water birds.","image":"optimized-images/safaris/botswana/okavango-delta/gomoti-private-camp/1gomotiprivatecamp-small.webp","folderName":"safaris/botswana/okavango-delta/gomoti-private-camp","created":null},{"title":"Gunn's Camp","description":"Deep in the heart of the Okavango Delta, overlooking Chief’s Island &amp; bordering the Moremi Game Reserve, lies the exquisite Gunn’s Camp.   This eco-friendly safari camp provides luxurious comfort in Botswana’s beautiful wilderness.  This area has an abundance of birdlife – especially in the wet summer season between December &amp; April.","image":"optimized-images/safaris/botswana/okavango-delta/gunns-camp/1gunn-scamp-small.webp","folderName":"safaris/botswana/okavango-delta/gunns-camp","created":null},{"title":"Jacana Camp","description":"Jacana Camp is situated on a small island in a scenic private concession called Jao, in the heart of the Okavango Delta, bordering the Moremi Game Reserve. This beautiful island setting allows for year-round water activities &amp; gorgeous views over the Okavango Delta’s water channels &amp; lagoons.","image":"optimized-images/safaris/botswana/okavango-delta/jacana-camp/1jacanacamp-small.webp","folderName":"safaris/botswana/okavango-delta/jacana-camp","created":null},{"title":"Jao Camp","description":"Jao Camp lies on a remote island in the heart of the Okavango Delta in an area fringed with riverine forests, vast floodplains &amp; prolific wildlife. Some would argue that this area provides some of the most stunning scenery in Botswana.","image":"optimized-images/safaris/botswana/okavango-delta/jao-camp/1jaocamp-small.webp","folderName":"safaris/botswana/okavango-delta/jao-camp","created":null},{"title":"Kadizora Camp","description":"Kadizora Camp lies between the Vumbura River &amp; Selinda Spillway in a remote northern part of the Okavango Delta in Botswana. The camp enjoys beautiful views over a seasonal floodplain &amp; is the only camp in the Okavango Delta to offer hot air ballooning.  Guests can enjoy a sunrise hot air balloon safari over the Delta &amp; if lucky – see wildlife from a bird’s eye view.","image":"optimized-images/safaris/botswana/okavango-delta/kadizora-camp/1kadizoracamp-small.webp","folderName":"safaris/botswana/okavango-delta/kadizora-camp","created":null},{"title":"Kanana Camp","description":"Kanana Camp is located on the Xudum River in the southwest of the Okavango Delta.  The area is home to a myriad of animals, birds &amp; plants – the perfect place to experience the diversity of species found in the Okavango Delta. The word Kanana means ‘paradise’ in the local language &amp; it is not surprising to see why.  Set in idyllic surrounds amongst fig &amp; palm trees, Kanana overlooks the beautiful waterways of the Okavango Delta’s seasonal floodplains.","image":"optimized-images/safaris/botswana/okavango-delta/kanana-camp/1kanana-small.webp","folderName":"safaris/botswana/okavango-delta/kanana-camp","created":null},{"title":"Kiri Camp","description":"Kiri Camp is located within a private concession in one of Botswana’s most remote areas in the heart of the Okavango Delta, one of the world’s largest inland deltas. The camp derives its name from the Kiri channel which flows past the island on which the camp is situated. ","image":"optimized-images/safaris/botswana/okavango-delta/kiri-camp/1kiricamp-small.webp","folderName":"safaris/botswana/okavango-delta/kiri-camp","created":null},{"title":"Kwara Camp","description":"Kwara Camp is situated within a private concession in the northern part of the Okavango Delta, overlooking a secluded lagoon &amp; bordering the Moremi Game Reserve.   This region offers such diverse landscapes &amp; habitats, including the permanent waterways of the Okavango Delta as well as seasonal floodplains, wooded islands &amp; dry land that consists of mopane woodlands &amp; open savanna. ","image":"optimized-images/safaris/botswana/okavango-delta/kwara-camp/1kwaracamp-small.webp","folderName":"safaris/botswana/okavango-delta/kwara-camp","created":null},{"title":"Kwetsani Camp","description":"Kwetsani Camp is situated on an elongated island within the central region of the Jao Concession in the gorgeous Okavango Delta.   Just north of Jao Camp on the same floodplain system, Kwetsani Camp boasts spectacular views over the floodplains &amp; Okavango Delta vistas.","image":"optimized-images/safaris/botswana/okavango-delta/kwetsani-camp/1kwetsanicamp-small.webp","folderName":"safaris/botswana/okavango-delta/kwetsani-camp","created":null},{"title":"Little Kwara","description":"Little Kwara, as the name suggests, is a small &amp; intimate safari camp set within the 1,700 sq km game-rich Kwara Concession, bordering the Moremi Game Reserve on the northern edge of the Okavango Delta. The camp has access to both the permanent waterways of the Delta, as well as the expansive dry land areas, ensuring a range of activities can be enjoyed.","image":"optimized-images/safaris/botswana/okavango-delta/little-kwara/1littlekwara-small.webp","folderName":"safaris/botswana/okavango-delta/little-kwara","created":null},{"title":"Little Tubu","description":"Little Tubu is situated on the Okavango Delta’s Hunda Island, next to its sister camp, Tubu Tree, connected to it by boardwalks.   Hunda Island is the largest area of permanently dry land in the Okavango Delta.  The diverse habitats, including mopane, riverine forest &amp; dry Kalahari sandveld allow for diverse &amp; spectacular wildlife viewing.","image":"optimized-images/safaris/botswana/okavango-delta/little-tubu/1littletubu-small.webp","folderName":"safaris/botswana/okavango-delta/little-tubu","created":null},{"title":"Little Vumbura","description":"Little Vumbura is situated on a beautiful island in the northern region of the Okavango Delta, in the same area as its sister camp, Vumbura Plains. The camp is completely surrounded by water, ensuring spectacular views over the floodplains &amp;  excellent water activities throughout the year.  Due to its remote location, game viewing is superb all year round, with frequent sightings of lion, leopard, elephant, buffalo &amp; extensive plains game.","image":"optimized-images/safaris/botswana/okavango-delta/little-vumbura/1littlevumbura-small.webp","folderName":"safaris/botswana/okavango-delta/little-vumbura","created":null},{"title":"Mapula Lodge","description":"Mapula Lodge is set within an enormous 90,000 hectares Okavango Delta private concession that is a matrix of floodplains, woodlands &amp; channels. This iconic Delta landscape is a magical environment in which to enjoy the abundance of wildlife Botswana has to offer.  ","image":"optimized-images/safaris/botswana/okavango-delta/mapula-lodge/1mapulalodge-small.webp","folderName":"safaris/botswana/okavango-delta/mapula-lodge","created":null},{"title":"Nxabega Okavango Tented Camp","description":"Nxabega Okavango Tented Camp is set within a private concession to the southeast of the Moremi Wildlife Reserve in the heart of the world-renowned Okavango Delta in Botswana. This area is made up of wetlands, water channels, forested islands &amp; grassy floodplains – attracting a variety of wildlife &amp; offers breathtaking views over some of the world’s most gorgeous landscapes.","image":"optimized-images/safaris/botswana/okavango-delta/nxabega-okavango-tented-camp/1nxabega-small.webp","folderName":"safaris/botswana/okavango-delta/nxabega-okavango-tented-camp","created":null},{"title":"Oddballs Camp","description":"Oddballs Camp is situated on the edge of Chief’s Island, deep in the heart of the Okavango Delta in Botswana.  The contrast of desert &amp; wetland is what makes the Okavango unique. Game of all sorts abounds – lion, leopard, buffalo, elephant, hippo, crocodiles &amp; over 450 bird species are amongst the many species that visit this part of the Okavango Delta.","image":"optimized-images/safaris/botswana/okavango-delta/oddballs-camp/1oddballscamp-small.webp","folderName":"safaris/botswana/okavango-delta/oddballs-camp","created":null},{"title":"Oddballs Enclave","description":"Oddballs Enclave, the sister camp of Oddballs, is situated on the edge of Chief’s Island, deep in the heart of the Okavango Delta in Botswana.  This small, intimate hideaway provides incredible views over the floodplains – especially during sunrise or sunset.  Plenty of animals are found in this area.  Some of these include lion, leopard, buffalo, elephant, hippo, crocodiles &amp; over 450 bird species.","image":"optimized-images/safaris/botswana/okavango-delta/oddballs-enclave/01oddballsenclave-small.webp","folderName":"safaris/botswana/okavango-delta/oddballs-enclave","created":null},{"title":"Pom Pom Camp","description":"Pom Pom Camp boasts a remarkable setting on a private island in the heart of the Okavango Delta.   The camp is located in a private concession, where off-road driving &amp; night drives are permitted – so clients can expect consistent game viewing year-round.","image":"optimized-images/safaris/botswana/okavango-delta/pom-pom-camp/1pompomcamp-small.webp","folderName":"safaris/botswana/okavango-delta/pom-pom-camp","created":null},{"title":"Sanctuary Baines' Camp","description":"Sanctuary Baines’ Camp is located within a private concession, bordering the Moremi Game Reserve &amp; is home to some of the most spectacular wildlife on earth. Set among the shady trees on the southern edge of the Okavango Delta, this eco-friendly lodge provides an intimate African experience.  The camp overlooks a large lagoon, making this a prime location for water safaris.","image":"optimized-images/safaris/botswana/okavango-delta/sanctuary-baines-camp/1sanctuarybaines-camp-small.webp","folderName":"safaris/botswana/okavango-delta/sanctuary-baines-camp","created":null},{"title":"Sanctuary Stanley's Camp","description":"Sanctuary Stanley’s Camp has a prime location in a 260,000-hectare private concession, bordering the southern section of the world-renowned Moremi Game Reserve in Botswana. The camp offers year-round access to the Okavango Delta, the world’s largest inland delta – ensuring a game-packed African safari.","image":"optimized-images/safaris/botswana/okavango-delta/sanctuary-stanleys-camp/1sanctuarystanley-scamp-small.webp","folderName":"safaris/botswana/okavango-delta/sanctuary-stanleys-camp","created":null},{"title":"Sandibe Okavango Safari Lodge","description":"Situated on the banks of the Okavango Delta &amp; adjacent to the Moremi Wildlife Reserve, Sandibe Okavango Safari Lodge offers a water &amp; wilderness experience - with the excitement of viewing big game on land. The lodge was designed to keep the true African ambience by choosing décor that naturally blends in with the natural surrounds.","image":"optimized-images/safaris/botswana/okavango-delta/sandibe-okavango-safari-lodge/1sandibesafarilodge-small.webp","folderName":"safaris/botswana/okavango-delta/sandibe-okavango-safari-lodge","created":null},{"title":"Seba Camp","description":"Seba Camp is set in the Okavango Delta of Botswana &amp; overlooks a lagoon with prolific birdlife &amp; resident pods of hippo.  The camp is named after Seba, one of the elephants historically released from nearby Abu Camp. As a baby, Seba starred in the Walt Disney movie, Whispers, which was filmed in the area.  The word “seba” means whisper in the local language.  Seba &amp; several other elephants that were released back into the wild have now formed their own heard near camp.","image":"optimized-images/safaris/botswana/okavango-delta/seba-camp/1sebacamp-small.webp","folderName":"safaris/botswana/okavango-delta/seba-camp","created":null},{"title":"Shinde Camp","description":"Shinde Camp is situated on a lush palm-fringed island in the heart of the Okavango Delta in Botswana.  Set on the edge of Shinde Lagoon, a popular drinking spot for many animals, it is not surprising to find excellent wildlife viewing year-round. Guests staying at Shinde will be delighted to experience a luxurious &amp; intimate camp surrounded by the gorgeous Okavango Delta’s waterways, floodplains &amp; swamps.","image":"optimized-images/safaris/botswana/okavango-delta/shinde-camp/1shindecamp-small.webp","folderName":"safaris/botswana/okavango-delta/shinde-camp","created":null},{"title":"Splash Camp","description":"Splash Camp enjoys a beautiful location in the heart of the Okavango Delta, within the Kwara Private Reserve.  The camp is built around a natural waterhole, which attracts wildlife year-round. Historically, this was the first place that those travelling from Maun to the Delta would hit significant water, so ‘Splash’ became a shorthand nickname for the area.","image":"optimized-images/safaris/botswana/okavango-delta/splash-camp/1splashcamp-small.webp","folderName":"safaris/botswana/okavango-delta/splash-camp","created":null},{"title":"Tubu Tree Camp","description":"Tubu Tree Camp is located on Hunda Island, the largest area of permanently dry land in the Okavango Delta.  The diverse habitats, including mopane, riverine forest &amp; dry Kalahari sandveld allow for diverse &amp; spectacular wildlife viewing. Because the camp is situated in an area with the most palatable grasses, animals flock here daily &amp; often guests can experience fantastic plains game viewing from the main viewing deck.","image":"optimized-images/safaris/botswana/okavango-delta/tubu-tree-camp/1tubutreecamp-small.webp","folderName":"safaris/botswana/okavango-delta/tubu-tree-camp","created":null},{"title":"Vumbura Plains","description":"Vumbura Plains is a premier camp set within a private concession in the extreme northern section of the Okavango Delta.  The concession includes an enormous traversing area of 60,000 hectares, ensuring phenomenal game viewing year-round. A unique feature at Vumbura Plains is its remote position in a corner of the Okavango Delta.  This position encompasses a wide variety of wildlife that has representatives of just about every animal that occurs in the Okavango biome.","image":"optimized-images/safaris/botswana/okavango-delta/vumbura-plains/1vumburaplains-small.webp","folderName":"safaris/botswana/okavango-delta/vumbura-plains","created":null},{"title":"Xaranna Okavango Delta Camp","description":"Xaranna Okavango Delta Camp is set on a private island within the 25,000-hectare wildlife concession in the heart of Botswana’s Okavango Delta. Drawing inspiration from the iconic Delta watery lily, Xaranna is a luxurious safari camp that will take guests on a journey through the channels of the Okavango Delta.","image":"optimized-images/safaris/botswana/okavango-delta/xaranna-okavango-delta-camp/1xarannaokavangodeltacamp-small.webp","folderName":"safaris/botswana/okavango-delta/xaranna-okavango-delta-camp","created":null},{"title":"Xudum Okavango Delta Lodge","description":"Xudum Okavango Delta Lodge is located to the southeast of the Moremi Game Reserve in the centre of the Okavango Delta. Truly one of Botswana’s most unique safari destinations, the Okavango Delta provides excellent land &amp; water-based game viewing year-round.","image":"optimized-images/safaris/botswana/okavango-delta/xudum-okavango-delta-lodge/1xudum-small.webp","folderName":"safaris/botswana/okavango-delta/xudum-okavango-delta-lodge","created":null},{"title":"Xugana Island Lodge","description":"Xugana Island Lodge is situated on the edge of Xugana island in the heart of Botswana’s Okavango Delta. The lodge faces onto the blue waters &amp; tranquillity of Xugana Lagoon, which is widely accepted as the most spectacular permanent water site in the Delta.   The lodge assures a year-round water experience under a canopy of wild ebony &amp; garcinia trees.","image":"optimized-images/safaris/botswana/okavango-delta/xugana-island-lodge/1xuganaislandlodge-small.webp","folderName":"safaris/botswana/okavango-delta/xugana-island-lodge","created":null}],"parentCards":[{"title":"Chobe National Park","image":"optimized-images/safaris/botswana/chobe-national-park/1chobe-small.webp","folderName":"safaris/botswana/chobe-national-park","isCurrentFolder":false},{"title":"Linyanti Wildlife Reserve","image":"optimized-images/safaris/botswana/linyanti-wildlife-reserve/1linyanti-small.webp","folderName":"safaris/botswana/linyanti-wildlife-reserve","isCurrentFolder":false},{"title":"Makgadikgadi Pans","image":"optimized-images/safaris/botswana/makgadikgadi-pans/1makgadikgadipans-small.webp","folderName":"safaris/botswana/makgadikgadi-pans","isCurrentFolder":false},{"title":"Moremi Game Reserve","image":"optimized-images/safaris/botswana/moremi-game-reserve/1moremi-small.webp","folderName":"safaris/botswana/moremi-game-reserve","isCurrentFolder":false},{"title":"Okavango Delta","image":"optimized-images/safaris/botswana/okavango-delta/1okavangodelta-small.webp","folderName":"safaris/botswana/okavango-delta","isCurrentFolder":true},{"title":"Selinda Game Reserve","image":"optimized-images/safaris/botswana/selinda-game-reserve/1selinda-small.webp","folderName":"safaris/botswana/selinda-game-reserve","isCurrentFolder":false},{"title":"The Kalahari","image":"optimized-images/safaris/botswana/the-kalahari/1thekalahari-small.webp","folderName":"safaris/botswana/the-kalahari","isCurrentFolder":false},{"title":"The Savuti","image":"optimized-images/safaris/botswana/the-savuti/1savuti-small.webp","folderName":"safaris/botswana/the-savuti","isCurrentFolder":false}],"h1Title":"Kadizora Camp","h2Title":"Okavango Delta","h3Title":"Kadizora Camp","whatWeLoveItems":["Sensational hot air ballooning","Located in a game-rich area of the Okavango Delta","Experience both land & water-based activities","Beautiful views over a seasonal floodplain","Spacious tents with outdoor decking & secluded views","Cultural village visits"],"params":{"slug":["safaris","botswana","okavango-delta","kadizora-camp"]},"level":4},"__N_SSG":true}