{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","canon":true,"lodges":"?\nSINGITA SWENI\nLONDOLOZI PRIVATE GRANITE SUITES\nVUMBURA PLAINS\nLION SANDS IVORY LODGE\nSANCTUARY BAINES’ CAMP\nBISATE LODGE\nBUMI HILLS SAFARI LODGE\nTHORNTREE RIVER LODGE\nSOSSUSVLEI DESERT LODGE\nNAMIRI PLAINS\nONE NATURE NYARUSWIGA\nSANCTUARY OLONANA\nTIME + TIDE CHINZOMBO\n"},"content":"<p>Luxury is the key ingredient when planning a honeymoon.  Getting married is a big deal &amp; celebrating such a special occasion should be done in style.</p>\n<p>Beautiful views, exclusivity, private plunge pools &amp; outdoor showers are perhaps some of the things that made their way onto your Honeymoon List – &amp; rightly so – but there are also other things to consider when choosing the ultimate honeymoon destination.</p>\n<p>See, luxury is not just about ‘things,’ it is also about experiences.  Sometimes luxury can be seen in exclusive private villas &amp; other times it is found in beautiful, tented camps.  But more importantly – luxury can also be enjoyed on a scenic hot air balloon flight, during a relaxing couples’ massage or by spending the night in a remote treehouse under a canopy of stars!</p>\n<p>Luxury comes in different shapes &amp; sizes, but one thing is certain – on honeymoon, you should have plenty of it!<br>There are so many romantic lodges &amp; resorts to choose from, so our list will barely scratch the surface, but at least it’s a start.  So join us as we celebrate our Safari Favourites in Luxury.</p>\n<h4>1. Singita Sweni, Kruger Private Concession – South Africa</h4>\n<p>The ultra-modern &amp; beautifully decorated Singita Sweni is located within a private concession in the Kruger National Park &amp; boasts some of the best wildlife viewing in the country.  Each romantic suite boasts a private terrace with a romantic day bed looking out over the Sweni River.</p>\n<h4>2. Londolozi Private Granite Suites, Sabi Sand Reserve – South Africa</h4>\n<p>Londolozi’s most luxurious safari camp, Private Granite Suites is the cherry on the cake when it comes to privacy &amp; exclusivity.  Situated in the wildlife-rich Sabi Sand Game Reserve in the Greater Kruger, Londolozi Private Granite Suites only accommodates 6 guests, ensuring personal attention &amp; dedicated service.  Each suite boasts a romantic outdoor bath with river views.</p>\n<h4>3. Vumbura Plains, Okavango Delta – Botswana</h4>\n<p>Vumbura Plains is a premier camp set within a private concession in the extreme northern section of the Okavango Delta.  Each spacious suite is raised off the ground on wooden decks &amp; has a private plunge pool &amp; sala – the ideal romantic setting.  The lodge also offers thrilling helicopter flights over the Delta.</p>\n<h4>4. Lion Sands Ivory Lodge, Sabi Sand Reserve – South Africa</h4>\n<p>Lion Sands Ivory Lodge is built on the banks of the Sabie River in the world-renowned Sabi Sand Reserve, with views extending onto the open sandbanks of the Kruger National Park.  The lodge is ideal for honeymooners as it is known for its exclusivity &amp; tailored, discreet service.  Each contemporary villa comes with a private, rim-flow pool &amp; butler &amp; honeymooners can even spend a night sleeping in a remote treehouse under a canopy of stars.</p>\n<h4>5. Sanctuary Baines’ Camp, Okavango Delta – Botswana</h4>\n<p>Sanctuary Baines’ Camp is located within a private concession, bordering the Moremi Game Reserve &amp; is home to some of the most spectacular wildlife viewing on earth.  The camp overlooks a lagoon, so the views are spectacular &amp; each suite boasts a deck with a romantic outdoor candle-lit bath &amp; a mobile bed for sleep-outs under the stars.</p>\n<h4>6. Bisate Lodge, Volcanoes National Park – Rwanda</h4>\n<p>Located in the world-renowned Volcanoes National Park, Bisate Lodge boasts dramatic forest views over the Bisoke &amp; Karisimbi volcano peaks.  Bisate Lodge is small &amp; intimate, featuring only 6 opulent en-suite forest villas, each equipped with an en-suite bathroom, central fireplace &amp; private deck with breathtaking views over Mount Bisoke.</p>\n<h4>7. Bumi Hills Safari Lodge, Matusadona National Park – Zimbabwe</h4>\n<p>Perched on a hill overlooking the largest man-made lake in the world, Bumi Hills Safari Lodge offers breathtaking views of the Zambezi River &amp; Lake Kariba’s azure waters.  Each luxurious suite boasts private decks while the 2-bedroom villa comes with a dedicated butler &amp; private vehicle – ideal for honeymooners.  The infinity pool &amp; spa with views are both the ideal setting for a romantic getaway.</p>\n<h4>8. Thorntree River Lodge, Livingstone – Zambia</h4>\n<p>Thorntree River Lodge, one of Zambia’s most contemporary lodges boasts a spectacular setting on the legendary Zambezi River, just upstream from Zambia’s biggest drawcard:  the mighty Victoria Falls.  The lodge boasts private pools, outdoor showers, an infinity pool, spa &amp; gym while their exclusive boat is especially geared for romantic sunset river cruises.</p>\n<h4>9. Sossusvlei Desert Lodge, Sossusvlei – Namibia</h4>\n<p>Nestled deep in the heart of Namibia’s ancient Namib Desert in Southern Africa, Sossusvlei Desert Lodge is a secluded &amp; serene oasis that overlooks the awe-inspiring dunes of Sossusvlei.  This secluded &amp; intimate lodge boasts luxury villas with romantic outdoor showers &amp; offers special activities like hot air balloon safaris &amp; quad biking.  Stargazing at Sossusvlei Desert Lodge is, according to Conde Nast, one of the best recommendations in Africa.</p>\n<h4>10. Namiri Plains, Serengeti National Park – Tanzania</h4>\n<p>The ultra-luxurious Namiri Plains is set within a remote corner in the eastern Serengeti – an area famous for its excellent cheetah sightings.  Substantial in size, each tented suite offers sliding doors which run the full length of the room &amp; open out on a full-length viewing deck complete with a romantic outdoor bath, offering exceptional views from the tub as you relax.  From the shower, guests can enjoy full views of the seasonal riverbed.</p>\n<h4>11. One Nature Nyaruswiga, Serengeti National Park – Tanzania</h4>\n<p>The ultra-luxurious, yet understated One Nature Nyaruswiga, is a stylish tented camp overlooking rolling grasslands in the game-rich central Serengeti.  The tents feature en-suite bathrooms complete with romantic free-standing copper bathtubs, as well as indoor &amp; outdoor showers.  Relaxing in-room massages can be arranged &amp; the stargazing deck with a telescope is the perfect place to connect with your loved one.</p>\n<h4>12. Sanctuary Olonana, Masai Mara – Kenya</h4>\n<p>Sanctuary Olonana boasts an idyllic forest setting along a private stretch of the Mara River, adjacent to the Masai Mara National Reserve in Kenya. (&amp; front-row seats to the Wildebeest Migration!)  Each suite features a lavish en-suite bathroom with bathtub, double vanity &amp; rain shower as well as an inviting deck with a daybed offering panoramic vistas of the Mara – an ideal spot to relax post-safari.</p>\n<h4>13. Time + Tide Chinzombo, South Luangwa – Zambia</h4>\n<p>Set in a private concession on the banks of a river, Time + Tide Chinzombo – Zambia’s most luxurious safari camp - offers direct access to the world-renowned South Luangwa National Park.  Each ‘floating’ villa boasts an outdoor shower, stand-alone bathtub &amp; double basins as well as a private deck with a plunge pool.</p>\n","images":["optimized-images/honeymoons/1experience-africa-in-luxury/1experienceafricainluxury-large.webp","optimized-images/honeymoons/1experience-africa-in-luxury/2experienceafricainluxury-large.webp","optimized-images/honeymoons/1experience-africa-in-luxury/3experienceafricainluxury-large.webp","optimized-images/honeymoons/1experience-africa-in-luxury/4experienceafricainluxury-large.webp","optimized-images/honeymoons/1experience-africa-in-luxury/5experienceafricainluxury-large.webp","optimized-images/honeymoons/1experience-africa-in-luxury/6experienceafricainluxury-large.webp","optimized-images/honeymoons/1experience-africa-in-luxury/7experienceafricainluxury-large.webp","optimized-images/honeymoons/1experience-africa-in-luxury/8experienceafricainluxury-large.webp"],"subfolders":[{"title":"SINGITA SWENI","description":"The Singita brand of lodges offers a premier safari experience like no other!  Contemporary &amp; luxurious in style, Singita will exceed expectations from beginning to end.\nThe ultra-modern &amp; beautifully decorated Singita Sweni is located within a private concession in the Kruger National Park &amp; boasts some of the best wildlife viewing in the country.\nDiscerning travellers fall in love with Sweni’s soft &amp; intimate interiors that carefully illuminates the textures &amp; shades of the bush.\n\nSingita Sweni is the smallest of all the Singita lodges, with six 1-bedroom suites tucked away among the trees.  \nDesigned with open-plan living in mind, each suite is equipped with a gorgeous bed, comfortable sitting area, private viewing deck &amp; en-suite bathroom with bath, indoor &amp; outdoor shower.  For a magical experience, guests can even sleep out under the stars on their private day bed.\nThere is also a pool suite for families or honeymoon couples.  This suite includes a swimming pool &amp; a shaded riverfront deck with sala &amp; an outdoor shower.  Guests staying in the pool suite will also have access to a private lounge &amp; dining area.\nThe main lodge overlooks the beautiful Sweni River where resident hippos are frequently seen.  The central area also features a lounge, bar, fireplace, swimming pool &amp; wine cellar.  Guests can also visit The Village, home to an art gallery, gym &amp; spa, along with a fascinating interactive ranger centre.\n\nA variety of activities are available at Singita Sweni.  Some of these include open 4x4 game drives, nature walks with a qualified guide, spa treatments, exercising at the gym, star gazing or swimming.\nGuests can also purchase wines from the Premier Wine Boutique or enjoy a cooking course from their Community Culinary School.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/kruger-national-park/kruger-private-concession/singita-sweni","created":null},{"title":"LONDOLOZI PRIVATE GRANITE SUITES","description":"Londolozi’s most luxurious safari camp, Private Granite Suites is the cherry on the cake when it comes to privacy &amp; exclusivity.  \nSituated in the wildlife-rich Sabi Sand Game Reserve in the Greater Kruger, Londolozi Private Granite Suites only accommodates 6 guests, ensuring personal attention &amp; dedicated service.\n\nThe 3 luxurious &amp; beautifully appointed suites are decorated with an elegant &amp; contemporary theme, using silver, grey &amp; charcoal interiors.  \nEach suite features a private, heated plunge pool overlooking the large granite rocks &amp; river below.  For a unique experience, guests can relax in their private outside river-view bath while listening to the sounds of nature.\nLondolozi Private Granite Suites is an ideal choice for the discerning traveller who appreciates the finer details of an African safari.  The suites can be booked on an individual basis or the camp can be booked for sole use.\n\nActivities at Londolozi is action-packed!  Qualified rangers &amp; trackers will accompany guests on open 4x4 game drives through the Sabi Sand Game Reserve, in search of some of Africa’s wildest animals. \nExcellent predator &amp; leopard sightings can be expected.  Daily bush walks can be enjoyed after breakfast for those interested in learning about tracking animals on foot.\nPhotographic safari courses are also on offer at an additional cost.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/kruger-national-park/sabi-sand-private-game-reserve/londolozi-private-granite-suites","created":null},{"title":"VUMBURA PLAINS","description":"Vumbura Plains is a premier camp set within a private concession in the extreme northern section of the Okavango Delta.  The concession includes an enormous traversing area of 60,000 hectares, ensuring phenomenal game viewing year-round.\n\nA unique feature at Vumbura Plains is its remote position in a corner of the Okavango Delta.  This position encompasses a wide variety of wildlife that has representatives of just about every animal that occurs in the Okavango biome.\nThis is Botswana luxury at its finest.\n\nVumbura Plains offers a high-end luxury safari experience like no other.  The camp comprises two separate 6-roomed camps – Vumbura North &amp; Vumbura South, each with a private dining, lounge &amp; bar area overlooking the magnificent vistas of the Okavango Delta.\nEach spacious suite is raised off the ground on wooden decks &amp; comprises an en-suite bedroom with a lounge as well as an outdoor shower with wonderful views over the floodplains.  Each suite also has a private plunge pool &amp; sala where guests can relax or read while sipping a cocktail.\nThere are also 2 family tents at Vumbura North, comprising 2 en-suite bedrooms.\nThe main area boasts a star-gazing deck &amp; campfire, the ideal place to relax after a day out in the bush.","image":"optimized-images/default.webp","folderName":"safaris/botswana/okavango-delta/vumbura-plains","created":null},{"title":"LION SANDS IVORY LODGE","description":"Lion Sands Ivory Lodge is built on the banks of the Sabie River in the world-renowned Sabi Sand Reserve, with views extending onto the open sandbanks of the Kruger National Park.\nThis southern section of the Sabi Sand Reserve is well known for its sensational Big 5 game viewing as well as frequent cat sightings.\n\nLion Sands Ivory Lodge features 8 one-bedroom villas, which operate as 8 private villas.  Positioned at least 20m apart, the villas are designed to enjoy absolute exclusivity &amp; privacy.  \nEach villa consists of a beautiful bedroom, large living area, viewing deck &amp; plunge pool with spectacular views over the bush &amp; Sabie River.  All rooms have been tastefully decorated &amp; reflect contemporary Africa at its best.\nThe public areas include a private bar with fireplace, a library lounge, a well-stocked wine cellar, wooden viewing decks, a magnificent River Island Deck built on the river, a health spa &amp; gym as well as both an indoor &amp; open-air dining area. (boma)\n\nPlenty of activities are available at Lion Sands Ivory Lodge.  The most popular is their open 4x4 game drives &amp; bush walks.  \nA romantic sleep-out in the Lion Sands Tree House will be something to remember!  Sleep under the African skies while listening to the sounds of the wild…\nAstronomy evenings are kept as a surprise for guests who have an interest in our solar system.  Lie back under the African sky &amp; be taken on a journey through our ancient galaxy.","image":"optimized-images/default.webp","folderName":"safaris/south-africa/kruger-national-park/sabi-sand-private-game-reserve/lion-sands-ivory-lodge","created":null},{"title":"SANCTUARY BAINES’ CAMP","description":"Sanctuary Baines’ Camp is located within a private concession, bordering the Moremi Game Reserve &amp; is home to some of the most spectacular wildlife on earth.\nSet among the shady trees on the southern edge of the Okavango Delta, this eco-friendly lodge provides an intimate African experience.  The camp overlooks a large lagoon, making this a prime location for water safaris.\n\nSmall &amp; intimate, Sanctuary Baines’ Camp consists of only 6 suites set on elevated platforms in the tree line.  Romantic 4-poster beds are provided in each suite, completely mobile – allowing guests to sleep under the stars.  This is Botswana luxury at its best.  Wi-Fi is available in the rooms.\nThe main area at Sanctuary Baines’ Camp features a lounge, dining area &amp; large viewing deck for a truly African outdoor experience.  A sparkling swimming pool offers guests the opportunity to cool off after a day out in the African sun.\n\nA variety of activities makes Sanctuary Baines’ Camp a popular safari location.  Open 4x4 game drives, nature walks, mokoro trips in dug-out canoes &amp; motorboat safaris are all available.\nA highlight for most guests is walking with 2 semi-habituated elephants, Jabu &amp; Morula.  Guests will have the opportunity to enjoy a leisurely paced walk with them, observing &amp; interacting with them, &amp; end with a picnic lunch in their company.","image":"optimized-images/default.webp","folderName":"safaris/botswana/okavango-delta/sanctuary-baines-camp","created":null},{"title":"BISATE LODGE","description":"Located in the world-renowned Volcanoes National Park, Bisate Lodge boasts dramatic forest views over the Bisoke &amp; Karisimbi volcano peaks.\nThe Volcanoes National Park is located along the western branch of the East African Rift – one of the most important biodiversity hotspots on the continent that is home to over 60 birds &amp; mammal species found nowhere else on earth.  \nThe most celebrated of these is the mountain gorilla, &amp; here guests will have the opportunity to encounter one of 10 habituated family groups inside the park.\n\nBisate Lodge features 6 opulent en-suite forest villas, each equipped with an en-suite bathroom, central fireplace &amp; private deck with breathtaking views over Mount Bisoke.  \nThe main area comprises a lounge, dining area, bar, wine cellar &amp; viewing deck.  The architecture &amp; interiors are rooted in the Rwandan culture.\n\nApart from gorilla trekking, other activities include community visits, birding, golden monkey tracking, visiting the spectacular twin lakes of Buhondo &amp; Burera, seeing the lava tunnels of the Musanze Caves as well as Dian Fossey’s burial site.","image":"optimized-images/default.webp","folderName":"safaris/rwanda/volcanoes-national-park/bisate-lodge","created":null},{"title":"BUMI HILLS SAFARI LODGE","description":"Perched on a hill overlooking the largest man-made lake in the world, Bumi Hills Safari Lodge offers breathtaking views of the Zambezi River &amp; Lake Kariba’s azure waters.\nThe park is home to a wide range of wildlife, including rhino, elephant, buffalo &amp; lion.  Not only is Kariba’s shoreline rich with wildlife &amp; birds, but the lodge’s proximity to Matusadona National Park allows for even more action-packed wildlife adventures.\n\nBumi Hills boasts 10 lake view suites as well as a 2-bedroom exclusive-use villa with a private vehicle &amp; butler.\nEach suite offers an en-suite bathroom as well as a private deck with sublime views over the lake.  The villa can accommodate a maximum of 5 people.\nAt the central lodge area, you will find a lounge, wellness spa, gym, library &amp; swimming pool.\n\nWith Lake Kariba right on your doorstep, guests can spend their days exploring the lake on private boat cruises or try their hand at tiger fishing.  \nScenic walking safaris around the lake or surrounding forests are also a highlight.  Alternatively, guests can visit one of the nearby local villages &amp; learn more about the community, their history &amp; traditions.","image":"optimized-images/default.webp","folderName":"safaris/zimbabwe/matusadona-national-park-lake-kariba/bumi-hills-safari-lodge","created":null},{"title":"THORNTREE RIVER LODGE","description":"Thorntree River Lodge, one of Zambia’s most contemporary lodges boasts a spectacular setting on the legendary Zambezi River, just upstream from Zambia’s biggest drawcard:  the mighty Victoria Falls.\nThorntree has an eco-concious design that incorporates nature &amp; 21-century living.  \nWith a superb location, guests have easy access to the Falls &amp; all the fun-filled activities it has to offer, while allowing peace &amp; tranquility in a pristine riverfront setting.\n\nSmall &amp; intimate, with only 8 suites &amp; 2 family suites, Thorntree River Lodge gives guests a boutique experience on the river’s edge.\nEach suite has an indoor &amp; outdoor en-suite bathroom &amp; a private plunge pool with spectacular river views.\nThe 2 family units have inter-leading walkways between the 2 bedrooms, which are both en-suite.  Each unit has its own indoor &amp; outdoor bathroom as well as luxurious plunge pool. \nThorntree’s central area comprises a temperature-controlled wine cellar, gym, spa, dining room, lounge &amp; swimming pool.\n\nTheir private boat is ideal for romantic sunset river cruises down the Zambezi &amp; guests have the choice of swimming in the communal infinity pool or even better – their own private plunge pool.\nGuests can also use the gym or book relaxing treatments at the spa.  Children can join the Ngwana Kids Club to learn more about nature during their time at Thorntree.\nActivities at Victoria Falls include elephant interactions, microlight flights over the Falls, river rafting, canoe safaris on the mighty Zambezi River, day trips to Livingstone Island, swimming at Devil’s Pool &amp; much more.","image":"optimized-images/default.webp","folderName":"cities/livingstone/thorntree-river-lodge","created":null},{"title":"SOSSUSVLEI DESERT LODGE","description":"Nestled deep in the heart of Namibia’s ancient Namib Desert in Southern Africa, Sossusvlei Desert Lodge is a secluded &amp; serene oasis that overlooks the awe-inspiring dunes of Sossusvlei.\nSet against a backdrop of ancient mountains, Sossusvlei Desert Lodge boasts a location that is at once dramatic &amp; serene.  \nStargazing at Sossusvlei Desert Lodge is, according to Conde Nast, one of the best recommendations in Africa.\n\nWith just 10 luxurious villas constructed of stone &amp; glass, guests can enjoy the solitary splendour of this remote landscape in privacy.  \nEach air-conditioned villa features an en-suite bathroom with a glass-encased rain shower &amp; outdoor shower, a living room with a cosy fireplace, a veranda with a private plunge pool &amp; a dramatic skylight over the bed for late-night stargazing. \nThe main lodge reflects earthy interiors &amp; comprises a lounge, dining area, bar, gym, Kids Club, library, swimming pool &amp; wellness spa.\n\nPlenty of activities are on offer at Sossusvlei Desert Lodge.  \nActive guests will enjoy quad biking, hiking &amp; walking to satisfy their sense of adventure.  For those wishing to spend more time around the red sand dunes of Sossusvlei - nature drives, dune walks &amp; hot-air balloon safaris are the way to go.\nOther options include stargazing, swimming, exercising at the gym or getting pampered at the spa.","image":"optimized-images/default.webp","folderName":"safaris/namibia/sossusvlei/sossusvlei-desert-lodge","created":null},{"title":"NAMIRI PLAINS","description":"The ultra-luxurious Namiri Plains is set within a remote corner in the eastern Serengeti – an area that was closed to tourists for 20 years to allow the cheetah population to restore itself.  Today, big cats can safely wander its plains.\n‘Namiri’ in Swahili means ‘big cat’ - &amp; aptly so, because this stylish safari camp offers some of East Africa’s best cheetah sightings.\nNamiri Plains is so remote, it is located more than an hour’s drive from any other camp in the region, offering guests an exclusive, intimate safari experience.\nEach year, one of nature’s greatest spectacles take place in East Africa:  The Great Wildebeest Migration.  And Namiri guests have front row seats to this magical wildlife show.  \nBecause this area is home to an abundance of predators, the plot thickens as lucky guests can witness cheetah, lion, leopard &amp; hyena stalk &amp; hunt their prey.\n\nAccommodation at Namiri Plains consists of 10 elegant tented suites &amp; 1 family tent, all with sweeping 360-degree views of the plains.  \nSubstantial in size, each tented suite offers sliding doors which run the full length of the room &amp; open out on a full-length viewing deck complete with a romantic outdoor bath, offering exceptional views from the tub as you relax.  \nFrom the shower, guests can enjoy full views of the seasonal riverbed.\nThe family tent is similar to the other tent, but slightly larger &amp; comes with an additional room with 2 single beds in it, which can be made into a double.\nThe communal mess tent offers beautiful views of the captivating Serengeti plains &amp; features a lounge, dining space, safari bar &amp; spa.\n\nSafari activities at Namiri Plains include open 4x4 game drives, guided bush walks, hot air balloon safaris, photographic excursions &amp; visiting the cheetah research project.","image":"optimized-images/default.webp","folderName":"safaris/tanzania/serengeti-national-park/namiri-plains","created":null},{"title":"ONE NATURE NYARUSWIGA","description":"The ultra-luxurious, yet understated One Nature Nyaruswiga, is a stylish tented camp overlooking rolling grasslands in the game-rich central Serengeti.\nEmbraced by the Nyaruswiga Hills, this magical destination provides an almost surreal backdrop for one of nature’s greatest spectacles:  The Great Wildebeest Migration.\nEach year more than a million animals migrate through this valley &amp; One Nature guests are fortunate enough to witness this magical wildlife show for the longest time.\nNot only is One Nature Nyaruswiga in the middle of the wildebeest action, the camp also offers excellent year-round game viewing.\n\nOne Nature offers 12 one-bedroom ultra-luxurious safari tents &amp; 2 two-bedroom family suites, all harmoniously nestled into the pristine woodlands of the Nyaruswiga.  \nEach tent overlooks the beautiful open savanna, &amp; any wildlife passing within miles can be seen from the comfort of the bedroom or private veranda.\nThe tents feature en-suite bathrooms complete with romantic free-standing copper bathtubs, as well as indoor &amp; outdoor showers.  \nThere are also family suites, each accommodating 5 people &amp; consisting of 2 en-suite bedrooms, separated by a spacious family living room.  The wooden deck outside offers glorious views over the sun-kissed African savannah.\nThe main area at One Nature includes a lounge, dining room, safari bar &amp; heated plunge pool.  There is also an astral observation deck with a large telescope.\n\nOne Nature Nyaruswiga offers a variety of thrilling safari activities, including open 4x4 game drives, hot air balloon safaris, bush picnics, in-room massages, stargazing opportunities, swimming &amp; romantic sundowner excursions.","image":"optimized-images/default.webp","folderName":"safaris/tanzania/serengeti-national-park/one-nature-nyaruswiga","created":null},{"title":"SANCTUARY OLONANA","description":"Sanctuary Olonana boasts an idyllic forest setting along a private stretch of the Mara River, adjacent to the Masai Mara National Reserve in Kenya.\nThis luxurious &amp; intimate safari lodge provides guests with easy access to the iconic Wildebeest Migration between July &amp; October - the greatest spectacle on Earth!\nMillions of wildebeest, zebra &amp; other antelope migrate between the Serengeti &amp; Masai Mara, so Olonana guests can encounter treacherous river crossings &amp; numerous predators on their endless journey to new grazing.\nOutside of the Migration season, the reserve is home to an abundance of wildlife, including the Big 5, so Olonana guests have the privilege of enjoying a first-class safari experience in &amp; out of season.\n\nSanctuary Olonana boasts 14 opulent safari suites, at least 130 sqm in size, with floor-to-ceiling glass doors that open out to reveal the magnificent Mara River.  Three of the suites are ideal for families as they feature an extra bedroom.\nEach suite features a lavish en-suite bathroom with bathtub, double vanity &amp; rain shower as well as an inviting deck with a day bed offering panoramic vistas of the Mara – an ideal spot to relax post-safari.\nOlonana’s large main building houses a lounge, bar, library, dining area with fireplace as well as a large terrace overlooking the river.\n\nSanctuary Olonana includes a wide range of exciting activities, such as game drives, guided walking safaris, visits to local Maasai communities &amp; thrilling hot air balloon safaris.\nRelaxing spa treatments can also be booked.","image":"optimized-images/default.webp","folderName":"safaris/kenya/masai-mara/sanctuary-olonana","created":null},{"title":"TIME + TIDE CHINZOMBO","description":"Set in a private concession on the banks of a river, Time + Tide Chinzombo – Zambia’s most luxurious safari camp - offers direct access to the world-renowned South Luangwa National Park.\nSouth Luangwa is Zambia’s premier wildlife destination &amp; home to a wealth of African wildlife - including elephant, hippo, lion, leopard, wild dog, giraffe, wildebeest &amp; 400 species of birds.\nChinzombo offers sophisticated design &amp; elegance while still maintaining a low-impact conservation ethos.\n\nWith only 6 elegant ‘floating’ villas that blend into its natural environment, the lodge ensures an exclusive &amp; intimate safari experience, making it ideal for honeymooners or couples.  One of these villas can also be used for families up to 5 people.\nEach villa features an en-suite bathroom with an outdoor shower, stand-alone bathtub &amp; double basins.  The open veranda &amp; outdoor shower blend seamlessly with the interior spaces through a series of proportioned windows.\nEach suite also includes a private deck with a plunge pool where guests can cool off in the heat of the day.  \nThe main lodge area comprises a shady deck with a swimming pool, a wellness spa &amp; a pilates area.\n\nTime + Tide Chinzombo offers a range of exciting activities, including day &amp; night drives along with guided nature walks &amp; cultural visits to the local village.\nGuests can also take a dip in the swimming pool – or their private plunge pool, get pampered in the spa or enjoy a stretch of pilates on the deck.","image":"optimized-images/default.webp","folderName":"safaris/zambia/south-luangwa-national-park/time-tide-chinzombo","created":null}],"parentCards":[{"title":"Experience Africa In Luxury","image":"optimized-images/honeymoons/1experience-africa-in-luxury/1experienceafricainluxury-small.webp","folderName":"honeymoons/1experience-africa-in-luxury","isCurrentFolder":true},{"title":"Take a Dip In a Private Plunge Pool","image":"optimized-images/honeymoons/2take-a-dip-in-a-private-plunge-pool/1takeadipinaprivateplungepool-small.webp","folderName":"honeymoons/2take-a-dip-in-a-private-plunge-pool","isCurrentFolder":false},{"title":"Indulge In Romance","image":"optimized-images/honeymoons/3indulge-in-romance/1indulgeinromance-small.webp","folderName":"honeymoons/3indulge-in-romance","isCurrentFolder":false},{"title":"Sleep Under a Canopy of Stars","image":"optimized-images/honeymoons/4sleep-under-a-canopy-of-stars/1sleepinatreehouse-small.webp","folderName":"honeymoons/4sleep-under-a-canopy-of-stars","isCurrentFolder":false},{"title":"Enjoy Bespoke Safari Activities","image":"optimized-images/honeymoons/5enjoy-bespoke-safari-activities/1enjoybespokesafariactivities-small.webp","folderName":"honeymoons/5enjoy-bespoke-safari-activities","isCurrentFolder":false},{"title":"Soak Up The Scenery","image":"optimized-images/honeymoons/6soak-up-the-scenery/1soakupthescenery-small.webp","folderName":"honeymoons/6soak-up-the-scenery","isCurrentFolder":false}],"h1Title":"1Experience Africa In Luxury","h2Title":"Honeymoon Experiences","h3Title":"1Experience Africa In Luxury","whatWeLoveItems":[],"params":{"slug":["honeymoons","1experience-africa-in-luxury"]},"level":2},"__N_SSG":true}