{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","canon":true,"lodges":"?\nLION SANDS RIVER LODGE\nLION SANDS IVORY LODGE\nLION SANDS TINGA LODGE\nLION SANDS NARINA LODGE\nNGALA SAFARI LODGE\nNGALA TENTED CAMP\nABU CAMP\nSANCTUARY BAINES’ CAMP\nRUCKOMECHI CAMP\nMOTSWARI SAFARI LODGE\nJAO CAMP\nTUBU TREE CAMP\nPUKU RIDGE\nKAINGO CAMP\n"},"content":"<p>SLEEP IN A TREEHOUSE</p>\n<p>An African holiday is all about making (childhood) dreams a reality.  When we grow up, we sometimes forget that life is still full of fantasy, mystery &amp; fun.<br>Many safari lodges throughout Africa offer guests just that – a unique &amp; magical experience…&amp; what is more magical than spending a night in a treehouse under the stars?<br>Each treehouse is luxuriously set up for you, usually accompanied by a special dinner under the stars, a radio &amp; a starry sky as canopy.  Some treehouses are located in the middle of the bush (close enough to camp) while others come in the form of ‘star beds’ on your chalet’s open rooftop deck.<br>Step back with us into childhood &amp; see which treehouse stay you prefer.<br>(Please note that most treehouse stays are only available when booking a room at the lodge, in the event that you have to return to your room due to bad weather.)</p>\n<ol>\n<li>Lion Sands Treehouses, Sabi Sand Game Reserve – South Africa<br>The crème de la crème of treehouses can be found in the game-packed Big 5 Sabi Sand Game Reserve &amp; the Kruger Private Concession in South Africa.  Lion Sands have 4 lodges to choose from:  River Lodge, Ivory Lodge, Tinga Lodge &amp; Narina Lodge – all offering an unforgettable night under the stars.  Their luxury treehouses include Chalkley Treehouse &amp; Kingston Treehouse which sleep 2 adults each &amp; Tinyeleti Treehouse which sleeps 2 adults &amp; 2 children under the age of 15.</li>\n<li>The Ngala Treehouse, Timbavati Game Reserve – South Africa<br>You get treehouses &amp; you get treehouses.  The contemporary Ngala Treehouse will not disappoint.  It is the perfect fit for the discerning traveller who wants to be surrounded by nature, but still spend the night in the lap of luxury.   </li>\n<li>Abu Camp Elephant Star Bed – Okavango Delta – Botswana<br>The opportunity to ‘sleep with elephants’ is found nowhere else in Africa.  Abu Camp offers a treehouse that overlooks the elephant boma, so you can fall asleep by the contented rumbling &amp; low snores of Africa’s gentle giants.</li>\n<li>Sanctuary Baines’ Camp Star Bed, Okavango Delta – Botswana<br>This intimate safari camp only offers 6 suites, &amp; each comes with a private deck boasting a romantic ‘sky bed’ &amp; ‘star bath’ – the ideal romantic oasis for couples or honeymooners looking for a unique safari experience.</li>\n<li>Ruckomechi Camp Star Bed, Mana Pools - Zimbabwe<br>What is more magical than falling asleep to the sounds of nature? Ruckomechi’s secluded Star Bed Treehouse overlooks a game-packed waterhole, so you’ll be able to enjoy front-row seats to one of Mana Pool’s prime wildlife spots.</li>\n<li>Giraffe’s Nest at Motswari, Timbavati Reserve – South Africa<br>Motswari’s Giraffe’s Nest is a must for those seeking the ultimate, exclusive romantic experience.  This stilted treehouse is perched 3 meters above the ground &amp; overlooks the Xanatsi Dam – an active waterhole that attracts all kinds of wild visitors.</li>\n<li>Jao Treehouse, Okavango Delta – Botswana<br>Jao’s Treehouse is simply beautiful &amp; beautifully simple.  With billowing mosquito nets &amp; polished wood floors, the treehouse boasts beautiful views over the bush &amp; there’s even the bonus of a sharp-eyed watchman-cum-butler who will look after your safety &amp; take care of your every need.  Bring on the champagne!</li>\n<li>Tubu’s Treehouse Hide, Okavango Delta - Botswana<br>Deep in the heart of the Okavango Delta, you will find Tubu Tree Camp’s Treehouse Hide (located near camp).  At night, the hide is transformed into a magical star-bed experience &amp; before the sun sets, you can enjoy spectacular views over the bush &amp; its passing wildlife.</li>\n<li>Puku Ridge Star Bed, South Luangwa – Zambia<br>It is not only guided walking safaris that will get you close to Africa’s wildlife.  Puku Ridge is home to Zambia’s best star bed experience.  Each of the tented suites is built on elevated decks overlooking a game-rich plain &amp; include multi-level verandas with plunge pools as well as towers furnished with ‘star beds.’</li>\n<li>Kaingo Elephant Hide Star Bed, South Luangwa - Zambia<br>Set in an ebony tree on the Luangwa River, The Elephant Hide Star Bed is a wonderful opportunity to immerse yourself in the wild.  Listen to the sounds of Africa while looking up at Africa’s beautiful blanket of stars.</li>\n</ol>\n","images":["optimized-images/bucket-list/2sleep-in-a-treehouse/1sleepinatreehouse-large.webp","optimized-images/bucket-list/2sleep-in-a-treehouse/2sleepinatreehouse-large.webp","optimized-images/bucket-list/2sleep-in-a-treehouse/3sleepinatreehouse-large.webp","optimized-images/bucket-list/2sleep-in-a-treehouse/4sleepinatreehouse-large.webp","optimized-images/bucket-list/2sleep-in-a-treehouse/5sleepinatreehouse-large.webp","optimized-images/bucket-list/2sleep-in-a-treehouse/6sleepinatreehouse-large.webp","optimized-images/bucket-list/2sleep-in-a-treehouse/7sleepinatreehouse-large.webp","optimized-images/bucket-list/2sleep-in-a-treehouse/8sleepinatreehouse-large.webp"],"subfolders":[{"title":"1Tick Off The Big 5","description":"TICK OFF THE BIG 5  Coming to Africa without seeing the Big 5 is like visiting Paris without catching a glimpse of the Eiffel Tower!  ","image":"optimized-images/bucket-list/1tick-off-the-big-5/1tickoffthebig5-small.webp","folderName":"bucket-list/1tick-off-the-big-5"},{"title":"2Sleep In a Treehouse","description":"SLEEP IN A TREEHOUSE An African holiday is all about making (childhood) dreams a reality.  When we grow up, we sometimes forget that life is still full of fantasy, mystery &amp; fun.","image":"optimized-images/bucket-list/2sleep-in-a-treehouse/1sleepinatreehouse-small.webp","folderName":"bucket-list/2sleep-in-a-treehouse"},{"title":"3Enjoy a Water-based Safari","description":"ENJOY A WATER-BASED SAFARI Africa offers a wide range of exciting safari activities – but not all safaris take place on land!  Some can be enjoyed from the comfort of a canoe, a boat or even a traditional mokoro (dug-out canoe).  ","image":"optimized-images/bucket-list/3enjoy-a-water-based-safari/1enjoyawater-basedsafari-small.webp","folderName":"bucket-list/3enjoy-a-water-based-safari"},{"title":"4Float In a Hot Air Balloon","description":"FLOAT IN A HOT AIR BALLOON Everyone around the world – regardless of your age, gender or ethnicity has probably dreamt about flying.  We’re not just talking about stepping onto an aeroplane, fastening your seatbelt &amp; flying across the ocean to another country…Of course, that is a given.  ","image":"optimized-images/bucket-list/4float-in-a-hot-air-balloon/1floatinahotairballoon-small.webp","folderName":"bucket-list/4float-in-a-hot-air-balloon"},{"title":"5Go Gorilla-Trekking","description":"GO GORILLA-TREKKING Talking about Bucket List adventures?  Look no further, because trekking through the jungles of Africa &amp; coming face to face with endangered mountain gorillas is as good as it gets!","image":"optimized-images/bucket-list/5go-gorilla-trekking/1gogorilla-trekking-small.webp","folderName":"bucket-list/5go-gorilla-trekking"},{"title":"6Stay On a Private Island","description":"STAY ON A PRIVATE ISLAND Nothing screams luxury quite like private island living.  And Africa’s Indian Ocean offers you a selection of private islands, each boasting pristine beaches, crystal-clear water &amp; total exclusivity. ","image":"optimized-images/bucket-list/6stay-on-a-private-island/1stayonaprivateisland-small.webp","folderName":"bucket-list/6stay-on-a-private-island"}],"parentCards":[{"title":"Another Travel Blog","image":"optimized-images/blog/anothertravelblog-small.webp","folderName":"blog","isCurrentFolder":false},{"title":"Bucket List","image":"optimized-images/bucket-list/1thebucketlist-small.webp","folderName":"bucket-list","isCurrentFolder":true},{"title":"CITIES","image":"optimized-images/cities/1cities-small.webp","folderName":"cities","isCurrentFolder":false},{"title":"All Destinations","image":"optimized-images/destinations/11-small.webp","folderName":"destinations","isCurrentFolder":false},{"title":"Family Travel","image":"optimized-images/family-travel/1familytravel-small.webp","folderName":"family-travel","isCurrentFolder":false},{"title":"Favourite","image":"","folderName":"favourite","isCurrentFolder":false},{"title":"Honeymoons","image":"optimized-images/honeymoons/1honeymoons-small.webp","folderName":"honeymoons","isCurrentFolder":false},{"title":"Africa Unwind","image":"","folderName":"index","isCurrentFolder":false},{"title":"ISLANDS","image":"optimized-images/islands/1islands-small.webp","folderName":"islands","isCurrentFolder":false},{"title":"Our Story","image":"optimized-images/our-story/1ourstory-small.webp","folderName":"our-story","isCurrentFolder":false},{"title":"SAFARIS","image":"optimized-images/safaris/1safaris-small.webp","folderName":"safaris","isCurrentFolder":false}],"h1Title":"2Sleep In a Treehouse","h2Title":"Bucket List","h3Title":"2Sleep In a Treehouse","whatWeLoveItems":[],"params":{"slug":["bucket-list","2sleep-in-a-treehouse"]},"level":2},"__N_SSG":true}