{"pageProps":{"frontmatter":{"title":"SUN SIYAM OLHUVELI","subtitle":"","article_title":"","canon":true},"content":"<h4>Experience</h4>\n<p>At the tip of South Male Atoll, the luxurious Sun Siyam Olhuveli is nestled within tropical gardens &amp; surrounded by azure waters &amp; white, sandy beaches - offering an unforgettable island escape.<br>After a 45-minute speedboat ride from Male International Airport, your dream island awaits.<br>The resort is home to an abundance of facilities &amp; island activities, making Olhuveli a popular choice for couples, honeymooners &amp; families.<br>Their lagoon is the perfect playground for watersport enthusiasts &amp; the PADI-certified dive centre that is located at the end of the jetty, offers easy access to their beautiful house reefs.</p>\n<h4>Stay</h4>\n<p>Sun Siyam Olhuveli has a range of luxury air-conditioned beach &amp; water villas – either scatter along the white, sandy beach or perched above the crystal-clear lagoon.<br>Each beach villa enjoys direct beach access &amp; features an outdoor bathroom &amp; private beach terrace with day beds &amp; sun loungers.<br>Surrounded by the Indian Ocean, each water villa boasts a private sundeck – the perfect place to relax before bathing in the warm waters below.<br>The resort is home to 2 infinity pools, 4 restaurants &amp; 3 bars.  The on-site wellness spa features a menu of relaxing body massages, outdoor flower baths &amp; beauty services.<br>The gym &amp; tennis courts are a welcoming treat to those who wish to stay active on holiday.</p>\n<h4>Activities</h4>\n<p>Olhuveli is known as one of the best watersport centres in the Maldives, so guests can try their hand at diving, snorkelling, kitesurfing, parasailing, windsurfing &amp; more.<br>Every evening, an up-close &amp; personal manta ray encounter can be enjoyed.  Guests can watch the mantas eat their plankton dinner from the resort jetty as they circle their favourite feeders.<br>Apart from enjoying the resort facilities, day trips can also be arranged for those interested in a little island exploration.</p>\n","images":["optimized-images/islands/maldives/sun-siyam-olhuveli/1sunsiyamolhuveli-large.webp","optimized-images/islands/maldives/sun-siyam-olhuveli/2sunsiyamolhuveli-large.webp","optimized-images/islands/maldives/sun-siyam-olhuveli/3sunsiyamolhuveli-large.webp","optimized-images/islands/maldives/sun-siyam-olhuveli/4sunsiyamolhuveli-large.webp","optimized-images/islands/maldives/sun-siyam-olhuveli/5sunsiyamolhuveli-large.webp","optimized-images/islands/maldives/sun-siyam-olhuveli/6sunsiyamolhuveli-large.webp","optimized-images/islands/maldives/sun-siyam-olhuveli/7sunsiyamolhuveli-large.webp","optimized-images/islands/maldives/sun-siyam-olhuveli/8sunsiyamolhuveli-large.webp"],"subfolders":[{"title":"Anantara Kihavah Villas","description":"Surrounded by coral reefs &amp; blue lagoon, Anantara Kihavah Maldives Villas is located on the Baa Atoll in a UNESCO Biosphere Reserve. The Maldives is a wonderful choice for the discerning traveller who is looking for an unspoilt island experience.  After a 35-minute seaplane ride from Male International Airport, crystal clear water, palm trees &amp; soft, powder-white sand will welcome you. The resort offers guests a once-in-a-lifetime gastronomic experience at their award-winning underwater restaurant, SEA. Other unique dining experiences range from gourmet beach breakfasts to theatrical Teppanyaki cuisine.","image":"optimized-images/islands/maldives/anantara-kihavah-villas/1anantarakihavahvillas-small.webp","folderName":"islands/maldives/anantara-kihavah-villas","created":null},{"title":"Bandos Island Resort","description":"Bandos Island Resort is situated in the middle of the turquoise-blue Indian Ocean in the Maldives.   This picture-perfect paradise is all about crystal clear water, white sandy beaches &amp; friendly, attentive service that has earned Bandos the reputation of the ‘Island of Hospitality.’ The Maldives is a wonderful choice for the discerning traveller who is looking for an unspoilt island experience.  After a 10-minute speedboat ride from Male International Airport, your dream island awaits.","image":"optimized-images/islands/maldives/bandos-island-resort/1bandosislandresort-small.webp","folderName":"islands/maldives/bandos-island-resort","created":null},{"title":"Banyan Tree Vabbinfaru","description":"Cast away on the secluded North Male Atoll in the beautiful Maldives archipelago, Banyan Tree Vabbinfaru is the ideal island paradise.   After a 20-minute speedboat ride from Male International Airport, your dream island awaits. Vabbinfaru in Maldivian means “round island circled by a round coral reef.”  As the name suggests, the resort offers world-class diving &amp; snorkelling year-round.","image":"optimized-images/islands/maldives/banyan-tree-vabbinfaru/1banyantreevabbinfaru-small.webp","folderName":"islands/maldives/banyan-tree-vabbinfaru","created":null},{"title":"Cinnamon Hakuraa Huraa","description":"Cinnamon Hakuraa Huraa is situated on Meemu Atoll, one of the largest shallow lagoons amongst the Maldivian resorts – &amp; a prime setting for taking beautiful photos. After a 45-minute seaplane ride from Male International Airport, your dream island awaits. The Maldives islands are a paradise for couples in love, &amp; Hakuraa Huraa is an ideal choice for romantics who are looking for a private &amp; tranquil island getaway.","image":"optimized-images/islands/maldives/cinnamon-hakuraa-huraa/1cinnamonhakuraahuraa-small.webp","folderName":"islands/maldives/cinnamon-hakuraa-huraa","created":null},{"title":"Coco Bodu Hithi","description":"Coco Bodu Hithi is set on a private island in North Male Atoll in the Maldives.  Surrounded by white-sand beaches, lush palm trees &amp; the warm waters of the Indian Ocean, Coco Palm is the ideal island experience. After a 40-minute speedboat ride from Male International Airport, your dream island awaits. Coco Bodu Hithi proudly takes its place amongst the elite of the most stylish resorts in the Maldives – yet offers excellent value for money.  Bodu Hithi is characterized by superb personal service, glossy décor &amp; seclusion.","image":"optimized-images/islands/maldives/coco-bodu-hithi/1cocoboduhithi-small.webp","folderName":"islands/maldives/coco-bodu-hithi","created":null},{"title":"Coco Palm Dhuni Kolhu","description":"A tropical island paradise is the only way to describe Coco Palm Dhuni Kolhu.  Located in the stunning waters of the Baa Atoll in the Maldives, the resort offers the ideal island experience. After a 30-minute seaplane ride from Male International Airport, your dream island awaits. Gorgeous views can be enjoyed from the air as you will fly over groups of private islands surrounded by nothing except the turquoise waters of the Indian Ocean.","image":"optimized-images/islands/maldives/coco-palm-dhuni-kolhu/1cocopalmdhunikolhu-small.webp","folderName":"islands/maldives/coco-palm-dhuni-kolhu","created":null},{"title":"Conrad Maldives Rangali Island","description":"Conrad Maldives Rangali is located on 2 separate islands connected by a bridge &amp; is surrounded by the tropical waters of the Indian Ocean. This resort offers only the best in barefoot luxury &amp; style.  After a 30-minute seaplane ride from Male International Airport, your dream island awaits. Having received many awards, including ‘The Best Water Villas in the World,’ ‘The Best Suites in the World,’ &amp; ‘The Best Spa Resort in the World,’ it is not surprising that discerning travellers from across the globe make this their first, second &amp; third time Indian Ocean island experience.","image":"optimized-images/islands/maldives/conrad-maldives-rangali-island/1conradmaldivesrangaliisland-small.webp","folderName":"islands/maldives/conrad-maldives-rangali-island","created":null},{"title":"Constance Halaveli","description":"Constance Halaveli is set on a private island in the Maldives’ North Ari Atoll &amp; surrounded by azure waters, beautiful coral reef &amp; white, sandy beaches. The Maldives is a wonderful choice for the discerning traveller who is looking for an unspoilt island experience.  After a 35-minute seaplane ride &amp; a 75-minute ride from Male International Airport, crystal clear water, palm trees &amp; soft, powder-white sand will welcome you. This family-friendly resort boasts a Kids Club where the young ones will be entertained to their hearts’ delight.  ","image":"optimized-images/islands/maldives/constance-halaveli/1constancehalaveli-small.webp","folderName":"islands/maldives/constance-halaveli","created":null},{"title":"Constance Moofushi Resort","description":"Constance Moofushi Resort is a diving paradise &amp; located on a castaway island in the South Ari Atoll of the Maldives.   After a 25-minute seaplane ride from Male International Airport, your dream island awaits.   Surrounded by the Indian Ocean’s turquoise waters &amp; overlooking a white, sandy beach - it is clear that Constance Moofushi provides only the best in barefoot luxury.","image":"optimized-images/islands/maldives/constance-moofushi-resort/1constancemoofushi-small.webp","folderName":"islands/maldives/constance-moofushi-resort","created":null},{"title":"Four Seasons Resort Maldives at Kuda Huraa","description":"The colourful garden island of Four Seasons Resort Maldives at Kuda Huraa has all the charm &amp; intimacy of a traditionally Maldivian village.   Located in North Male Atoll, the resort can be reached by a 25-minute speedboat ride from Male International Airport. A beautiful, central promenade lined with borders of tropical flowers has been built in the middle of the island.  This focal point is surrounded by the island’s accommodations, restaurants &amp; recreational facilities.","image":"optimized-images/islands/maldives/four-seasons-resort-maldives-at-kuda-huraa/1fourseasonsmaldives-small.webp","folderName":"islands/maldives/four-seasons-resort-maldives-at-kuda-huraa","created":null},{"title":"Kanuhura Maldives","description":"Set on a private Maldivian island in the eastern Lhaviyani Atoll, Kanuhura Maldives is everything you have ever dreamt of. After a 40-minute seaplane ride from Male International Airport - pristine beaches, turquoise waters &amp; palm trees await. This luxurious island resort is surrounded by popular dive sites, so guests will have the opportunity to see a massive variety of incredible marine creatures in their natural habitat.  ","image":"optimized-images/islands/maldives/kanuhura-maldives/1kanuhuramaldives-small.webp","folderName":"islands/maldives/kanuhura-maldives","created":null},{"title":"Kuramathi Island Resort","description":"Kuramathi Maldives is situated on a private island in Rasdhoo Atoll &amp; was one of the first Maldives island resorts to welcome guests. After a 20-minute seaplane ride from Male International Airport - pristine beaches, turquoise waters &amp; palm trees await. The island is about 1,8km long &amp; many areas of the island remain untouched, inviting guests to stroll along deserted beaches &amp; soak up paradise.","image":"optimized-images/islands/maldives/kuramathi-island-resort/1kuramathiislandresort-small.webp","folderName":"islands/maldives/kuramathi-island-resort","created":null},{"title":"Kuredu Island Resort","description":"Kuredu Island Resort is set on the northern reef of Lhaviyani Atoll in the Maldives, an area famous for its beauty &amp; abundant marine life.   After a 35-minute seaplane ride from Male International Airport, your dream island awaits.   Secluded, remote &amp; utterly beautiful – it is not surprising that guests choose Kuredu as their island destination.","image":"optimized-images/islands/maldives/kuredu-island-resort/1kureduislandresort-small.webp","folderName":"islands/maldives/kuredu-island-resort","created":null},{"title":"Kurumba Maldives","description":"On a tropical island in North Male Atoll, Kurumba Maldives features gorgeous, white sandy beaches, crystal-clear water &amp; lush coconut trees. Within easy reach of Male International Airport, speedboat transfers take less than 10 minutes, making this a wonderful choice for travellers who are eager to start their holiday!  You can be on the beach, cocktail in hand, within moments of touching down. Kurumba is a wonderful holiday destination for guests of all ages.  Couples, honeymooners, friends &amp; families are all happy on this ‘island of choice’.  With a variety of entertainment, facilities &amp; activities for young &amp; old, there is something for everyone.","image":"optimized-images/islands/maldives/kurumba-maldives/1kurumbamaldives-small.webp","folderName":"islands/maldives/kurumba-maldives","created":null},{"title":"Manafaru Maldives","description":"The peaceful &amp; serene 5-star Manafaru Maldives is set on the virgin island of Maalva Govahi at Haa Alif Atoll &amp; offers honeymooners &amp; families barefoot luxury at its best. After a 75-minute seaplane ride from Male International Airport, your dream island awaits.  (A second transfer option is possible:  guests can take a 45-minute domestic flight from Male to Hanimaadho Airport followed by a 35-minute luxury speedboat transfer.) The resort is spread over 35 acres of white, sandy beach, &amp; boasts a PADI dive centre that will assist in taking you to beautiful snorkelling sites that are only a 30-minute speedboat ride away.","image":"optimized-images/islands/maldives/manafaru-maldives/1jamanafarumaldives-small.webp","folderName":"islands/maldives/manafaru-maldives","created":null},{"title":"Meeru Island Resort","description":"Meeru Island Resort is located on the private, Meeruenfushi Island in northern Maldives.   The resort is surrounded by a beautiful lagoon &amp; long stretches of white, sandy beach of 1,200 meters long &amp; 350 meters wide.   From the airport, the island is reached by a scenic 55-minute speedboat ride.  ","image":"optimized-images/islands/maldives/meeru-island-resort/1meeruislandresort-small.webp","folderName":"islands/maldives/meeru-island-resort","created":null},{"title":"Paradise Island","description":"Paradise Island Resort &amp; Spa is located on a private island in North Male Atoll in the Maldives.   After a 20-minute speedboat ride from Male International Airport – your dream island awaits. The island is 1km long &amp; 230 meters wide &amp; is surrounded by a long, white sandy beach &amp; crystal-clear waters with an abundance of marine life.","image":"optimized-images/islands/maldives/paradise-island/1paradiseisland-small.webp","folderName":"islands/maldives/paradise-island","created":null},{"title":"Sheraton Maldives Full Moon Resort","description":"The award-winning Sheraton Maldives Full Moon Resort is set on the private Furanafushi Island in North Male Atoll, Maldives. Surrounded by white sand, crystal-clear waters &amp; golden sunshine, the 5-star resort is accessible by a complimentary 15-minute speedboat ride from Velana International Airport. The award-winning Shine Spa for Sheraton is set on a private island &amp; a range of exciting land &amp; water sports are on offer.","image":"optimized-images/islands/maldives/sheraton-maldives-full-moon-resort/1sheratonmaldivesfullmoonresort-small.webp","folderName":"islands/maldives/sheraton-maldives-full-moon-resort","created":null},{"title":"Soneva Fushi","description":"The Maldives is made up of 1,190 coral islands spread across the waters of the Indian Ocean.   In the northwest within the Baa Atoll – a UNESCO Biosphere Reserve - you will find Soneva Fushi, one of the Maldives’ largest private islands. After a 30-minute seaplane ride from Male International Airport, your dream island awaits.","image":"optimized-images/islands/maldives/soneva-fushi/1sonvevafushi-small.webp","folderName":"islands/maldives/soneva-fushi","created":null},{"title":"Sun Siyam Iru Fushi","description":"Sun Siyam Iru Fushi is located on an exclusive Indian Ocean island in Noonu Atoll.  This Maldivian resort offers guests a truly luxurious island experience. After a 45-minute seaplane ride from Male International Airport, your dream island awaits. With its spectacular remote island setting &amp; wide range of activities, Sun Siyam Iru Fushi is the ideal choice for both couples &amp; families.","image":"optimized-images/islands/maldives/sun-siyam-iru-fushi/1sunsiyamirufushi-small.webp","folderName":"islands/maldives/sun-siyam-iru-fushi","created":null},{"title":"Sun Siyam Iru Veli","description":"Set within its own lagoon in South Nilandhe Atoll, you will find Sun Siyam Iruveli – a luxurious island resort that is effortlessly chic while maintaining the charm &amp; tradition that is indigenous to the islands. After a 40-minute seaplane ride from Male International Airport, your dream island awaits. Near the resort, there are also 2 additional private islands to escape to.  Guests are promised a journey of discovery, along with an experience of tropical beauty &amp; pristine beaches.","image":"optimized-images/islands/maldives/sun-siyam-iru-veli/1sunsiyamiruveli-small.webp","folderName":"islands/maldives/sun-siyam-iru-veli","created":null},{"title":"Sun Siyam Olhuveli","description":"At the tip of South Male Atoll, the luxurious Sun Siyam Olhuveli is nestled within tropical gardens &amp; surrounded by azure waters &amp; white, sandy beaches - offering an unforgettable island escape. After a 45-minute speedboat ride from Male International Airport, your dream island awaits. The resort is home to an abundance of facilities &amp; island activities, making Olhuveli a popular choice for couples, honeymooners &amp; families.  ","image":"optimized-images/islands/maldives/sun-siyam-olhuveli/1sunsiyamolhuveli-small.webp","folderName":"islands/maldives/sun-siyam-olhuveli","created":null},{"title":"Sun Siyam Vilu Reef","description":"Sun Siyam Vilu Reef is a vision of paradise &amp; located on a private island in the South Nilandhe Atoll in the Maldives.   A picturesque seaplane journey will get you from Male International Airport to the island in just 35 minutes.  The resort never fails to create a breathtaking first impression. Blessed with pristine beaches &amp; lush greenery, this unspoilt island boasts a treasure trove of gems that await every guest.","image":"optimized-images/islands/maldives/sun-siyam-vilu-reef/1sunsiyamvilureef-small.webp","folderName":"islands/maldives/sun-siyam-vilu-reef","created":null},{"title":"Velassaru Maldives","description":"Situated on a private coral island in South Male Atoll &amp; surrounded by nothing except the sapphire Indian Ocean, lies the exclusive Velassaru Maldives. After an exhilarating 25-minute speedboat ride from Male International Airport, your dream island awaits.   The resort spoils its guests with choice!  Guests will have their pick from one of 5 restaurants &amp; can enjoy a wide range of exciting water sports &amp; on-site facilities.","image":"optimized-images/islands/maldives/velassaru-maldives/1velassarumaldives-small.webp","folderName":"islands/maldives/velassaru-maldives","created":null},{"title":"Veligandu Island Resort","description":"Veligandu Island Resort is the only resort on the island of Veligandu in the North Ari Atoll &amp; captures the essence of a luxurious Maldivian island escape. After a 25-minute seaplane ride from Male International Airport, your dream island awaits.   Upon arrival, you will see an island that is about 600 metres long &amp; 150 metres wide – totally secluded - with lush tropical surroundings, pristine beaches &amp; sparkling turquoise lagoons.","image":"optimized-images/islands/maldives/veligandu-island-resort/1veliganduislandresort-small.webp","folderName":"islands/maldives/veligandu-island-resort","created":null}],"parentCards":[{"title":"Madagascar","image":"optimized-images/islands/madagascar/1madagascar-small.webp","folderName":"islands/madagascar","isCurrentFolder":false},{"title":"Maldives","image":"optimized-images/islands/maldives/1maldives-small.webp","folderName":"islands/maldives","isCurrentFolder":true},{"title":"Mauritius","image":"optimized-images/islands/mauritius/1mauritius-small.webp","folderName":"islands/mauritius","isCurrentFolder":false},{"title":"Mozambique","image":"optimized-images/islands/mozambique/1mozambique-small.webp","folderName":"islands/mozambique","isCurrentFolder":false},{"title":"Seychelles","image":"optimized-images/islands/seychelles/1seychelles-small.webp","folderName":"islands/seychelles","isCurrentFolder":false},{"title":"Zanzibar","image":"optimized-images/islands/zanzibar/1zanzibar-small.webp","folderName":"islands/zanzibar","isCurrentFolder":false}],"h1Title":"Sun Siyam Olhuveli","h2Title":"Maldives","h3Title":"Sun Siyam Olhuveli","whatWeLoveItems":["Easy-to-reach island setting","One of the best watersport centres in the Maldives","Luxury air-conditioned beach & water villas","Wellness spa, tennis courts & gym","PADI-certified dive school","2 Infinity pools, 4 restaurants & 3 bars"],"params":{"slug":["islands","maldives","sun-siyam-olhuveli"]},"level":3},"__N_SSG":true}