{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","canon":true,"lodges":"?\nOKAVANGO DELTA\nSOSSUSVLEI\nWINE ROUTE\nMALDIVES\nSEYCHELLES\nANANTARA BAZARUTO ISLAND RESORT &amp; SPA\nSKELETON COAST\nVICTORIA FALLS\nCAPE TOWN\nNGORONGORO CRATER\nSERENGETI NATIONAL PARK\nMASAI MARA\nLAKE MALAWI\nPANORAMA ROUTE\n"},"content":"<p>SOAK UP THE SCENERY</p>\n<p>When it comes to spectacular scenery, Africa has it all.  Vast plains, majestic mountains, sandy deserts &amp; turquoise oceans…And it goes without saying that a honeymoon is not complete without the opportunity to soak up the scenery.<br>One of the most important things we consider when planning a honeymoon is:  views, views &amp; more views!<br>It is quite wonderful to wake up each morning to the site of a river, ocean, waterhole or desert in front of you.  Your private deck with sala, plunge pool, deck chairs or hammock might just be the one place where you spend most of your time, so why not go big before going home?<br>We have compiled a list of Africa’s most beautiful destinations – so when you visit, make sure to pack a camera so that you can capture beauty in its purest form.</p>\n<ol>\n<li>Okavango Delta, Botswana<br>Picture this:  A pure river bursts out of wild highlands &amp; then meander lazily through an African wilderness.  Finally, it spills into a 6,000 square mile maze of lagoons, channels &amp; islands.  This is the Okavango Delta, Africa’s premier wildlife destination.  Viewing the Okavango Delta from the air (in a small plane) is quite spectacular. </li>\n<li>Sossusvlei, Namibia<br>Sossusvlei is one of Namibia’s top safari destinations.  Set at the heart of the Namib Naukluft National Park, the clean-lined, curving slopes rise to a remarkable 300m &amp; are – without a doubt – one of the most astonishing sights in the world.  The area boasts spectacular scenery &amp; the desert colours are simply amazing.  It has been said by safari enthusiasts that Sossusvlei is a photographer’s paradise!  Hot air balloon flights are a must when visiting.</li>\n<li>Wine Route, South Africa<br>Nestled between sun-kissed vineyards &amp; majestic mountains, the picturesque valleys of the Wine Route (also referred to as the Cape Winelands) are renowned for is exquisite wines, grand old estates, pretty towns &amp; award-winning restaurants.  A visit to the scenic Wine Route will leave you in awe.</li>\n<li>Maldives<br>The Maldives is comprised of 1,190 coral islands, of which 200 are inhabited &amp; only 98 are tourist resorts.  This string of idyllic islands is encircled by translucent, ever-changing waters of the Indian Ocean, offering beach-lovers the chance to discover a luxurious island retreat like no other.  As far as the eye can see, you will find a skyline of coconut palm trees, snow-white sand beaches &amp; vibrant coral reefs.   </li>\n<li>Seychelles<br>Seychelles, the combined name for 115 islands, remains one of the world’s most beautiful &amp; secluded beach destinations, offering visitors only the best in barefoot luxury.  Here, honeymooners &amp; romantics can enjoy elegant living in award-winning resorts or super stylish villas &amp; experience world-class diving &amp; snorkelling, against a backdrop of sugar-white sand &amp; crystal-clear waters.</li>\n<li>Bazaruto Archipelago, Mozambique<br>Mozambique’s remote Bazaruto Archipelago is home to some of Africa’s most beautiful &amp; unspoilt palm-fringed beaches.  Surrounded by crystal clear water, Bazaruto consists of small, private islands that offer only the best in barefoot luxury.</li>\n<li>Skeleton Coast, Namibia<br>Now a graveyard for shipwrecked sailors whose vessels fell victim to the Atlantic’s treacherous currents, shifting sandbanks &amp; thick fog, the Skeleton Coast is one of Namibia’s most remote regions, but also one that offers a ‘ship full’ of surprises.  This untouched stretch of coastline is home to spectacular scenery that includes sweeping vistas of desert, ocean &amp; sky.  </li>\n<li>Victoria Falls, Zimbabwe<br>No one has ever wondered why Victoria Falls is listed as one of the only Seven Natural Wonders of the World.  The local people call it Mosi-oa-Tunya, “The smoke that thunders,” because something magnificent happens when the river is high &amp; the spray towers in the air while water gushes down like falling thunder.  Visitors travel from all around the globe to catch a glimpse of this spectacular sighting.</li>\n<li>Cape Town, South Africa<br>Nestled between the Indian &amp; Atlantic Oceans with iconic Table Mountain as backdrop, lies one of the world’s most vibrant &amp; breathtaking cities.  Not only is this beautiful city home to Table Mountain - one of the 7 Natural Wonders of the World, but also boast spectacular white, sandy beaches &amp; lush vineyards.</li>\n<li>Ngorongoro Crater, Tanzania<br>The Ngorongoro Crater is an ancient volcanic caldera in northern Tanzania that offers some of East Africa’s easiest &amp; most rewarding game viewing.  The scenery is spectacular, predators are abundant &amp; it is not uncommon to spot the Big 5 in a single day.  Luxurious cliff-top lodges are perched right on the rim of the Ngorongoro Crater, offering some of the best views in Africa, it not the world.  </li>\n<li>Serengeti National Park, Tanzania<br>Home to the iconic Great Wildebeest Migration, the Serengeti not only offers one of the largest concentrations of wildlife in the world but is home to the coveted Big 5 – lion, leopard, elephant, buffalo &amp; rhino, &amp; delivers sensational game viewing year-round.  Tanzania’s flagship conservation area consists of vast rolling grasslands &amp; golden savannahs, offering safari-goers a sense of space, along with some of the best game viewing in Africa.</li>\n<li>Masai Mara, Kenya<br>One of the world’s greatest wildlife spectacles can be seen on the vast, open plains of the Masai Mara.  Each year between August &amp; November, the Mara is a welcomed pit stop for endless masses of wildebeest, zebra &amp; gazelle that follow the rains on their death-defying, 2,900km circular journey.  Talk about soaking up the scenery?  This will do it!</li>\n<li>Lake Malawi<br>When you stare out over the palm-fringed sandy beach with crystal-clear water, it is easy to think you are on an oceanic tropical island rather than the shores of Lake Malawi – one of the world’s largest freshwater lakes.  </li>\n<li>Panorama Route, South Africa<br>The Panorama Route is one of South Africa’s hidden gems &amp; a destination that you should not travel to without a camera!  Just a stone’s throw away from the world-renowned Kruger Park, this breathtaking region consists of dramatic landscapes as far as the eye can see.  Unspoilt mountains, majestic waterfalls &amp; interesting canyons are just some of the natural wonders you will encounter on a Panorama Route holiday.</li>\n</ol>\n","images":["optimized-images/honeymoons/6soak-up-the-scenery/1soakupthescenery-large.webp","optimized-images/honeymoons/6soak-up-the-scenery/2soakupthescenery-large.webp","optimized-images/honeymoons/6soak-up-the-scenery/3soakupthescenery-large.webp","optimized-images/honeymoons/6soak-up-the-scenery/4soakupthescenery-large.webp","optimized-images/honeymoons/6soak-up-the-scenery/5soakupthescenery-large.webp","optimized-images/honeymoons/6soak-up-the-scenery/6soakupthescenery-large.webp","optimized-images/honeymoons/6soak-up-the-scenery/7soakupthescenery-large.webp","optimized-images/honeymoons/6soak-up-the-scenery/8soakupthescenery-large.webp"],"subfolders":[{"title":"OKAVANGO DELTA","description":"Picture this: A pure river bursts out of wild highlands &amp then meanders lazily through an African wilderness. Finally, it spills into a 6,000 square mile maze of lagoons, channels &amp islands. This is the Okavango Delta, Africa’s premier wildlife destination.\nKnown as “the river that never finds the sea,” Botswana’s Okavango Delta is the largest inland delta in the world.\nThis pristine wilderness area - teeming with wildlife - is a spectacular sight that should be on everyone’s bucket list!\nThe Okavango Delta is a year-round safari destination where you can come eye-to-eye with some of Africa’s fiercest creatures.\n\nBecause it is a freshwater wetland, the Okavango Delta offers guests both land &amp water activities.\nExperience the vast open plains on open 4x4 game drive, always accompanied by a qualified ranger. Walking safaris are also available in some areas, so be prepared to leave footprints behind.\nThe real highlight of a trip to the Okavango Delta’s swamps is the mokoro trips – an activity unique to Botswana. These dug-out guided canoes will take you downstream to look for birds &amp aquatic antelope. It is great fun exploring the waterways of the Delta by honoring this local tradition.\nFinish the day with a boat cruise, while sipping on a cool sundowner &amp watch the sunset.","image":"optimized-images/default.webp","folderName":"safaris/botswana/okavango-delta","created":null},{"title":"SOSSUSVLEI","description":"Sossusvlei, nestled at the heart of Namibia's renowned Namib Naukluft National Park, is unequivocally one of Namibia's premier safari destinations. Here, the landscape unfolds with sweeping, sinuous dunes that soar to a breathtaking 300 meters, creating one of the most astonishing sights on our planet.\nThe area boasts spectacular scenery, where the desert hues paint a mesmerizing canvas. It's often hailed by safari enthusiasts as a photographer's paradise, offering a plethora of opportunities to capture its captivating beauty. \nScattered throughout this captivating landscape, you'll find luxurious lodges that provide unparalleled views of the desert's remarkable setting. It's a place where you can bask in the lap of luxury while immersing yourself in the serenity of the desert.\nSossusvlei is uniquely accessible by road, making it an ideal addition to your self-drive holiday itinerary through Namibia. Without a doubt, it's a destination that merits a top spot on your bucket list.\n\nIn Sossusvlei, the list of activities is as extensive as the desert horizon is endless.\nGuests can embark on open 4x4 game drives &amp interpretive nature walks, allowing you to connect intimately with the unique flora &amp fauna of the region. Visits to the colossal sand dunes are a must, and a highlight of your adventure awaits as you hike up the iconic Dune 45, revealing awe-inspiring views over the ocean of red Namib sand.\nFor those seeking elevated experiences, scenic hot air balloon safaris offer a bird's-eye perspective of this surreal landscape. Alternatively, you can opt for horse-back adventures, tracing the footsteps of ancient nomads through this captivating desert. As night descends, indulge in stargazing evenings, immersing yourself in the mesmerizing celestial wonders of Sossusvlei.","image":"optimized-images/default.webp","folderName":"safaris/namibia/sossusvlei","created":null},{"title":"WINE ROUTE","description":"Nestled between sun-kissed vineyards, majestic mountains &amp; picturesque valleys, the famous Wine Route in South Africa (also referred to as the Cape Winelands) is renowned for its exquisite wines, grand old estates, pretty towns &amp; award-winning restaurants.\nWithin only a 60-minute drive from vibrant Cape Town, you reach one of the most breathtaking regions in South Africa where Alpine-style views, art galleries &amp; quaint side-walk cafes are seen from almost every street.\nThe Cape Winelands generally refers to the 3 most popular wine-growing regions surrounding Cape Town: Franschhoek, Stellenbosch &amp; Paarl, each countryside setting as beautiful as the next.\nFranschhoek is South Africa’s gourmet capital, so guests here can take their pick from a wide selection of award-winning restaurants &amp; wine &amp; gastronomy experiences. The oak tree-lined streets of Stellenbosch are dotted with art galleries, quaint coffee shops, boutiques &amp; side-walk cafes while the quiet town of Paarl provides a relaxing, off-the-beaten-track Winelands experience.\nExplore the Wine Route, South Africa &amp; its variety of accommodation options that suit every type of traveller – from luxurious manor houses &amp; secluded boutique hotels to farm-style suites &amp; family-friendly villas.\n\nFoodies &amp; wine lovers should – most definitely – add the Winelands to their bucket list! But this breathtaking region offers so much more than just food &amp; wine.\nGuests can enjoy a long list of activities, including mountain biking, quad biking, hiking &amp; horse-riding. Other attractions include art galleries, museums, wellness spas &amp; shopping.\nFamilies will be spoilt for choice in the Winelands. Fun family-friendly activities include animal encounters, grape juice &amp; chocolate tastings, wine farm picnics, strawberry picking, acrobranching (treetop obstacle courses) &amp; even eco-friendly, non-motorized scooter rides through the vineyards – great fun for the whole family. Some wine farms also offer authentic outdoor farm experiences specifically designed for the little ones.","image":"optimized-images/default.webp","folderName":"cities/wine-route","created":null},{"title":"MALDIVES","description":"Sunny skies, white sandy beaches &amp; crystal clear water…It is not hard to enjoy a holiday in the Maldives. Relax, sip on a cocktail or snorkel next to your palm-fringed water villa. \nThe Maldives is comprised of 1,190 coral islands, of which 200 are inhabited &amp; only 98 are tourist resorts. This string of idyllic islands is encircled by translucent, ever-changing waters of the Indian Ocean, offering beach-lovers the chance to discover a luxurious island retreat like no other.\nAs far as the eye can see, you will find a skyline of coconut palm trees, snow-white sand beaches &amp; vibrant coral reefs. This tropical oasis also offers world-class diving &amp; snorkelling as well as a range of other water-based activities that can keep you busy for days.\nWater-lovers can spot turtles, whale sharks, reef manta rays & colossal whales while others can enjoy unforgettable luxury spa treatments in the comfort of their suite.\nThe Maldives is also well-known for its gourmet dining. Resorts offer a wide range of international dishes, including Italian, Japanese, Thai, Indian &amp; French cuisine. The country has become a hot spot for Michelin-starred chefs who are happy to show off their skills.\n\nThe must-visit islands in the Maldives are geared towards the discerning traveller who is looking for a luxurious island holiday.\nSurrounded by turquoise blue waters, most resorts offer guests 3 types of accommodation: luxury water villas, elegant beach villas or private villas. Visitors can even split their stay between a beach stay &amp; a water villa experience. \nSome villas have private plunge pools, others have outdoor showers – but all of them offer the highest standard of luxury.","image":"optimized-images/default.webp","folderName":"islands/maldives","created":null},{"title":"SEYCHELLES","description":"This beautiful island republic in the western Indian Ocean boasts 115 islands with lush tropical vegetation, postcard-perfect beaches, &amp; a wide variety of marine life.\nSeychelles, the combined name for all these islands, remains one of the world’s most beautiful &amp; secluded beach destinations, offering visitors only the best in barefoot luxury. \nHere, honeymooners &amp; romantics can enjoy elegant living in award-winning resorts or super stylish villas &amp; experience world-class diving &amp; snorkelling, against a backdrop of sugar-white sand &amp; crystal-clear waters.\nEven though the Seychelles archipelago is made up of more than a hundred islands, the vast majority of them are completely uninhabited. Most Seychellois live on one of the 3 biggest islands - Mahe, La Digue &amp; Praslin - all of which are home to luxurious resorts, stylish villas &amp; pristine beaches.\nThere are also a handful of private islands that are ideal for discerning travellers who are looking for a tranquil escape in unsurpassed luxury. The best beaches in Seychelles make it a romantic island destination where couples can enjoy private dinners, sunset cocktails &amp; relaxing spa treatments – the perfect ending to an African holiday.\n\nLuxurious resorts &amp; stylish villas are scattered throughout the Seychelles, offering guests the opportunity to live out their tropical island fantasy – in world-class luxury.\nThe resorts &amp; villas are built on the beach, offering spectacular views over the Indian Ocean &amp; white, powdery beaches. Some villas offer private pools, outdoor showers &amp; sundecks with hammocks – the ideal place to relax while watching the sun set over the picture-perfect beaches of Seychelles.","image":"optimized-images/default.webp","folderName":"islands/seychelles","created":null},{"title":"VICTORIA FALLS","description":"No one has ever wondered why the Victoria Falls is listed as one of the only Seven Natural Wonders of the World.\nThe local people call it Mosi-oa-Tunya, “The smoke that thunders,” because something magnificent happens when the river is high  &amp; the spray towers in the air while water gushes down like falling thunder.\nThe Victoria Falls is 1,708 meters wide  &amp; with an average of 550,000 cubic meters of water plummeting over the edge every minute, it is by far the largest curtain of water in the world. Visitors travel from all around the globe to catch a glimpse of this spectacular sighting.\nThe Victoria Falls is set between Zimbabwe &amp; Zambia, making it accessible to view from both sides (visa obtained upon arrival). Guests can also easily combine a Victoria Falls adventure with a safari to Hwange, Mana Pools or Botswana for a well-rounded African holiday. Inquire with us to find out all you need to know before going to Victoria Falls and the surrounding attractions, we can plan out the perfect itinerary for adventure and relaxation!\n\nVictoria Falls in Zimbabwe is also known as Africa’s adventure capital  &amp; offers something for every type of traveler. Highlights include scenic helicopter flights, sunset boat cruises on the Zambezi River  &amp; guided tours to the majestic Victoria Falls.\nAdrenaline junkies tend to fill up their days with action-packed activities such as river rafting, bungee jumping, micro-lighting  &amp; canoeing. There is also fun for the whole family. Elephant-back safaris are usually an all-time favorite amongst little adventurers.\nIf you are feeling adventurous, why not go for a swim at the edge of The Falls? (season dependent) Devil’s Pool at Livingstone Island has a good reputation &amp; never fails to impress thrill-seekers or Insta-lovers.","image":"optimized-images/default.webp","folderName":"cities/victoria-falls","created":null},{"title":"CAPE TOWN","description":"Nestled between the Indian & Atlantic Oceans with iconic Table Mountain as backdrop, lies one of the world’s most vibrant &amp; breathtaking cities. And with so much to see and do in Cape Town, we guarantee a holiday you won’t forget!\nCape Town is a multi-faceted destination that deserves to be explored by everyone – from romantics & honeymooners who will love the luxurious accommodation &amp; idyllic views to adventure lovers &amp; families looking for an action-packed holiday.\nNot only is this beautiful city home to Table Mountain - one of the 7 Natural Wonders of the World, but also boasts spectacular white, sandy beaches, luxurious accommodation &amp; world-class shopping.\nAs South Africa’s gourmet capital, visitors will be blown away by Cape Town’s wide selection of award-winning restaurants &amp; exquisite wines (easily one of our top Cape Town Travel Tips - experience the food!).\nThis cosmopolitan city is so easy to combine with other amazing destinations. A short drive away you will find the scenic Wine Route where you can sample some of South Africa’s best wines as well as the Whale Route that offers the best land-based whale watching in the world.\nThe Garden Route with its breathtaking scenery &amp; interesting coastal towns should also be added to a longer Cape Town stay.\n\nIf there were ever a city that offers a long list of cultural experiences and other activities, Cape Town takes the prize! Some of these include visits to Table Mountain, Cape Point, Boulders Beach penguin colony, the colorful Bo-Kaap, Kirstenbosch Gardens & the vibrant V&amp;A Waterfront with its boutique shops &amp; restaurants.\nBeach lovers should also make a stop at Clifton with its white, sandy beaches or the trendy Camps Bay with its cocktail bars &amp; sidewalk cafes. Other exciting activities include helicopter flights, cooking courses, township tours &amp; historical boat cruises to Robben Island.","image":"optimized-images/default.webp","folderName":"cities/cape-town","created":null},{"title":"NGORONGORO CRATER","description":"Ngorongoro Crater, situated in northern Tanzania, is an ancient volcanic caldera known for providing some of East Africa's easiest &amp most rewarding game viewing experiences.\nThis area is home to the sought-after Big 5 – lions, leopards, elephants, buffaloes, &amp rhinos. Ngorongoro Crater offers an exceptional safari adventure with its unique setting &amp a remarkable population of 30,000 animals, making it a dream destination for safari enthusiasts.\nThe landscape is nothing short of spectacular, teeming with abundant predators. It's not uncommon to spot all members of the Big 5 in a single day here.\nLuxurious lodges situated atop cliffs on the rim of Ngorongoro Crater provide some of the world's most breathtaking views. Staying near the rim also has the added perk of being first in line for the descent to the crater floor each morning, allowing you to beat the crowds.\nFor travelers seeking more budget-friendly yet equally peaceful safari accommodations, the nearby town of Karatu, about 20 km south of the crater in the lush hills of the Karatu Highlands, offers excellent options. Many lodgings here are surrounded by working coffee plantations, offering a wide range of activities, similar to those at the crater rim.\n\nNgorongoro Crater offers a wealth of activities for its visitors. Choices include open 4x4 game drives, guided walks with Maasai warriors, mountain biking, bird watching, cultural visits, hot air balloon safaris, picnics on the crater floor, &amp romantic sundowner excursions. Day trips to nearby attractions like Lake Manyara &amp Olduvai Gorge can also be arranged.","image":"optimized-images/default.webp","folderName":"safaris/tanzania/ngorongoro-crater","created":null},{"title":"SERENGETI NATIONAL PARK","description":"Home to the iconic Great Wildebeest Migration, the Serengeti boasts one of the world's largest wildlife concentrations and is the habitat of the coveted Big 5: lion, leopard, elephant, buffalo, &amp rhino. Its year-round sensational game viewing is unparalleled.\nThis flagship Tanzanian conservation area encompasses vast rolling grasslands &amp golden savannahs, providing visitors with a profound sense of space &amp some of Africa's finest game encounters. Wildlife enthusiasts flock to the Serengeti to witness nature's grand spectacle: The Great Wildebeest Migration. Every year, millions of wildebeest, zebras, &amp gazelles follow a migratory path across the Serengeti in search of greener pastures. Observing massive herds braving crocodile-infested rivers &amp eluding hungry predators like Africa's big cats is the essence of the Serengeti experience.\nThroughout the year, expect extraordinary wildlife encounters, including the exhilarating predator-prey drama of calving season (February to March).\n\nSerengeti National Park offers a wide array of wildlife-centered activities, including open 4x4 game drives, guided walks, captivating hot air balloon safaris, &amp rewarding birdwatching. Cultural visits, delightful picnic lunches, invigorating mountain biking, &amp horse riding are among the other thrilling pursuits available.","image":"optimized-images/default.webp","folderName":"safaris/tanzania/serengeti-national-park","created":null},{"title":"MASAI MARA","description":"The Masai Mara National Reserve &amp its neighboring conservancies form Kenya's flagship conservation area &amp are undoubtedly one of Africa's top safari destinations.\nThe vast, open plains of the Mara attract an abundance of wildlife, including elephants, buffalos, zebras, giraffes, hyenas, &amp the Mara's iconic big cats: lions, leopards, &amp cheetahs.\nOne of the world's greatest wildlife spectacles unfolds here each year between August &amp November. It's when the Mara becomes a vital pit stop for the endless masses of wildebeests, zebras, &amp gazelles embarking on their death-defying, 2,900-kilometer circular journey following the rains.\nBut before these resilient herds can reach the Mara's lush grazing grounds from Tanzania's Serengeti National Park, they must confront the dramatic, crocodile-infested rivers—a sight to behold in its own right.\nFor those seeking close encounters with Africa's predators and big game, staying in a private conservancy that permits off-road driving &amp night drives is essential.\n\nThe heart of the Masai Mara experience lies in open 4x4 game drives &amp walking safaris guided by Maasai warriors. These game drives take you right into the heart of the action, ensuring intimate encounters with Africa's wildlife. Expert local guides lead both morning &amp afternoon game drives.\nSome lodges also offer night drives with spotlights, allowing you to focus on elusive nocturnal animals. Another highlight is exploring the bush from a bird's-eye view in a hot air balloon. After the flight, you'll enjoy a champagne breakfast—an ideal start to a morning in the Mara.","image":"optimized-images/default.webp","folderName":"safaris/kenya/masai-mara","created":null},{"title":"LAKE MALAWI","description":"When you stare out over the palm-fringed sandy beach with crystal-clear water, it is easy to think you are on an oceanic tropical island rather than the shores of Lake Malawi – one of the world’s largest freshwater lakes.\nCovering 30,000 square km &amp taking up a large slice of Malawi, this freshwater body is home to the largest number of fish species in the world, making this an ideal destination for water sport enthusiasts.\nHere, in what people call ‘the friendliest country in Africa,’ guests can enjoy freshwater snorkelling, scuba diving, kayaking, sailing &amp fishing.\nAccommodation is mostly found around the lake’s southern &amp central regions, but even in the more visited areas, the lake remains wonderfully untouched by mass tourism. Beautiful lakeside chalets range from family-friendly beach resorts to romantic island lodges.\nLake Malawi is an ideal choice for guests who are looking for an off-the-beaten-track beach-style holiday where beautiful scenery, adventure activities &amp friendly service are of utmost importance.\n\nLake Malawi activities are mostly water-based. It has one of the most diverse ecosystems in the world with over 500 species of Cichlids. It is because of this abundant aquatic life, that Lake Malawi has some of the most diverse dive sites in the world.\nOther popular activities include snorkelling, kayaking, sailing, boating &amp fishing.","image":"optimized-images/default.webp","folderName":"safaris/malawi/lake-malawi","created":null},{"title":"PANORAMA ROUTE","description":"There’s plenty of things to do on the Panorama Route which is one of South Africa’s hidden gems & a destination that you should not travel to without a camera!\nJust a stone’s throw away from the world-renowned Kruger Park, this breathtaking region consists of dramatic landscapes as far as the eye can see. Unspoilt mountains, majestic waterfalls & interesting canyons are just some of the natural wonders and scenic spots on the Panorama Route. \nThe road conditions are easy & safe, so independent-minded self-drive guests will love exploring the Panorama Route at their own pace. Alternatively, a private guide can also take you to some of the region’s best sites, such as God’s Window, Three Rondavels viewpoint, Bourke’s Luck Potholes & Blyde River Canyon.\nThe Panorama Route’s charming little towns consists of Hazyview with its wide selection of outdoor activities, White River with its boutique shops, open-air restaurants & golf courses, Dullstroom where fly-fishing, hiking & horse-riding are at their best & Pilgrim’s Rest – the Panorama Route’s historic gold mining town set in a pretty location.\n\nThe Panorama Route offers a wide selection of activities & attractions. Scenic tours are usually first on the list, so guests can experience some of the area’s most beautiful sites, including waterfalls, canyons & quaint towns.\nElephant interactions at Hazyview’s Elephant Whispers Centre is a bucket list experience that should not be missed. Other exciting activities include zip lining, golf & game drives.","image":"optimized-images/default.webp","folderName":"cities/panorama-route","created":null}],"parentCards":[{"title":"Honeymoons","image":"optimized-images/honeymoons/1honeymoons-small.webp","folderName":"honeymoons","isCurrentFolder":true}],"h1Title":"6Soak Up The Scenery","h2Title":"Honeymoons","h3Title":"6Soak Up The Scenery","whatWeLoveItems":[],"params":{"slug":["honeymoons","6soak-up-the-scenery"]},"level":2},"__N_SSG":true}