{"pageProps":{"frontmatter":{"title":"ELLERMAN HOUSE","subtitle":"","article_title":"","canon":true},"content":"<h4>Experience</h4>\n<p>Ellerman House is an elegant villa like no other.  Set on the mountainside, overlooking Bantry Bay, this boutique hotel offers exceptional service &amp; exquisite accommodation.<br>This historical mansion has been fully restored &amp; lavishly decorated with South African art to create an opulent retreat, ideal for the discerning traveller.<br>A name famous in the Conde Nast circles, Ellerman House never fails to deliver.  Ideally located near Cape Town’s city centre, Table Mountain, Camps Bay &amp; Clifton beaches as well as the popular V&amp;A Waterfront – guests can easily explore Bantry Bay &amp; its surrounds.</p>\n<h4>Stay</h4>\n<p>Ellerman House offers 13 individually styled rooms, all tastefully decorated with the most elegant fabrics &amp; furnishings.  All rooms are equipped with under-floor heating, air-conditioning &amp; complimentary room bars.  They all boast gorgeous views of the Atlantic Ocean.<br>Ellerman House is also home to 2 private, luxurious villas – ideal for guests travelling with family, looking for seclusion &amp; privacy.<br>Each villa has a sun-drenched pool deck overlooking the ocean, a personal butler, chef &amp; staff.  One villa has 3 bedrooms &amp; the other 5 bedrooms, both equipped with separate lounge, dining room &amp; study.<br>At the main house, you will find a restaurant &amp; bar as well as a library, gym, swimming pool &amp; wellness spa.</p>\n<h4>Activities</h4>\n<p>At Ellerman House, the concierge desk is available to arrange a host of excursions, including trips to Table Mountain, The Winelands, Camps Bay &amp; Clifton beaches or Cape Point Nature Reserve.<br>Guests staying at Ellerman House can make use of their well-stocked library, fully-equipped gym &amp; luxurious spa with 3 pampering treatment rooms, a large sauna &amp; infinity pool.<br>The refined menu at Ellerman House offers mouth-watering cuisine, paired with delicious South African wines, ensuring an unforgettable culinary experience.</p>\n","images":["optimized-images/cities/cape-town/ellerman-house/1ellermanhouse-large.webp","optimized-images/cities/cape-town/ellerman-house/2ellermanhouse-large.webp","optimized-images/cities/cape-town/ellerman-house/3ellermanhouse-large.webp","optimized-images/cities/cape-town/ellerman-house/4ellermanhouse-large.webp","optimized-images/cities/cape-town/ellerman-house/5ellermanhouse-large.webp","optimized-images/cities/cape-town/ellerman-house/6ellermanhouse-large.webp","optimized-images/cities/cape-town/ellerman-house/7ellermanhouse-large.webp","optimized-images/cities/cape-town/ellerman-house/8ellermanhouse-large.webp"],"subfolders":[{"title":"21 Nettleton","description":"The exclusive &amp; luxurious 21 Nettleton is perched on the slopes of Lion’s Head peak in Cape Town &amp; offers breathtaking views of the Twelve Apostles mountain range, the deep-blue Indian Ocean &amp; the affluent Clifton neighbourhood with its 4 beautiful beaches. The boutique hotel boasts elegant grounds – including the area’s largest private gardens &amp; manicured lawns – promising a tranquil stay. The villa itself features opulent interiors that offer the perfect blend between Italian-chic &amp; African colonialism.  ","image":"optimized-images/cities/cape-town/21-nettleton/121nettleton-small.webp","folderName":"cities/cape-town/21-nettleton","created":null},{"title":"African Elite","description":"African Elite Properties provides luxury serviced accommodation in exclusive homes &amp; apartments in Cape Town’s renowned V&amp;A Waterfront &amp; De Waterkant areas.   All properties are located within walking distance of some of Cape Town’s most popular restaurants, shops &amp; nightlife.   Ideal for groups, families or couples who enjoy spacious living &amp; privacy, African Elite Properties is the perfect match.  ","image":"optimized-images/cities/cape-town/african-elite/1africanelite-small.webp","folderName":"cities/cape-town/african-elite","created":null},{"title":"Belmond Mount Nelson Hotel","description":"Everyone has heard about the Belmond Mount Nelson Hotel.  An oasis of calm within Cape Town’s beating heart, the pink hotel is set at the foot of Table Mountain &amp; takes us back to a bygone era of exquisite interiors &amp; exceptional service. The award-winning Mount Nelson has been delivering its famous blend of warm hospitality &amp; fine living for over a century.   Here guests will enjoy the best High Tea in the city, along with innovative spa treatments, 9 acres of landscaped gardens &amp; beautiful surroundings.","image":"optimized-images/cities/cape-town/belmond-mount-nelson-hotel/1belmondmountnelsonhotel-small.webp","folderName":"cities/cape-town/belmond-mount-nelson-hotel","created":null},{"title":"Bungalow 52","description":"Bungalow 52 is an exclusive beach villa that boasts one of the best locations in Cape Town – just a few steps from the fashionable Clifton 4th Beach. This tri-level 3-bedroom beach villa provides an unspoilt beach experience less than 10 steps from your front door &amp; is a short walk from some of Cape Town’s golden beaches, including the glamorous Camps Bay. Bungalow 52 guests will enjoy a home-away-from homestay with a state-of-the-art kitchen, indoor &amp; outdoor dining spaces, a heated swimming pool &amp; plenty of home entertainment.","image":"optimized-images/cities/cape-town/bungalow-52/1bungalow52-small.webp","folderName":"cities/cape-town/bungalow-52","created":null},{"title":"Camissa House","description":"With the iconic Table Mountain as a backdrop, Camissa House celebrates uninterrupted views of the city &amp; provides guests with one of the most sought-after locations in Cape Town. Sister to the award-winning Manna Bay Hotel &amp; Silvan Safari Lodge, Camissa House is a haven for boutique travellers from across the globe Here guests will be spoilt with lofty high teas, in-room spa treatments &amp; complimentary car services.  Yes, guests can use Camissa House’s cars to explore the city or drive to one of Cape Town’s award-winning restaurants.","image":"optimized-images/cities/cape-town/camissa-house/1camissahouse-small.webp","folderName":"cities/cape-town/camissa-house","created":null},{"title":"Camps Bay Retreat","description":"Camps Bay Retreat, like the name suggests, is tucked away on a private estate, a stone throw away from fashionable Camps Bay, one of Cape Town’s most spectacular beaches.   This luxurious boutique hotel offers a sanctuary for the mind &amp; body in a tranquil, forested hideaway. The retreat is located on the lower slopes of Lion’s Head &amp; boasts spectacular views of the Atlantic Ocean &amp; Table Mountain.  ","image":"optimized-images/cities/cape-town/camps-bay-retreat/1campsbayretreat-small.webp","folderName":"cities/cape-town/camps-bay-retreat","created":null},{"title":"Cape Cadogan","description":"Cape Cadogan is a modern, chic boutique hotel set in the heart of Cape Town, with Table Mountain, Devil’s Peak &amp; Lions Head as the backdrop.  This Victorian-Georgian building dates back to the 1800s, &amp; now a national monument, the interior boasts dramatic fabrics &amp; antique furniture. With a convenient location near the trendy Kloof Street, the hotel is an ideal base from which to explore Cape Town’s main tourist attractions, such as Table Mountain, Camps Bay &amp; the V&amp;A Waterfront. For guests wishing to enjoy the ‘real’ Cape Town, Cape Cadogan is simply a must.  Set in a quiet street amongst the hustle &amp; bustle of city life, it is easy to feel the heartbeat of the Mother City.","image":"optimized-images/cities/cape-town/cape-cadogan/1capecadogan-small.webp","folderName":"cities/cape-town/cape-cadogan","created":null},{"title":"Cape Grace","description":"The luxurious Cape Grace boasts an excellent location in Cape Town’s V&amp;A Waterfront, overlooking Table Mountain &amp; the harbour.   This 5-star hotel is a gracious sanctuary of sophistication &amp; contemporary comfort. Loyalty to guests is paramount at Cape Grace.  This is reflected in the luxurious spaciousness of guests’ rooms as well as the diverse spectrum of amenities &amp; world-class service, ensuring an unforgettable stay.","image":"optimized-images/cities/cape-town/cape-grace/1capegrace-small.webp","folderName":"cities/cape-town/cape-grace","created":null},{"title":"Cape View Clifton","description":"Cape View Clifton is a secluded haven near the fashionable Clifton &amp; Camps Bay beaches, offering sensational views of the mountain &amp; ocean. Centrally located within minutes of the city of Cape Town, the boutique hotel provides convenient access to many of the spectacular sights of the area – the Twelve Apostles, Lion’s Head, Signal Hill, Table Mountain, Kirstenbosch Gardens &amp; Clifton’s very own Blue Flag beaches. Camps Bay’s shops, sidewalk cafes, restaurants &amp; nightlife are only a stone throw away.","image":"optimized-images/cities/cape-town/cape-view-clifton/1capeviewclifton-small.webp","folderName":"cities/cape-town/cape-view-clifton","created":null},{"title":"Cloud Nine Boutique Hotel","description":"With Table Mountain as the backdrop &amp; trendy Kloof Street with its restaurants, bars, boutiques &amp; cafes only a stone throw away, Cloud Nine Boutique Hotel offers a relaxed &amp; vibrant experience in one of the most exciting cities in the world. From its rooftop bar &amp; splash pool, sensational views of Table Mountain can be enjoyed, so after a day of city exploration, guests can watch the sunset while sipping on a delicious cocktail. Service is important at Cloud Nine.  Not only will friendly staff look after your daily needs &amp; requirements, but renowned breakfasts have become a well-known tradition here, supplying a buffet feast or a full English breakfast.","image":"optimized-images/cities/cape-town/cloud-nine-boutique-hotel/1cloudnineboutiquehotel-small.webp","folderName":"cities/cape-town/cloud-nine-boutique-hotel","created":null},{"title":"Compass House","description":"The five-star boutique hotel, Compass House enjoys a spectacular setting in trendy Bantry Bay &amp; boasts sensational views of the ocean from every room of the house. Cape Town’s city centre is only a 10-minute drive away, so guests will have the added benefit of a 5-star beach experience that is away from the hustle &amp; bustle of city life, yet close enough to many award-winning restaurants, boutique shops &amp; top attractions. The Atlantic Seaboard is one of the most beautiful &amp; coveted areas of Cape Town.  Not only does it offer stunning views &amp; easy beach access, but its sheltered location is a big drawcard for couples or families who want to enjoy the best of the city &amp; beach life.","image":"optimized-images/cities/cape-town/compass-house/1compasshouse-small.webp","folderName":"cities/cape-town/compass-house","created":null},{"title":"Dock House","description":"With a prime location in the heart of Cape Town’s V&amp;A Waterfont, Dock House provides the perfect base from which to explore the city – while still maintaining the highest level of luxury &amp; service. Originally the Harbor Master’s 1800’s home, Dock House combines classic Victorian architecture with contemporary style.  The boutique offers only 6 suites &amp; 24-hour butler service, both adding to the intimate &amp; personal atmosphere. Within walking distance, you will find some of Cape Town’s best restaurants, boutique shops &amp; cafes – as well as the harbour with its many yachts &amp; boats.  With Table Mountain as the backdrop, guests will be right at the centre of all Cape Town’s top attractions.","image":"optimized-images/cities/cape-town/dock-house/1dockhouse-small.webp","folderName":"cities/cape-town/dock-house","created":null},{"title":"Ellerman House","description":"Ellerman House is an elegant villa like no other.  Set on the mountainside, overlooking Bantry Bay, this boutique hotel offers exceptional service &amp; exquisite accommodation.   This historical mansion has been fully restored &amp; lavishly decorated with South African art to create an opulent retreat, ideal for the discerning traveller. A name famous in the Conde Nast circles, Ellerman House never fails to deliver.  Ideally located near Cape Town’s city centre, Table Mountain, Camps Bay &amp; Clifton beaches as well as the popular V&amp;A Waterfront – guests can easily explore Bantry Bay &amp; its surrounds.","image":"optimized-images/cities/cape-town/ellerman-house/1ellermanhouse-small.webp","folderName":"cities/cape-town/ellerman-house","created":null},{"title":"Gorgeous George Boutique Hotel","description":"Gorgeous George Boutique Hotel is set in a beautifully restored historic building in the heart of Cape Town’s city centre &amp; offers a range of cosy studios &amp; larger suites to the sleek urban traveller.   The hotel offers the perfect blend between art, innovative design &amp; fine cuisine.  Within walking distance, you will find important landmarks such as Greenmarket Square &amp; the Company Gardens.  Camps Bay &amp; the V&amp;A Waterfront are a short drive away. The hotel’s coolest feature is their rooftop restaurant with pool, bar &amp; comfortable lounging area.  From here, guests can enjoy some of the finest food in Cape Town, along with delicious cocktails &amp; sensational views over the city below.","image":"optimized-images/cities/cape-town/gorgeous-george-boutique-hotel/1gorgeousgeorgeboutiquehotel-small.webp","folderName":"cities/cape-town/gorgeous-george-boutique-hotel","created":null},{"title":"Kensington Place","description":"Kensington Place is located within a quiet street high on the slopes of Table Mountain.  This intimate boutique hotel oozes luxury, elegance &amp; outstanding attention to detail.   Management will ensure that guests are not only looked after but receive exceptional service throughout their stay. Idyllic for honeymooners, couples, or guests who require personalized service &amp; intimacy, Kensington Place is a short drive away from all of Cape Town’s tourist sites, including Table Mountain, the V&amp;A Waterfront &amp; Camps Bay beach.","image":"optimized-images/cities/cape-town/kensington-place/1kensingtonplace-small.webp","folderName":"cities/cape-town/kensington-place","created":null},{"title":"Manna Bay","description":"Ever dreamt of experiencing luxury boutique living at its best?  Look no further because Manna Bay will exceed your expectations from beginning to end! Located in the heart of Cape Town – quite literally adjacent to Table Mountain – guests will be blown away by the ideal setting of being so close to one of the world’s greatest landmarks.  A gate leads directly from Manna Bay’s grounds to the spectacular Table Mountain National Park.  You can’t get much closer than this! Jaw-dropping views await you at the Manna Bay Café &amp; Atlas Rooftop Bar where delicious cocktails are served while the sun is setting over the horizon.","image":"optimized-images/cities/cape-town/manna-bay/1mannabay-small.webp","folderName":"cities/cape-town/manna-bay","created":null},{"title":"More Quarters","description":"More Quarters offers their guests exactly that….More.   More space, more luxury &amp; more personal service. Operating exactly like a hotel, guests will still enjoy the benefits of a hotel – including concierge, breakfast, daily cleaning &amp; personal attention, while enjoying extra comforts like space &amp; privacy. More Quarters is ideal for families, groups or couples interested in a little bit more.  Guests will be able to choose between one &amp; two-bedroom apartments as well as a three-bedroom villa, all set within a quiet haven close to the trendy Kloof Street.","image":"optimized-images/cities/cape-town/more-quarters/1morequarters-small.webp","folderName":"cities/cape-town/more-quarters","created":null},{"title":"Morukuru Beach Lodge","description":"Morukuru Beach Lodge is perched above the sun-bleached dunes of De Hoop Nature Reserve, offering sensational views over the unspoilt Indian Ocean coastline that plays host to migrating southern right whales between July &amp; November each year. During whale season, hundreds arrive to feed, breed &amp; give birth &amp; guests can easily see these amazing creatures from the comfort of land. This tranquil sanctuary is one of South Africa’s most unique &amp; off-the-beaten-track wildlife destinations &amp; attracts visitors who would like to extend their Cape Town stay.","image":"optimized-images/cities/cape-town/morukuru-beach-lodge/1morukurubeachlodge-small.webp","folderName":"cities/cape-town/morukuru-beach-lodge","created":null},{"title":"Nox Apartments & Villas","description":"Nox Apartments &amp; Villas provides luxury serviced accommodation in exclusive homes &amp; villas in one of Cape Town’s most sought-after areas:   The beautiful Atlantic Seaboard.   All properties are located near Cape Town’s best beaches or attractions, including Clifton, Camps Bay, Bantry Bay as well as the V&amp;A Waterfront, De Waterkant &amp; Cape Town City Bowl. Ideal for groups, families or couples who enjoy spacious living &amp; privacy, Nox Apartments &amp; Villas is the perfect match.  ","image":"optimized-images/cities/cape-town/nox-apartments-villas/1noxapartments-villas-small.webp","folderName":"cities/cape-town/nox-apartments-villas","created":null},{"title":"O On Kloof Boutique Hotel","description":"O on Kloof is set within the exclusive residential Atlantic Seaboard neighbourhood of Bantry Bay - quite central to Cape Town’s premier beaches &amp; top attractions like Table Mountain &amp; the V&amp;A Waterfront. One of Tatler’s Top 101 Hotels in the World &amp; awarded TripAdvisor’s Travelers Choice Award in 2021, O on Kloof delivers exceptional service, stylish décor &amp; sophisticated ambience. Couples &amp; honeymooners are particularly drawn to O on Kloof since they offer a range of romantic on-site facilities, like an indoor pool, a wellness spa, an exclusive gym &amp; a cocktail bar.  ","image":"optimized-images/cities/cape-town/o-on-kloof-boutique-hotel/1oonkloofboutiquehotel-small.webp","folderName":"cities/cape-town/o-on-kloof-boutique-hotel","created":null},{"title":"One & Only Cape Town","description":"Everyone is familiar with the One &amp; Only.  One of the city’s best hotels, One &amp; Only Cape Town is located within the heart of the famous V&amp;A Waterfront &amp; offers sophisticated flair close to the city’s top attractions. Table Mountain provides a spectacular natural backdrop &amp; on your doorstep, you will find world-class shopping, award-winning restaurants &amp; the beautiful V&amp;A harbour with its stylish yachts &amp; colourful fishing boats. One &amp; Only guests will enjoy the perks of their award-winning spa that offers a range of innovative treatments &amp; also experience one of the best culinary feasts in Cape Town from their 2 on-site restaurants.","image":"optimized-images/cities/cape-town/one-only-cape-town/1one-onlycapetown-small.webp","folderName":"cities/cape-town/one-only-cape-town","created":null},{"title":"POD Boutique Hotel","description":"The chic &amp; stylish POD Boutique Hotel boasts a spectacular setting a few steps from the beach along Camps Bay’s strip with its trendy restaurants, cafes &amp; bars. This Soho-style beach house offers clean lines, infinity pools &amp; huge sliding doors to invite the beach &amp; mountain in.   Only a few steps away from the beach, POD Boutique Hotel is the ideal base to explore the hustle &amp; bustle of the vibrant city from a more relaxing point of view.  ","image":"optimized-images/cities/cape-town/pod-boutique-hotel/1podboutiquehotel-small.webp","folderName":"cities/cape-town/pod-boutique-hotel","created":null},{"title":"Queen Victoria Hotel","description":"The sophisticated Queen Victoria Hotel is situated within a precinct of heritage buildings along the main road leading to Cape Town’s V&amp;A Waterfront. Offering the perfect base from which to explore the city, the hotel is within walking distance to the V&amp;A Waterfront’s top attractions as well as a host of fine dining restaurants, art galleries &amp; boutiques. What makes the hotel so special, is that while it enjoys a prime location in the heart of vibrant Cape Town, it is a little removed from the main crowds, so after a day of city exploration, guests can return to a quiet slice of paradise in the middle of the hustle &amp; bustle.","image":"optimized-images/cities/cape-town/queen-victoria-hotel/1queenvictoriahotel-small.webp","folderName":"cities/cape-town/queen-victoria-hotel","created":null},{"title":"Radisson Blu Hotel Waterfront","description":"At the edge of the Atlantic Ocean, overlooking a private marina, you will find Radisson Blu Hotel Waterfront.   Offering an ideal base from which to explore vibrant Cape Town, the hotel is situated just a short walk away from the V&amp;A Waterfront with its many cafes, restaurants &amp; boutiques. Capetonians will know that Tobago’s Bar &amp; Terrace has become one of the best sunset spots in the city.  Here views extend out past Robben Island, so guests are invited to enjoy this ocean-front haven with a cocktail in hand.","image":"optimized-images/cities/cape-town/radisson-blu-hotel-waterfront/1radissonbluhotelwaterfront-small.webp","folderName":"cities/cape-town/radisson-blu-hotel-waterfront","created":null},{"title":"Rovos Rail","description":"Rovos Rail offers a luxury train holiday like no other.   Apart from owning &amp; operating the most luxurious trains in the world, Rovos Rail offers guests a variety of train journeys - each ranging from 2 nights to 2 weeks. Short train trips include travelling from Cape Town to Pretoria or north to the majestic Victoria Falls in Zimbabwe.  The longest &amp; most famous route is an epic rail journey that starts in Cape Town &amp; passes through some of Africa’s most magnificent scenery to Dar es Salaam.","image":"optimized-images/cities/cape-town/rovos-rail/1rovosrail-small.webp","folderName":"cities/cape-town/rovos-rail","created":null},{"title":"Table Bay Hotel","description":"The stylish Table Bay Hotel enjoys a prime location within Cape Town’s picturesque working harbour &amp; offers guests direct access to the V&amp;A Waterfront with its trendy boutiques, cafes &amp; restaurants. The hotel has a nautical feel that is similar to some of the great cruise liners &amp; grand hotels around the world.   With Table Mountain as the backdrop &amp; the harbour on your doorstep, it is quite wonderful to observe ships come &amp; go from the front of the hotel. ","image":"optimized-images/cities/cape-town/table-bay-hotel/1tablebayhotel-small.webp","folderName":"cities/cape-town/table-bay-hotel","created":null},{"title":"Taj Cape Town","description":"The impeccably restored Taj Cape Town pays tribute to its former glory as the South African Reserve Bank &amp; other historic buildings that were constructed in the 1890s. Located in the centre of the old city, guests are within walking distance to the Company Gardens, St George’s Cathedral &amp; Greenmarket Square as well as an eclectic array of restaurants, shops &amp; galleries. A short drive away, you will find the V&amp;A Waterfront, the iconic Table Mountain &amp; Cape Town’s most renowned beaches: Clifton &amp; Camps Bay.","image":"optimized-images/cities/cape-town/taj-cape-town/1tajcapetown-small.webp","folderName":"cities/cape-town/taj-cape-town","created":null},{"title":"The Bay Hotel","description":"The Bay Hotel is situated on the trendy Victoria Road in one of Cape Town’s most prestigious beach towns, Camps Bay.   Located at the foot of the majestic Twelve Apostles mountain range, with views of the Atlantic Ocean, the hotel enjoys a beautiful backdrop &amp; is a mere stone’s throw from the beach. On your doorstep, you will find a palm-fringed white, sandy beach lined with slick restaurants &amp; trendy cocktail bars where most evenings are spent while watching the sunset.","image":"optimized-images/cities/cape-town/the-bay-hotel/1thebayhotel-small.webp","folderName":"cities/cape-town/the-bay-hotel","created":null},{"title":"The Cape Milner","description":"Set at the foot of Cape Town’s iconic Table Mountain, The Cape Milner is a slick boutique hotel that offers guests an ideal base from which to explore South Africa’s most beautiful city. Attractions such as the V&amp;A Waterfront, Company’s Gardens &amp; Table Mountain Cableway are all mere minutes away.  With the mountain on your doorstep, guests can take an adventurous cable car ride up the mountain, hike to its peak or get a bird’s eye view from a helicopter. The hotel also offers guests a complimentary shuttle between the city centre &amp; the V&amp;A Waterfront – a convenient cherry-on-top to any holiday.","image":"optimized-images/cities/cape-town/the-cape-milner/1thecapemilner-small.webp","folderName":"cities/cape-town/the-cape-milner","created":null},{"title":"The Clarendon Bantry Bay","description":"At the foot of Lion’s Head in a secluded, ocean-facing enclave of Bantry Bay, lies an elegant boutique hotel that offers only the best in barefoot city luxury:  The Clarendon Bantry Bay. Ideal for discerning travellers, this quiet retreat is just minutes away from the popular V&amp;A Waterfront with its stylish cafes, restaurants &amp; shops while Cape Town’s most beautiful beaches – Clifton &amp; Camps Bay – are only a stone’s throw away. The boutique hotel offers breathtaking views over the Atlantic Ocean &amp; is sheltered from the summer winds, making this a wonderful choice for guests who want a little seclusion &amp; tranquillity after a busy day or city exploration.","image":"optimized-images/cities/cape-town/the-clarendon-bantry-bay/1theclarendonbantrybay-small.webp","folderName":"cities/cape-town/the-clarendon-bantry-bay","created":null},{"title":"The Last Word Constantia","description":"Constantia is the Cape’s oldest wine-producing region &amp; one of Cape Town’s most beautiful suburbs.  It is here, amid elegant vineyards that you will find The Last Word Constantia – an intimate boutique hotel that offers only the best in city luxury. The Last Word Constantia not only offers an in-house chauffeur service &amp; elegant rooms, but its fantastic location near award-winning wine estates is a big drawcard for discerning travellers from around the globe. Accommodation comprises 9 spacious en-suite rooms consisting of 2 elegant suites, 2 pool suites, 1 family suite &amp; 4 superior suites.","image":"optimized-images/cities/cape-town/the-last-word-constantia/1thelastwordconstantia-small.webp","folderName":"cities/cape-town/the-last-word-constantia","created":null},{"title":"The Last Word Long Beach","description":"With an unbeatable location on a long stretch of white, sandy beach in the picturesque seaside village of Kommetjie, The Last Word Long Beach will quite literally take your breath away. Not only will you see a spectacularly beautiful beach right on your doorstep, but guests can walk straight from their elegant suite onto the unspoilt dunes of Long Beach. This small &amp; intimate luxury boutique hotel is available on an individual daily-room basis or as an entire villa to share with your family or friends.","image":"optimized-images/cities/cape-town/the-last-word-long-beach/1thelastwordlongbeach-small.webp","folderName":"cities/cape-town/the-last-word-long-beach","created":null},{"title":"The Marly Boutique Hotel","description":"Situated in the beautiful Camps Bay – Cape Town’s most sought-after &amp; neighbourhood – The Marly is a boutique hotel that provides only the best in barefoot beach luxury. The Marly offers some of the most jaw-dropping views in the area!  Not only will guests be able to enjoy uninterrupted ocean &amp; mountain views from the swimming pool, the 80-seater bar &amp; the sun terrace – but also every suite. Overlooking the trendy Camps Bay beach with its cafes, restaurants &amp; bars, makes this an ideal choice for the discerning traveller who wants to enjoy a relaxed beach holiday, but still be close enough to some of Cape Town’s top attractions.","image":"optimized-images/cities/cape-town/the-marly-boutique-hotel/1themarlyboutiquehotel-small.webp","folderName":"cities/cape-town/the-marly-boutique-hotel","created":null},{"title":"The One Above","description":"Welcome to Cape Town’s most sophisticated penthouse.  The One Above’s location cannot be closer to perfect – atop the One &amp; Only Cape Town, with unobstructed views of Table Mountain, Robben Island, Devil’s Peak, Lion’s Head, the Cape Town Harbor &amp; the V&amp;A Waterfront. The One Above offers everything you could wish for – from a private butler &amp; chef team, a wrap-around entertainment deck with 2 swimming pools to an exquisite wine loft with 280 vintages.  The penthouse also has a private gym &amp; sauna. The One Above is the ideal choice for discerning travellers who understand &amp; appreciate luxury &amp; attention to detail.  It is perfect for business or pleasure, for families of all ages or friends travelling together.  A private butler &amp; chef team will take care of your every need.","image":"optimized-images/cities/cape-town/the-one-above/1theoneabove-small.webp","folderName":"cities/cape-town/the-one-above","created":null},{"title":"The Silo","description":"Architectural imagination turned what was once the elevator portion of a historic grain silo complex into one of Cape Town’s most magnificent luxury hotels.   The Silo sits above the Zeitz Museum of Contemporary Art Africa, which aims to have the largest collection of modern African art in the world &amp; hotel guests will have direct access to this artistic slice of paradise.  The V&amp;A Waterfront with its boutique shops, cafes &amp; restaurants is within walking distance. The hotel is constructed from glass panels &amp; steel &amp; at night, is transformed into a glowing beacon in the working harbour.","image":"optimized-images/cities/cape-town/the-silo/1thesilo-small.webp","folderName":"cities/cape-town/the-silo","created":null},{"title":"The Spa House","description":"The Spa House is an exclusive private villa set in leafy Hout Bay of the Cape Peninsula’s Atlantic seaboard. This award-winning villa with avant-garde eco-design offers the perfect blend between marble, glass &amp; timber to maximize its captivating mountain &amp; forest views. It is the ultimate mountainside retreat with a picture-perfect setting.  Located only a 20-minute drive from the glittering lights of Cape Town, The Spa House offers a secluded haven away from the hustle &amp; bustle of city life – yet still close enough to explore Table Mountain, the V&amp;A Waterfront or one of Cape Town’s blue flag beaches.  ","image":"optimized-images/cities/cape-town/the-spa-house/1thespahouse-small.webp","folderName":"cities/cape-town/the-spa-house","created":null},{"title":"Tintswalo Atlantic","description":"Perched above the Atlantic Ocean at the base of Chapman’s Peak, Tintswalo Atlantic offers a luxurious beachfront retreat with uninterrupted ocean views.   Set just outside Cape Town, the lodge is built in a secluded cranny, offering romantics &amp; honeymooners a true ocean paradise. Located only 20 minutes from Cape Town’s city centre, this boutique hotel is the perfect base from which to explore the city, as well as Camps Bay, Clifton &amp; Llandudno beaches.  ","image":"optimized-images/cities/cape-town/tintswalo-atlantic/1tintswaloatlantic-small.webp","folderName":"cities/cape-town/tintswalo-atlantic","created":null},{"title":"Twelve Apostles Hotel & Spa","description":"Perched high on the slopes of Table Mountain, you will find one of Cape Town’s most prestigious retreats, the Twelve Apostles Hotel &amp; Spa.  With uninterrupted views of the sparkling Atlantic Ocean, it is no wonder that guests travel from around the world to come &amp; unwind here. Surrounded by hectares of indigenous fynbos &amp; the Twelve Apostles mountain range, the hotel is ideal for honeymooners &amp; discerning couples who want to get away from the hustle &amp; bustle of the city, while still being close enough to explore the major sites.   Apart from their prestigious spa, one of the highlights for guests is nature trails &amp; picnic spots that lie behind the hotel &amp; the exclusive-use gazebos that are perfect for sunset massages.","image":"optimized-images/cities/cape-town/twelve-apostles-hotel-spa/1twelveapostleshotel-spa-small.webp","folderName":"cities/cape-town/twelve-apostles-hotel-spa","created":null},{"title":"Victoria & Alfred Hotel","description":"A better location is hard to find.  The Victoria &amp; Alfred Hotel is set in Cape Town’s ever-popular V&amp;A Waterfront.  Named after this area, The Victoria &amp; Alfred Hotel enjoys beautiful views of Cape Town’s most iconic sight, Table Mountain &amp; the marina. Right on your doorstep, you will find a variety of Cape Town’s top restaurants, cafes &amp; boutiques – a true shopper’s delight.  The hotel boasts a safe &amp; central location, offering guests the opportunity to explore the area on foot as most of Cape Town’s popular sights are within walking distance. The Victoria &amp; Alfred Hotel has a variety of room types to choose from.  Piazza-facing rooms enjoy tranquil views over the hotel’s piazza.  Mountain-facing rooms boast marvellous views over majestic Table Mountain &amp; sophisticated lofts are located on the third floor – all stylishly decorated with a splash of elegance.","image":"optimized-images/cities/cape-town/victoria-alfred-hotel/1victoria-alfredhotel-small.webp","folderName":"cities/cape-town/victoria-alfred-hotel","created":null}],"parentCards":[{"title":"Arusha","image":"optimized-images/cities/arusha/1arusha-small.webp","folderName":"cities/arusha","isCurrentFolder":false},{"title":"Cape Town","image":"optimized-images/cities/cape-town/1capetown-small.webp","folderName":"cities/cape-town","isCurrentFolder":true},{"title":"Durban","image":"optimized-images/cities/durban/1durban-small.webp","folderName":"cities/durban","isCurrentFolder":false},{"title":"Entebbe & Kampala","image":"optimized-images/cities/entebbe-kampala/1entebbe-kampala-small.webp","folderName":"cities/entebbe-kampala","isCurrentFolder":false},{"title":"Garden Route","image":"optimized-images/cities/garden-route/1gardenroute-small.webp","folderName":"cities/garden-route","isCurrentFolder":false},{"title":"Johannesburg","image":"optimized-images/cities/johannesburg/1johannesburg-small.webp","folderName":"cities/johannesburg","isCurrentFolder":false},{"title":"Kigali","image":"optimized-images/cities/kigali/1kigali-small.webp","folderName":"cities/kigali","isCurrentFolder":false},{"title":"Lilongwe","image":"optimized-images/cities/lilongwe/1lilongwe-small.webp","folderName":"cities/lilongwe","isCurrentFolder":false},{"title":"Livingstone","image":"optimized-images/cities/livingstone/1livingstone-small.webp","folderName":"cities/livingstone","isCurrentFolder":false},{"title":"Nairobi","image":"optimized-images/cities/nairobi/1nairobi-small.webp","folderName":"cities/nairobi","isCurrentFolder":false},{"title":"Panorama Route","image":"optimized-images/cities/panorama-route/1panoramaroute-small.webp","folderName":"cities/panorama-route","isCurrentFolder":false},{"title":"Victoria Falls","image":"optimized-images/cities/victoria-falls/1victoriafalls-small.webp","folderName":"cities/victoria-falls","isCurrentFolder":false},{"title":"Whale Route","image":"optimized-images/cities/whale-route/1whaleroute-small.webp","folderName":"cities/whale-route","isCurrentFolder":false},{"title":"Windhoek","image":"optimized-images/cities/windhoek/1windhoek-small.webp","folderName":"cities/windhoek","isCurrentFolder":false},{"title":"Wine Route","image":"optimized-images/cities/wine-route/1wineroute-small.webp","folderName":"cities/wine-route","isCurrentFolder":false}],"h1Title":"Ellerman House","h2Title":"Cape Town","h3Title":"Ellerman House","whatWeLoveItems":["Sensational views of Bantry Bay","A regular feature on Conde Nast’s Gold List","Prestigious mansion with an all-inclusive rate","World-class cuisine & wines","Private & exclusive service","A short drive from top attractions"],"params":{"slug":["cities","cape-town","ellerman-house"]},"level":3},"__N_SSG":true}