{"pageProps":{"frontmatter":{"title":"SHAWA LUANGWA CAMP","subtitle":"","article_title":"","canon":true},"content":"<h4>Experience</h4>\n<p>Named after Wanderlust’s top 8 best professional guides, Jacob Shawa, Shawa Luangwa Camp overlooks the beautiful Luangwa River &amp; was handpicked by Jacob Shawa as the ideal safari spot to explore one the park’s most untouched areas.<br>South Luangwa National Park is part of the Luangwa Valley – a complex ecosystem that consists of dramatic seasonal changes, lush vegetation &amp; prolific wildlife – the perfect recipe for guests to fall in love with the Zambian wilderness.<br>As the birthplace of the walking safari, guests will be happy to know that they can go on exhilarating walking safaris with Jacob Shawa himself – one of the best guides in Africa.<br>The area is not only a renowned predator playground but is also home to large herds of elephants &amp; buffaloes as well as a sizeable leopard population.</p>\n<h4>Stay</h4>\n<p>Shawa Luangwa Camp boasts 5 elegant safari tents, set on the banks of the Luangwa River.  All tents are raised above the ground on wooden stilts, which lessons their impact on the environment.<br>Each safari tent opens entirely on 3 sides to offer uninterrupted 270-degree views over the Luangwa River &amp; beyond.  Two of the 5 tents can convert into a spacious family tent.<br>The main area includes a dining area &amp; sparkling swimming pool where relaxing afternoons can be spent.</p>\n<h4>Activities</h4>\n<p>With a strong focus on the environment, electric Land Cruisers are powered by Zambia’s abundant sunshine to traverse the area quietly, lightly &amp; with minimal carbon footprint.<br>Other activities include exciting boating safaris on the river &amp; guided walking safaris with some of the best guides in Africa.</p>\n","images":["optimized-images/safaris/zambia/south-luangwa-national-park/shawa-luangwa-camp/1shawacamp-large.webp","optimized-images/safaris/zambia/south-luangwa-national-park/shawa-luangwa-camp/2shawacamp-large.webp","optimized-images/safaris/zambia/south-luangwa-national-park/shawa-luangwa-camp/3shawacamp-large.webp","optimized-images/safaris/zambia/south-luangwa-national-park/shawa-luangwa-camp/4shawacamp-large.webp","optimized-images/safaris/zambia/south-luangwa-national-park/shawa-luangwa-camp/5shawacamp-large.webp","optimized-images/safaris/zambia/south-luangwa-national-park/shawa-luangwa-camp/6shawacamp-large.webp","optimized-images/safaris/zambia/south-luangwa-national-park/shawa-luangwa-camp/7shawacamp-large.webp","optimized-images/safaris/zambia/south-luangwa-national-park/shawa-luangwa-camp/8shawacamp-large.webp"],"subfolders":[{"title":"Bilimungwe Bushcamp","description":"Bilimungwe Bushcamp enjoys an ideal location in the wild &amp; unspoilt region of Zambia’s South Luangwa National Park. This intimate &amp; remote safari camp boasts an ideal setting on the shaded banks of the Luangwa River, with views over the wildlife-packed grassy floodplains – a nature lover’s paradise! Travellers looking for an off-the-beaten-track safari experience will love Bilimungwe with its beautiful reed &amp; thatch chalets – the perfect blend between rustic &amp; luxury.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/bilimungwe-bushcamp/1bilimungwebushcamp-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/bilimungwe-bushcamp","created":null},{"title":"Chamilandu Bushcamp","description":"Chamilandu Bushcamp enjoys an ideal location in the wild &amp; unspoilt region of Zambia’s South Luangwa National Park. This intimate &amp; remote safari camp boasts an ideal setting on the shaded banks of the Luangwa River, with views over the wildlife-packed grassy floodplains – a nature lover’s paradise! Travellers looking for an off-the-beaten-track safari experience will love Chamilandu with its beautiful tree-house chalets – the perfect blend between rustic &amp; luxury.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/chamilandu-bushcamp/1chamilandubushcamp-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/chamilandu-bushcamp","created":null},{"title":"Chichele Presidential Lodge","description":"Chichele Presidential Lodge - as the name suggests – is the former home of the Zambian President &amp; sits on a hill with panoramic views over the river &amp; South Luangwa valley. South Luangwa National Park - one of Zambia’s premier wildlife destinations - &amp; is home to a variety of wildlife - including lion, elephant, leopard, wild dog, giraffe &amp; wildebeest. Not only will guests enjoy top-notch game viewing, but elegant suites, air-conditioning &amp; breathtaking views await them at this opulent bush lodge.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/chichele-presidential-lodge/1chichelepresidentiallodge-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/chichele-presidential-lodge","created":null},{"title":"Chikoko Tree Camp","description":"The secluded &amp; seasonally operated Chikoko Tree Camp is situated on the banks of the Luangwa River, deep in the heart of South Luangwa’s northern region. There are no roads leading to Chikoko, allowing guests a true off-the-beaten-track wilderness experience.  The camp is ideal for adventure-lovers looking for a little bit of “rustic” Africa. Home to a vast number of animals &amp; over 400 bird species, South Luangwa will not disappoint.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/chikoko-tree-camp/1chikokotreecamp-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/chikoko-tree-camp","created":null},{"title":"Chikunto Safari Lodge","description":"Chikunto Safari Lodge enjoys a fantastic location amongst rolling plains, plateaus, riverbanks &amp; miombo vegetation in Zambia’s South Luangwa National Park. The lodge is renowned for its surviving wildlife species, providing breathtaking scenery &amp; game viewing right from its sweeping terrace! Because the lodge &amp; tents are built on raised platforms, breathtaking vistas can be enjoyed from the viewing decks.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/chikunto-safari-lodge/1chikuntosafarilodge-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/chikunto-safari-lodge","created":null},{"title":"Chindeni Bushcamp","description":"Chindeni Bushcamp is situated deep within the wildlife-rich South Luangwa National Park Zambia &amp; offers guests an authentic safari experience. This intimate &amp; remote safari camp boasts an ideal setting on the meandering Luangwa River, with views over a wildlife-packed lagoon where hippo, puku &amp; other wildlife, like large herds of elephants, can be frequently spotted. Travellers looking for an off-the-beaten-track luxury safari experience will love Chindeni with its beautiful thatch chalets – the perfect blend between traditional safari &amp; modern living.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/chindeni-bushcamp/1chindenibushcamp-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/chindeni-bushcamp","created":null},{"title":"Flatdogs Camp","description":"Flatdogs Camp is unique in every way!  Situated on the border of the South Luangwa National Park, one of the last great wildlife wonders of the world, the camp has been visited by wildlife enthusiasts since its creation in 1972. What makes the camp so unique, is that it caters for absolutely everyone!  Not only is the wildlife viewing in this part of Zambia spectacular, but they also offer a wide range of accommodation options to suit all budgets &amp; tastes. At Flatdogs, you will find 6 safari tents (including 1 family tent), 6 chalets &amp; 2 private houses. ","image":"optimized-images/safaris/zambia/south-luangwa-national-park/flatdogs-camp/1flatdogscamp-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/flatdogs-camp","created":null},{"title":"Island Bush Camp","description":"Island Bush Camp boasts a spectacular location in a very remote, yet extremely game-rich area in the southern section of Zambia’s South Luangwa National Park. Far away from crowds in a pristine wilderness environment, this seasonal camp is only open during the best wildlife months between May &amp; November. With breathtaking views over the Luangwa River, Island Bush Camp offers authentic walking safaris with expert guides.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/island-bush-camp/1islandbushcamp-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/island-bush-camp","created":null},{"title":"Kafunta River Lodge","description":"The classic Kafunta River Lodge boasts a spectacular location at the edge of a floodplain overlooking the Luangwa River in Zambia’s premier wildlife park:  South Luangwa. The Luangwa River is - without a doubt- one of the best wildlife viewing areas in the iconic South Luangwa National Park. Kafunta River Lodge is a luxury lodge with a relaxed atmosphere, offering guests service with great attention to detail.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/kafunta-river-lodge/1kafuntariverlodge-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/kafunta-river-lodge","created":null},{"title":"Kaingo Camp","description":"Kaingo Camp is nestled amongst shady trees on the banks of the beautiful Luangwa River &amp; one of the few owner-run camps in South Luangwa National Park. This camp, with its friendly atmosphere &amp; top-notch guiding, is perfect for wildlife enthusiasts of every calibre as well as families looking for a laid-back Zambian holiday. Delivering amazing big game encounters even after your safari activity has ended, Kaingo has a few photographic hides set in prolific locations.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/kaingo-camp/1kaingocamp-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/kaingo-camp","created":null},{"title":"Kalamu Lagoon Camp","description":"Set on a permanent lagoon in South Luangwa National Park’s Luamfa Concession lies Kalamu Lagoon Camp. With a pristine location in this remote region of the park, Kalamu offers an abundance of wildlife &amp; is one of the most incredible conservation areas in Africa. The emphasis at Kalamu Lagoon Camp is on walking &amp; since South Luangwa National Park is known to offer some of the best walking safaris in Zambia, guests will not be disappointed.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/kalamu-lagoon-camp/1kalamulagooncamp-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/kalamu-lagoon-camp","created":null},{"title":"Kapamba Bushcamp","description":"With an ideal location on the scenic Kapamba River in Zambia’s South Luangwa National Park, Kapamba Bushcamp offers wild safari encounters in this unspoilt section of Zambia. The camp offers the ultimate romantic safari experience, with beautiful rooms, private plunge pools &amp; the advantage of viewing wildlife from the privacy of your room – individually designed to boast gorgeous river views! Kapamba Bushcamp only operates during the best wildlife season, from April to January.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/kapamba-bushcamp/1kapambabushcamp-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/kapamba-bushcamp","created":null},{"title":"Kuyenda Bushcamp","description":"Kuyenda Bushcamp is situated on the banks of the Manzi River in South Luangwa National Park.   This remote location in Zambia is home to an abundance of game, offering guests a wild &amp; unspoilt safari experience. Kuyenda is known for its walking safaris, warm hospitality &amp; simple comforts in traditional Zambian huts.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/kuyenda-bushcamp/1kuyendabushcamp-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/kuyenda-bushcamp","created":null},{"title":"Lion Camp","description":"Lion Camp is a privately owned safari lodge with a prime location on the edge of an oxbow lagoon in the South Luangwa National Park. The lagoon attracts a wide variety of wildlife, including lion, leopard, wild dog, large herds of elephants &amp; buffaloes as well as the highest concentration of hippos in Africa!   With a remote setting in a quiet corner of the park, Lion Camp offers a truly exclusive safari experience with only a handful of safari vehicles.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/lion-camp/1lioncamp-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/lion-camp","created":null},{"title":"Luangwa River Camp","description":"Luangwa River Camp sits nestled under an ancient ebony grove on the banks of the Luangwa River in one of the last unspoilt wilderness areas in Africa:  The South Luangwa National Park. This game-rich area - called the Luangwa Wafwa - is filled with its oxbow lagoons, riverine woodlands &amp; large plains - &amp; is home to an abundance of game, including lion, leopard, elephant, buffalo, giraffe, hippo &amp; over 450 bird species. Guests travelling to South Luangwa will be able to explore this pristine bush environment on foot while being accompanied by an expert guide.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/luangwa-river-camp/1luangwarivercamp-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/luangwa-river-camp","created":null},{"title":"Mfuwe Lodge","description":"The award-winning Mfuwe Lodge enjoys a prime location in Zambia’s game-rich Luangwa Valley in South Luangwa National Park. This unspoilt area is filled with its oxbow lagoons, riverine woodlands &amp; large plains - &amp; is home to an abundance of game, including lion, leopard, elephant, buffalo, giraffe, hippo &amp; over 450 bird species. Guests travelling to South Luangwa will be able to explore this pristine bush environment on foot while being accompanied by an expert guide.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/mfuwe-lodge/1mfuwelodge-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/mfuwe-lodge","created":null},{"title":"Nkwali Camp","description":"Nkwali Camp lies in a game-rich area of ebony woodland just outside the world-renowned South Luangwa National Park. This area offers some of the best game viewing in Zambia – including regular sightings of leopard, hippo &amp; giraffe - &amp; it is not uncommon to see elephants cross the river. Guests travelling to South Luangwa will be able to explore this pristine bush environment on foot while being accompanied by an expert guide.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/nkwali-camp/1nkwalicamp-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/nkwali-camp","created":null},{"title":"Nsefu Camp","description":"Nsefu, the first Zambian photographic safari camp in the area is perched on a scenic bend on the Luangwa River in the remote Nsefu area of South Luangwa National Park. The camp is ideal for those looking to experience sensational game viewing as well as exceptional bird watching since its location offers the perfect blend between both. In fact, the main lounge &amp; bar area offers spectacular views over the bush, so guests can enjoy armchair game viewing without ever leaving camp!","image":"optimized-images/safaris/zambia/south-luangwa-national-park/nsefu-camp/1nsefucamp-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/nsefu-camp","created":null},{"title":"Puku Ridge Camp","description":"The luxurious Puku Ridge Camp boasts a spectacular location in the untamed wilderness of Zambia’s South Luangwa National Park. This African-chic camp offers uninterrupted views of the seemingly endless savannah - where lions, leopard, elephants, giraffes, hyenas &amp; buffalos roam – many of which are frequently spotted from the comfort of the viewing deck. The photographic hide with its unique views of the waterhole attracts predators &amp; prey alike &amp; is the ideal place for photography enthusiasts to kick off their shoes &amp; capture special wildlife moments.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/puku-ridge-camp/1pukuridgecamp-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/puku-ridge-camp","created":null},{"title":"Robin's House","description":"The exclusive Robin’s House enjoys a lovely setting on the banks of the Luangwa River in Zambia’s South Luangwa National Park. With breathtaking views of the river, this private Zambia villa - previously the home of the owner, Robin Pope - is the ideal safari choice for families who want to reconnect at their own pace. A private guide, safari vehicle &amp; chef will be at your disposal when staying at Robin’s House, so guests can enjoy a flexible schedule when it comes to activities &amp; mealtimes.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/robins-house/1robin-shouse-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/robins-house","created":null},{"title":"Shawa Luangwa Camp","description":"Named after Wanderlust’s top 8 best professional guides, Jacob Shawa, Shawa Luangwa Camp overlooks the beautiful Luangwa River &amp; was handpicked by Jacob Shawa as the ideal safari spot to explore one the park’s most untouched areas. South Luangwa National Park is part of the Luangwa Valley – a complex ecosystem that consists of dramatic seasonal changes, lush vegetation &amp; prolific wildlife – the perfect recipe for guests to fall in love with the Zambian wilderness. As the birthplace of the walking safari, guests will be happy to know that they can go on exhilarating walking safaris with Jacob Shawa himself – one of the best guides in Africa.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/shawa-luangwa-camp/1shawacamp-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/shawa-luangwa-camp","created":null},{"title":"Tafika Camp","description":"Located in the rugged &amp; wild South Luangwa National Park in Zambia, Tafika Lodge (open from May to November), enjoys gorgeous views of the Luangwa River. Tafika is the perfect choice for adventurous families looking for a unique safari experience &amp; fun-filled activities. The camp is owner-run, offering wonderful service &amp; comfortable bush camp accommodation.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/tafika-camp/1tafikacamp-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/tafika-camp","created":null},{"title":"Tena Tena","description":"Tena Tena is a tented camp set on the banks of the Luangwa River in the heart of Zambia’s South Luangwa National Park:  one of the last unspoilt wilderness areas in Africa! The South Luangwa National Park is Zambia’s premier wildlife destination &amp; home to a wealth of African wildlife - including elephant, hippo, lion, leopard, wild dog, giraffe, wildebeest &amp; 400 species of birds. Tena Tena accommodates a maximum of 10 guests in 5 luxury tents that are situated near the Buca Buca Lagoon.  ","image":"optimized-images/safaris/zambia/south-luangwa-national-park/tena-tena/1tenatena-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/tena-tena","created":null},{"title":"Time + Tide Chinzombo","description":"Set in a private concession on the banks of a river, Time + Tide Chinzombo – Zambia’s most luxurious safari camp - offers direct access to the world-renowned South Luangwa National Park. South Luangwa is Zambia’s premier wildlife destination &amp; home to a wealth of African wildlife - including elephant, hippo, lion, leopard, wild dog, giraffe, wildebeest &amp; 400 species of birds. Chinzombo offers sophisticated design &amp; elegance while still maintaining a low-impact conservation ethos.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/time-tide-chinzombo/1time-tidechinzombo-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/time-tide-chinzombo","created":null},{"title":"Time + Tide Kakuli","description":"Situated on the confluence of the Luwi &amp; Luangwa Rivers in South Luangwa National Park, Time + Tide Kakuli offers superb wildlife viewing &amp; a range of exciting activities. Here you will find one of the densest concentrations of game in Africa - including elephant, hippo, lion, leopard, wild dog, giraffe, wildebeest &amp; 400 species of birds. This section of South Luangwa has over 60 different animal species, so exceptional wildlife encounters can be anticipated.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/time-tide-kakuli/1time-tidekakuli-1-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/time-tide-kakuli","created":null},{"title":"Time + Tide Luwi","description":"With a prime location in the heart of South Luangwa National Park, Time + Tide Luwi is an authentic safari camp that offers exceptional wildlife encounters &amp; fun-filled safari activities. Luwi Camp is named after the seasonal river that flows nearby between January &amp; April. There are no other camps for miles around &amp; it is here where you will find one of the densest concentrations of game in Africa - including elephant, hippo, lion, leopard, wild dog, giraffe, wildebeest &amp; 400 species of birds.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/time-tide-luwi/1time-tideluwi-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/time-tide-luwi","created":null},{"title":"Time + Tide Mchenja","description":"Mchenja – the local name for ebony – is nestled into a shady ebony grove beside the beautiful Luangwa River in the world-renowned South Luangwa National Park. There are no other camps for miles around &amp; it is here where you will find one of the densest concentrations of game in Africa - including elephant, hippo, lion, leopard, wild dog, giraffe, wildebeest &amp; 400 species of birds. Time + Tide Mchenja is the perfect blend between luxury &amp; adventure – the ideal choice for those looking to have an authentic safari experience without sacrificing their everyday comforts.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/time-tide-mchenja/1time-tidemchenja-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/time-tide-mchenja","created":null},{"title":"Time + Tide Nsolo","description":"Nsolo – named after the honeyguide bird – is built on a raised wooden platform along a bend in the seasonal Luwi River in the heart of Zambia’s South Luangwa National Park. There are no other camps for miles around &amp; it is here where you will find one of the densest concentrations of game in Africa - including elephant, hippo, lion, leopard, wild dog, giraffe, wildebeest &amp; 400 striking &amp; unusual bird species. Time + Tide Nsolo makes a great base for their signature activity: “Sleep out under the Stars” &amp; around the corner you will find a wild dog den that is frequently visited by Nsolo guests.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/time-tide-nsolo/1time-tidensolo-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/time-tide-nsolo","created":null},{"title":"Zungulila Bushcamp","description":"Zungulila Bushcamp boasts a beautiful setting overlooking the Kapamba River in Zambia’s South Luangwa National Park. The camp sits on a raised knoll above picturesque plains &amp; natural springs – a magnet for attracting wildlife year-round. South Luangwa is as wild &amp; remote as it gets, but Zungulila does not compromise on the everyday comforts!  Travellers looking for an authentic tented safari experience combined with a little luxury will fall in love with Zungulila.","image":"optimized-images/safaris/zambia/south-luangwa-national-park/zungulila-bushcamp/1zungulilabushcamp-small.webp","folderName":"safaris/zambia/south-luangwa-national-park/zungulila-bushcamp","created":null}],"parentCards":[{"title":"Kafue National Park","image":"optimized-images/safaris/zambia/kafue-national-park/1kafue-small.webp","folderName":"safaris/zambia/kafue-national-park","isCurrentFolder":false},{"title":"Livingstone","image":"optimized-images/safaris/zambia/livingstone/1livingstone-small.webp","folderName":"safaris/zambia/livingstone","isCurrentFolder":false},{"title":"Lower Zambezi National Park","image":"optimized-images/safaris/zambia/lower-zambezi-national-park/1lowerzambezi-small.webp","folderName":"safaris/zambia/lower-zambezi-national-park","isCurrentFolder":false},{"title":"North Luangwa National Park","image":"optimized-images/safaris/zambia/north-luangwa-national-park/1northluangwa-small.webp","folderName":"safaris/zambia/north-luangwa-national-park","isCurrentFolder":false},{"title":"South Luangwa National Park","image":"optimized-images/safaris/zambia/south-luangwa-national-park/1southluangwa-small.webp","folderName":"safaris/zambia/south-luangwa-national-park","isCurrentFolder":true}],"h1Title":"Shawa Luangwa Camp","h2Title":"South Luangwa National Park","h3Title":"Shawa Luangwa Camp","whatWeLoveItems":["Set in one of South Luangwa’s most untouched areas","Overlooks the beautiful Luangwa River","Go on walking safaris with legendary guide, Jacob Shawa","Game drives, guided walks & boating safaris","See large herds of elephants & buffaloes","Excellent predator sightings"],"params":{"slug":["safaris","zambia","south-luangwa-national-park","shawa-luangwa-camp"]},"level":4},"__N_SSG":true}