{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","canon":true,"lodges":"?\nMAURITIUS\nMADIKWE SAFARI LODGE\nLONDOLOZI VARTY CAMP\nKWANDWE ECCA LODGE\nKWANDWE MELTON MANOR\nTUNINGI SAFARI LODGE\nMORUKURU FARM HOUSE\nSOMALISA ACACIA\nBUMI HILLS\nLITTLE GOVERNORS’ CAMP\nSINGITA EBONY\nSINGITA SERENGETI HOUSE\nSOSSUSVLEI DESERT LODGE\n"},"content":"<p>HAVE FUN AT THE KIDS CLUB</p>\n<p>Holidays are supposed to be fun!  But often ‘fun for Mum &amp; Dad’, doesn’t necessarily mean ‘fun for the kids!’ (&amp; vice versa) But when your family travels to Africa, we’ll make sure that ‘fun’ is indeed for the whole family.<br>One of the best ways to ensure that everyone is happy is to pick family-friendly lodges with Kids Clubs. That way, the little ones can play at their heart’s content, learn about Africa &amp; enjoy a variety of fun activities while Mum &amp; Dad enjoy an afternoon siesta.<br>There are wonderful Kids Clubs throughout Africa, but we’ll share some of our favourites with you – so start packing &amp; get ready for oodles of family fun!</p>\n<ol>\n<li>Mauritius<br>Yes, Mauritius is Number 1 on our list, because most resorts on this beautiful island boast fantastic Kids (&amp; Teens) Clubs that will keep your kids busy for days!  Mauritius resorts offer an impressive amount of age-appropriate land &amp; water activities – with dedicated adult supervision, of course.  So, Mum &amp; Dad can relax by the pool, enjoy water sports or take a siesta as kids craft &amp; play to their hearts’ content.</li>\n<li>Madikwe Safari Lodge, Madikwe Game Reserve – South Africa<br>At Madikwe Safari Lodge, kids will learn how to survive in the bush with lessons on which trees’ branches make the best toothbrushes, how to find your way in the bush, make fire &amp; source water.  ‘Bug CSI’ will take the little ones on guided walks around camp to find different plants &amp; insects while spoor &amp; dung tracking are both great hits among young explorers.</li>\n<li>Londolozi Varty Camp, Sabi Sand Reserve – South Africa<br>Londolozi stands out above the rest when it comes to a child’s tailored safari experience.  Recognising that each child is unique, an assessment is done upon arrival by a ranger &amp; qualified facilitator who then custom design a fun-filled safari itinerary for each child.  Private game drives mean that your family can come &amp; go, stop, touch, feel &amp; smell at your own pace.  Back at camp, kids will also enjoy archery, tree climbing, fishing, movie nights, pizza making, sling-shot competitions, water-based games, Masterchef cook-offs, arts &amp; crafts, &amp; photography lessons.</li>\n<li>Kwandwe Ecca Lodge, Kwandwe Private Game Reserve – South Africa<br>Kwandwe Ecca Lodge offers children an opportunity to become honorary members of the Blue Crane Conservation Club, named after South Africa’s endangered national bird.  As ‘Blue Craners,’ they’ll receive an animal checklist, take a pledge to live green &amp; learn about conservation on exciting, guided walking safaris around camp, identifying animal droppings, tracks &amp; insects.  Water babies can also go on supervised fishing trips &amp; game drives looking for non-predatory wildlife like zebras, monkeys &amp; giraffes.</li>\n<li>Kwandwe Melton Manor, Kwandwe Private Game Reserve – South Africa<br>This exclusive-use safari villa not only comes with a dedicated team of staff but comes with a long list of family-friendly activities.  Receiving a welcome pack of animal checklists, themed games &amp; activities, gifts &amp; a pledge to live green, your kids will have a blast.  At the Kids Club, children can enjoy cooking lessons, scavenger hunts, arts &amp; crafts &amp; much more.  A bonus at Melton Manor is that kids of all ages are allowed on game drives.</li>\n<li>Tuningi Safari Lodge, Madikwe Game Reserve – South Africa<br>Tuningi Safari Lodge is one of the few 5-star safari lodges in the Madikwe Game Reserve that welcomes children &amp; in doing so, allows them to be exposed to wildlife &amp; nature.  Kids at Tuningi will have a blast!  The little ones will be kept busy with treasure hunts, arts &amp; crafts &amp; scavenger hunts.  They also have a dedicated kids playroom where children can roam around freely &amp; play to their hearts’ content.</li>\n<li>Morukuru Farm House, Madikwe Game Reserve – South Africa<br>At Morukuru Farm House, all children are welcome on game drives &amp; will receive a backpack of goodies that will teach them to become ‘junior rangers.’  The little ones will head off on guided spoor-tracking lessons, mini bush walks &amp; enjoy scrapbooking of their favourite safari finds.  Kids at Morukuru Farm House can also bake biscuits, play board games &amp; enjoy video games.</li>\n<li>Somalisa Acacia, Linyanti Reserve – Botswana<br>Somalisa Acacia was built with families in mind.  Their Ngwana Club specialises in providing the little ones with educational fun from beginning to end.  Here, kids will learn about local wildlife through nature walks, arts &amp; crafts &amp; cooking lessons.  The cherry on top at Somalisa Acacia is the Elephant Pool – a waterhole right next to camp – where herds of elephants are frequently spotted.  </li>\n<li>Bumi Hills Safari Lodge, Matusadona National Park – Zimbabwe<br>Bumi Hills’ Ngwana Club is famous for keeping the little ones so busy, they won’t even notice you’re gone.  Here, kids will be educated about life in the bush through fun activities – from nature walks around camp &amp; storytelling to cultural arts, crafts &amp; cooking classes.<br>10.Governors’ Camp, Masai Mara – Kenya<br>The Great Wildebeest Migration is a wildlife show your kids will never forget!  Not only can they enjoy a phenomenal wildlife experience, but at the Mongoose Club, they will be entertained, educated &amp; inspired through a bunch of fun-filled safari activities.  Leading the team, is a local Masai guide who will teach kids all about his culture, how to identify animal tracks &amp; using the camp’s telescope - how to dabble in astronomy.  Kids will also enjoy fun ‘make your own pizza’ evenings, make their own jewellery &amp; build handmade wooden bows &amp; arrows – which will be much needed during target practice.</li>\n<li>Singita Ebony, Sabi Sand Reserve – South Africa<br>Kids of all ages are welcome at Singita Ebony &amp; their Mini Rangers Course is filled with fun activities ranging from tracking &amp; birding to bush survival skills.  Babysitting is also offered here, so parents can enjoy some downtime for massages or afternoon siestas.  </li>\n<li>Singita Serengeti House, Serengeti National Park – Tanzania<br>Singita Serengeti House offers front row seats to nature’s greatest spectacle:  the Great Wildebeest Migration.  Your family can enjoy sole use of this private villa as well as a variety of exciting activities, like tennis, watching a movie in the media room or swimming in the infinity pool.  Kids can join the Mini Rangers Course where they’ll learn how to track animals &amp; survive in the bush while enjoying fun nature quizzes &amp; various competitions.</li>\n<li>Sossusvlei Desert Lodge, Sossusvlei – Namibia<br>Stargazing in Sossusvlei is spectacular, so at Sossusvlei Desert Lodge the little ones will receive a WILDchild backpack filled with bush-orientated goodies &amp; receive stargazing lessons from an expert.  Daily activities usually revolve around getting creative with ostrich shell art to make jewellery – just like the San Bushmen, learn about dune history while playing in the sand &amp; enjoy some monkey ball art, using local fruits as a canvas.</li>\n</ol>\n","images":["optimized-images/family-travel/3have-fun-at-the-kids-club/1havefunatthekidsclub-large.webp","optimized-images/family-travel/3have-fun-at-the-kids-club/2havefunatthekidsclub-large.webp","optimized-images/family-travel/3have-fun-at-the-kids-club/3havefunatthekidsclub-large.webp","optimized-images/family-travel/3have-fun-at-the-kids-club/4havefunatthekidsclub-large.webp","optimized-images/family-travel/3have-fun-at-the-kids-club/5havefunatthekidsclub-large.webp","optimized-images/family-travel/3have-fun-at-the-kids-club/6havefunatthekidsclub-large.webp","optimized-images/family-travel/3have-fun-at-the-kids-club/7havefunatthekidsclub-large.webp","optimized-images/family-travel/3have-fun-at-the-kids-club/8havefunatthekidsclub-large.webp"],"subfolders":[{"title":"1Witness Fascinating Animal Encounters","description":"WITNESS FASCINATING ANIMAL ENCOUNTERS All children love animals, &amp; in Africa – there is a lot of love going around!  ","image":"optimized-images/family-travel/1witness-fascinating-animal-encounters/1witnessfascinatinganimalencounters-small.webp","folderName":"family-travel/1witness-fascinating-animal-encounters"},{"title":"2Stay In Private Villas","description":"STAY IN PRIVATE VILLAS Let’s be honest – although hotels are luxurious &amp; amazing, spending a lot of time in a hotel room with (small) children, is not quite what Mum &amp; Dad had in mind when planning a family holiday!","image":"optimized-images/family-travel/2stay-in-private-villas/1stayinprivatevillas-small.webp","folderName":"family-travel/2stay-in-private-villas"},{"title":"3Have Fun At The Kids Club","description":"HAVE FUN AT THE KIDS CLUB Holidays are supposed to be fun!  But often ‘fun for Mum &amp; Dad’, doesn’t necessarily mean ‘fun for the kids!’ (&amp; vice versa) But when your family travels to Africa, we’ll make sure that ‘fun’ is indeed for the whole family.","image":"optimized-images/family-travel/3have-fun-at-the-kids-club/1havefunatthekidsclub-small.webp","folderName":"family-travel/3have-fun-at-the-kids-club"},{"title":"4Explore At Your Own Pace","description":"EXPLORE AT YOUR OWN PACE Travelling with kids &amp; adhering to set schedules can be challenging for some, so if you are an independent family who loves to explore at your own pace – why not rent a car &amp; self-drive through South Africa or Nambia?","image":"optimized-images/family-travel/4explore-at-your-own-pace/1exploreatyourownpace-small.webp","folderName":"family-travel/4explore-at-your-own-pace"},{"title":"5Choose Malaria-Free","description":"CHOOSE MALARIA-FREE Everyone will agree that Africa is a bucket list destination – even if you are pregnant or travelling with young kids.","image":"optimized-images/family-travel/5choose-malaria-free/1choosemalaria-free-small.webp","folderName":"family-travel/5choose-malaria-free"},{"title":"6Enjoy Family-Friendly Activities","description":"ENJOY FAMILY-FRIENDLY ACTIVITIES There are certain countries in the world that, as parents, we simply won’t dare to visit with our kids.  They are simply not child-friendly.","image":"optimized-images/family-travel/6enjoy-family-friendly-activities/1enjoyfamily-friendlyactivities-small.webp","folderName":"family-travel/6enjoy-family-friendly-activities"}],"parentCards":[{"title":"Another Travel Blog","image":"optimized-images/blog/anothertravelblog-small.webp","folderName":"blog","isCurrentFolder":false},{"title":"Bucket List","image":"optimized-images/bucket-list/1thebucketlist-small.webp","folderName":"bucket-list","isCurrentFolder":false},{"title":"CITIES","image":"optimized-images/cities/1cities-small.webp","folderName":"cities","isCurrentFolder":false},{"title":"All Destinations","image":"optimized-images/destinations/11-small.webp","folderName":"destinations","isCurrentFolder":false},{"title":"Family Travel","image":"optimized-images/family-travel/1familytravel-small.webp","folderName":"family-travel","isCurrentFolder":true},{"title":"Favourite","image":"","folderName":"favourite","isCurrentFolder":false},{"title":"Honeymoons","image":"optimized-images/honeymoons/1honeymoons-small.webp","folderName":"honeymoons","isCurrentFolder":false},{"title":"Africa Unwind","image":"","folderName":"index","isCurrentFolder":false},{"title":"ISLANDS","image":"optimized-images/islands/1islands-small.webp","folderName":"islands","isCurrentFolder":false},{"title":"Our Story","image":"optimized-images/our-story/1ourstory-small.webp","folderName":"our-story","isCurrentFolder":false},{"title":"SAFARIS","image":"optimized-images/safaris/1safaris-small.webp","folderName":"safaris","isCurrentFolder":false}],"h1Title":"3Have Fun At The Kids Club","h2Title":"Family Travel","h3Title":"3Have Fun At The Kids Club","whatWeLoveItems":[],"params":{"slug":["family-travel","3have-fun-at-the-kids-club"]},"level":2},"__N_SSG":true}