{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","created":"1 July 2022","category":"We Say","canon":true},"content":"<p>There are two things that excite me when it comes to travel:  Islands &amp; luxury…And for some reason, these two things are like cookies &amp; cream – they create the perfect balance to a holiday.</p>\n<p>So, from now on I will refer to this term (Islands + Luxury) as ‘Island Extraordinaire’, because if you continue to read until the end, you’ll understand why our recent trip to Mozambique was exactly that - Extraordinary!<br>Since I was a young girl, I dreamt about being whisked away to a romantic island retreat where my villa was right on the sand.  I have always wanted to be surrounded by turquoise blue water &amp; palm trees while eating fresh seafood on the beach…We would watch a romantic sunset, enjoy adventurous watersports &amp; get pampered at the spa…&amp; then I would wake up!<br>Well, this time, my dream would become a reality!<br>“Finally,” I thought.<br>My husband &amp; I were getting ready for our secluded island getaway to Mozambique’s Bazaruto Archipelago - the combined name for 6 idyllic islands which lie just off the mainland between Vilanculos &amp; Inhassoro.  We were ecstatic to be calling Benguerra Island home for the next week!<br>We have heard that this island is known for its unspoilt beauty &amp; diverse ecologies, so “excited” was probably a bit of an understatement!<br>There are only 3 luxury retreats on the entire island, &amp; we were going to stay at 2 of them.<br>OK, if you are reading this - fasten your seatbelt – you are about to be blown away!!<br>Upon arrival at Vilanculos Airport, we were met by a friendly staff member &amp; taken to a VIP lounge in a quite corner of the airport, where we could enjoy welcome drinks before our transfer arrived.  Shortly after, our pilot arrived &amp; escorted us to our private helicopter.  Yes, you heard right – private helicopter!  Blown away yet?<br>The 20-minute helicopter trip was simply spectacular!  Looking down at the turquoise blue ocean while spotting the odd traditional dhow boat made me feel like pinching myself.<br>“Welcome to your dream island,” I thought as the helicopter came to a standstill.<br>After a warm island greeting, the staff showed us around Benguerra Island Lodge - one of the most sought-after African island destinations – known for offering the best in laidback island luxury.<br>It wasn’t hard to fall in love with our beach villa &amp; its beautiful surrounds.  Accommodation comprises 2 beautiful cabanas &amp; 10 slightly larger casitas that are built right on the edge of the beach, each boasting an outdoor shower, private deck with jacuzzi or plunge pool &amp; sun loungers.<br>Each casita also includes a tastefully appointed lounge area, and outdoor sala &amp; an irresistible hanging daybed…where we spent most of our time!<br>They also cater for families!  The 3-bedroom, 3-bathroom Casa Familia is the epitome of exclusivity &amp; comes with a personal chef, outdoor showers, a lounge &amp; dining room, a private wooden deck with swimming pool &amp; direct beach access.<br>Communal areas include a massage sala, dive centre, beach bar &amp; lounge.<br>We stayed in one of the casitas &amp; felt like royalty!  The private pool was such a treat &amp; a wonderful place to relax between snorkelling, beach walks &amp;…well, eating.  Tough life, right?<br>One of the things that really stood out for us, was the service.  The staff were incredible &amp; nothing was too much trouble for them!  They asked us each day where we would like to have dinner &amp; our answer was always the same: “We would love a private beach dinner please…” - because what beats eating fresh seafood while watching the sun set over the ocean…barefoot?! And each time their reply was the same: “Sir, it is no problem!” (smiling)<br>So, there we were – on our remote Indian Ocean Island – with our feet in the sand, eating to our hearts content &amp; looking out over the sea, thinking: “Can we just stay forever?”<br>Every day was pure bliss!  We decided to use this time to really switch off, relax &amp; do as little as possible…except swim, sunbath, eat, nap, read &amp; snorkel – of course!  But if you want to do more activities – you can!  Their activity list includes scuba diving, Land Rover island drives, fishing, dhow cruises, castaway picnics &amp; birdwatching.  Other options are island walks, village visits, sea kayaking, catamaran cruises &amp; horse riding…Wow, that’s a mouthful!<br>Sunset is such a beautiful time on the island, so we decided to round off our stay with a romantic dhow cruise around the island. (a traditional sailing boat made by locals) It was so special to be sitting in a rustic wooden boat with a local Mozambican man who grew up on the island.  It was like being transported to another – very special – world.<br>After a few days at Benguerra Island Lodge, our open jeep transfer collected us &amp; whisked us away to our next stop:  Azura Benguerra Island – one of Mozambique’s most stylish island retreats.<br>After a very warm welcome, we were taken to our beach villa.  “Wow!”  And then – no words...Just happiness.  Each elegant beach villa comes with a private butler, a plunge pool &amp; a romantic day sala – the perfect blend for a romantic stay.  No wonder Azura Benguerra is a favourite among honeymooners.<br>There are a variety of villas for every type of client – as well as a family villa (sleeping 5 guests) &amp; a 3-bedroom, 3-bathroom presidential villa offering the ultimate in luxury.<br>The resort operates on a fully inclusive rate, which means that all meals, drinks, butler-service &amp; a variety of activities are included in your stay.  “Which activities are included?” you may ask.  Are you ready for it…? A scenic island drive by Land Rover, a sunset cocktail of the day served to your sala, the use of snorkelling equipment as well as kayaks &amp; paddleboards, a romantic sunset dhow cruise, a try scuba diving session in the pool, the use of Peri Peri Beach Club as well as honeymoon special treats &amp; various activities for kids.<br>Of course, there is a long list of other activities on offer at an additional cost.  These include reef snorkelling, island hopping, scuba diving, deep sea fishing, beach picnics &amp; spa treatments.<br>If you were wondering what a typical day at Azura looks like…Here we go!  After sleeping in, we woke up, opened our curtains &amp; looked out over the turquoise ocean.  After relaxing a bit on our beach sala (my husband with his coffee &amp; me with my orange juice), we had a lovely breakfast on the deck overlooking the ocean.  What a way to start the day!<br>Next up – snorkelling!  Both of us love being in the water, so we always prioritise a snorkel safari while on holiday.  After we met our friendly skipper, we headed out on a private speed boat to explore the Indian Ocean’s beautiful coral reefs.  And what a trip it was!  Surrounded by nothing except translucent waters, sea creatures &amp; coral – with no other boats or people in sight – we came face to face with technicoloured marine life that moved in droves along the exposed coral.  “Breathtaking,” we thought!<br>Our concierge at Azura recommended we do a castaway beach picnic…&amp; so we did.  On our way back, our skipper stopped at a small, private isle in the middle of the ocean, &amp; when we came closer – our mouths hung open as we looked at what was in store for us next.  A private beach picnic, packed out in style!  A canopy was set up for us - with plenty of shade, comfortable bean bags were laid out, along with fluffy towels, a cooler box full of our favourite drinks &amp; a table set up with a fresh seafood lunch.  “Sir, when would you like us to collect you again?” they asked.  We decided that 3 hours would be sufficient to enjoy all the picnic surprises, have a swim, lie in the sun &amp;…do a few handstands on our private isle!<br>So, there we were – in paradise!  With nothing &amp; nobody else in sight…except the fish!<br>After a very relaxing time - &amp; the most delicious meal – we saw something in the distance.  Our transfer….a private catamaran!  Our skipper welcomed us with a drink &amp; even asked us: “Sir, how fast would you like to go?”  After thinking a little, my husband replied: “Let’s go fast &amp; then go slow!”  Basking in the sun on our private catamaran, we felt so relaxed &amp; totally rejuvenated.  When we approached the island, our personal butler was waiting for us on the beach – with our favourite cocktail in hand!<br>The sun was now setting, so after relaxing on our beach sala – cocktail in hand – we decided to go stand-up paddle boarding.  (One of our other favourite island activities!)  “What a day!” we thought – in the most positive sense.<br>As we were standing on our boards, looking out over the orange skies &amp; quiet ocean, only one word came to mind: “Extraordinary!”<br>This time it was not a dream.</p>\n","images":["optimized-images/BLOG/we-say/island-extraordinaire/1IslandExtraordinaire-large.webp","optimized-images/BLOG/we-say/island-extraordinaire/2IslandExtraordinaire-large.webp","optimized-images/BLOG/we-say/island-extraordinaire/3IslandEXtraordinaire-large.webp","optimized-images/BLOG/we-say/island-extraordinaire/4IslandExtraordinaire-large.webp","optimized-images/BLOG/we-say/island-extraordinaire/5IslandExtraordinaire-large.webp","optimized-images/BLOG/we-say/island-extraordinaire/6IslandExtraordinaire-large.webp","optimized-images/BLOG/we-say/island-extraordinaire/7IslandExtraordinaire-large.webp","optimized-images/BLOG/we-say/island-extraordinaire/8IslandExtraordinaire-large.webp"],"subfolders":[{"title":"Family Fun","description":"OK, Let’s be honest – traveling with kids can be fun (or not).  It all depends on one crucial holiday ingredient:  activities! “What are we going to do today?” is often the one question parents hear while on holiday - &amp; often repetitively. So, I made it my mission to find a holiday that offers of a bagful of fun for the whole family – including Mum &amp; Dad. OK, Let’s be honest – traveling with kids can be fun (or not).  It all depends on one crucial holiday ingredient:  activities!","image":"optimized-images/BLOG/we-say/family-fun/1FamilyFun-small.webp","folderName":"blog/we-say/family-fun"},{"title":"Island Extraordinaire","description":"There are two things that excite me when it comes to travel:  Islands &amp; luxury…And for some reason, these two things are like cookies &amp; cream – they create the perfect balance to a holiday. So, from now on I will refer to this term (Islands + Luxury) as ‘Island Extraordinaire’, because if you continue to read until the end, you’ll understand why our recent trip to Mozambique was exactly that - Extraordinary!","image":"optimized-images/BLOG/we-say/island-extraordinaire/1IslandExtraordinaire-small.webp","folderName":"blog/we-say/island-extraordinaire"},{"title":"Mother City","description":"Everyone loves Cape Town.  Full stop.  This article is finished. The only reason I continue to write, is because there is so much to say about South Africa’s most beautiful city.  You may think I am biased since I was born here & grew up here – but then I meet people from other countries around the world who agree with me - & I realise, I am right! (She said humbly.)","image":"optimized-images/BLOG/we-say/mother-city/1MotherCity-small.webp","folderName":"blog/we-say/mother-city"},{"title":"Spa Surprise","description":"If you know me well, you’ll know that I get excited about these 3 things:  People, travel &amp; spa treatments! So, when our friends decided to spoil us with a spa day, we could not refuse.  (Everyone needs friends like ours!)","image":"optimized-images/BLOG/we-say/spa-surprise/1SpaSurprise-small.webp","folderName":"blog/we-say/spa-surprise"},{"title":"Sunny Safari","description":"“Wow, I am excited about this trip!” I thought while packing. Safari outfits?  Check.  Camera?  Check.  Swim gear?  Check.  After I have packed these three essentials, I almost felt like the rest of the things on my list were suddenly not so important anymore.  (But with kids, you always need to pack more!  So I did.)","image":"optimized-images/BLOG/we-say/sunny-safari/1SunnySafari-small.webp","folderName":"blog/we-say/sunny-safari"},{"title":"Wine & Whales","description":"Apart from seeing the Big 5 on safari, there are 2 things that get most travellers excited:  Wine &amp; Whales – in no particular order! But we are not most people.  My husband &amp; I don’t even drink wine (please don’t judge us!) – but we decided to investigate 2 of the most popular self-drive routes in South Africa to see if they are truly as spectacular as everyone says.","image":"optimized-images/BLOG/we-say/wine--whales/1Wine&Whales-small.webp","folderName":"blog/we-say/wine-whales"}],"parentCards":[{"title":"All Things Africa","image":"optimized-images/blog/all-things-africa/1-all-things-africa-small.webp","folderName":"blog/all-things-africa","isCurrentFolder":false},{"title":"Our Clients Say","image":"optimized-images/blog/our-clients-say/1-clients-say-small.webp","folderName":"blog/our-clients-say","isCurrentFolder":false},{"title":"We Say","image":"optimized-images/blog/we-say/1-we-say-small.webp","folderName":"blog/we-say","isCurrentFolder":true}],"h1Title":"Island Extraordinaire","h2Title":"We Say","h3Title":"Island Extraordinaire","whatWeLoveItems":[],"params":{"slug":["BLOG","we-say","island-extraordinaire"]},"level":3},"__N_SSG":true}