{"pageProps":{"frontmatter":{"title":"LARSEN’S TENTED CAMP","subtitle":"","article_title":"","canon":true},"content":"<h4>Experience</h4>\n<p>Larsen’s Camp - named after Erik Ole Larsen who defined luxury safaris under canvas - enjoys a beautiful setting on the banks of the Ewaso Nyiro River in Kenya’s Samburu National Reserve.<br>Home to Africa’s Big 5 – lion, leopard, elephant, buffalo &amp; rhino – The Samburu National Reserve never disappoints.  Guests can also spot many rare creatures, like the Beisa oryx, reticulated giraffe, gerenuk &amp; Grevy’s zebra.<br>Bird enthusiasts will greatly enjoy the nature walks around the reserve in search of some of the region’s most interesting &amp; prolific birdlife.</p>\n<h4>Stay</h4>\n<p>Larsen’s Camp includes 20 luxury tents dotted along the riverbanks, all constructed on stone plinths, with large en-suite bathrooms.<br>Each tent boasts a private veranda, offering breathtaking views over the river &amp; bush.<br>At the main lodge, you will find a comfortable lounge &amp; bar area, the perfect place to enjoy a drink or play a game of chess.  There is also a large swimming pool offering views over the bush as well as a wellness spa that offers a range of relaxing treatments.</p>\n<h4>Activities</h4>\n<p>Larsen’s Tented Camp offers thrilling open 4x4 game drives in the Samburu National Reserve – an area teeming with wildlife.<br>Specialist guides will take guests on relaxing nature walks along the riverbank to see if they can spot some of the 1,100 bird species found in the area.<br>Sundowner excursions in the bush are also very popular.</p>\n","images":["optimized-images/safaris/kenya/samburu-national-reserve/larsens-tented-camp/1larsen-stentedcamp-large.webp","optimized-images/safaris/kenya/samburu-national-reserve/larsens-tented-camp/2larsen-stentedcamp-large.webp","optimized-images/safaris/kenya/samburu-national-reserve/larsens-tented-camp/3larsen-stentedcamp-large.webp","optimized-images/safaris/kenya/samburu-national-reserve/larsens-tented-camp/4larsen-stentedcamp-large.webp","optimized-images/safaris/kenya/samburu-national-reserve/larsens-tented-camp/5larsen-stentedcamp-large.webp","optimized-images/safaris/kenya/samburu-national-reserve/larsens-tented-camp/6larsen-stentedcamp-large.webp","optimized-images/safaris/kenya/samburu-national-reserve/larsens-tented-camp/7larsen-stentedcamp-large.webp","optimized-images/safaris/kenya/samburu-national-reserve/larsens-tented-camp/8larsen-stentedcamp-large.webp"],"subfolders":[{"title":"Elephant Bedroom Camp","description":"Elephant Bedroom Camp is situated on the banks of the Ewaso Nyiro River, in the heart of the Samburu National Reserve in Kenya. With breathtaking views over the river &amp; bush, the camp offers guests an authentic tented safari experience in a pristine wilderness setting. Resident elephants often wander through the camp, so guests can enjoy amazing armchair game viewing from the comfort of their private verandas.","image":"optimized-images/safaris/kenya/samburu-national-reserve/elephant-bedroom-camp/1elephantbedroomcamp-small.webp","folderName":"safaris/kenya/samburu-national-reserve/elephant-bedroom-camp","created":null},{"title":"Larsen's Tented Camp","description":"Larsen’s Camp - named after Erik Ole Larsen who defined luxury safaris under canvas - enjoys a beautiful setting on the banks of the Ewaso Nyiro River in Kenya’s Samburu National Reserve. Home to Africa’s Big 5 – lion, leopard, elephant, buffalo &amp; rhino – The Samburu National Reserve never disappoints.  Guests can also spot many rare creatures, like the Beisa oryx, reticulated giraffe, gerenuk &amp; Grevy’s zebra.   Bird enthusiasts will greatly enjoy the nature walks around the reserve in search of some of the region’s most interesting &amp; prolific birdlife.","image":"optimized-images/safaris/kenya/samburu-national-reserve/larsens-tented-camp/1larsen-stentedcamp-small.webp","folderName":"safaris/kenya/samburu-national-reserve/larsens-tented-camp","created":null},{"title":"Samburu Intrepids","description":"Set in a picturesque mountainous landscape on the banks of the Ewaso Nyiro River in Samburu National Reserve, lies Samburu Intrepid, a classic tented camp with comfortable accommodation &amp; exciting safari activities. The camp is a wonderful choice for families since their Kids Club is one of the best in the region, offering a range of fun-filled bush activities for the little ones.  The Adventurer’s Club focus on children &amp; The Young Rangers’ Club is for slightly older teenagers. For an adventurous break from the hustle &amp; bustle, overnight fly-camping excursions in small dome tents are available on request.","image":"optimized-images/safaris/kenya/samburu-national-reserve/samburu-intrepids/1samburuintrepids-small.webp","folderName":"safaris/kenya/samburu-national-reserve/samburu-intrepids","created":null},{"title":"Samburu Sopa Lodge","description":"Set on a hilltop inside the Samburu National Reserve, Samburu Sopa Lodge boasts jaw-dropping views over Mount Kenya &amp; the distant Samburu Plains. The architecture reflects a similar style to the local Samburu housing &amp; therefore blends in seamlessly with the environment. The camp boasts awe-inspiring views over a busy waterhole where animals are often seen drinking or playing, allowing excellent armchair game viewing from the comfort of the lodge’s viewing deck.","image":"optimized-images/safaris/kenya/samburu-national-reserve/samburu-sopa-lodge/1samburusopalodge-small.webp","folderName":"safaris/kenya/samburu-national-reserve/samburu-sopa-lodge","created":null},{"title":"Sarara Camp","description":"Sarara Camp lies within the exclusive Namunyak Wildlife Conservation Trust of northern Kenya, an 850,000-acre untouched wilderness in the famed Mathews Range, also known as Lenkiyio Hills. This area - slightly bigger than the State of New Jersey - is home to the Samburu pastoralists &amp; animals like elephant, leopard, wild dog, hyena, buffalo &amp; reticulated giraffe – most of which can be seen from the comfort of the camp’s viewing deck as they come to drink at Sarara’s resident waterhole. Here guests can witness one of the most unique experiences in the world that is forbidden to be photographed – The fabled Samburu ‘singing wells.’  During the dry season (July – October), semi-nomadic Samburu tribes bring their livestock to dry waterholes each morning to dig for precious, life-giving water while singing.","image":"optimized-images/safaris/kenya/samburu-national-reserve/sarara-camp/1sararacamp-small.webp","folderName":"safaris/kenya/samburu-national-reserve/sarara-camp","created":null},{"title":"Saruni Rhino","description":"Situated in the heart of the Samburu National Reserve in northern Kenya, Saruni Rhino – as the name suggests – offers one-of-a-kind rhino tracking safaris for the adventurous traveller. Here guests can track endangered black rhino on foot while their participation contributes to the conservation &amp; protection of this iconic species. Within this 350,000-hectare wilderness known as the Sera Community Conservancy – the first community conservancy in Africa to own &amp; operate a sanctuary for black rhino – these amazing creatures receive state-of-the-art protection &amp; can roam freely in their natural habitat.","image":"optimized-images/safaris/kenya/samburu-national-reserve/saruni-rhino/1sarunirhino-small.webp","folderName":"safaris/kenya/samburu-national-reserve/saruni-rhino","created":null},{"title":"Saruni Samburu","description":"Set deep within the heart of the private Kalama Conservancy, bordering the Samburu National Reserve, lies Saruni Samburu – famed for its interesting cave-like villas that are built-in &amp; around a volcanic rock-face. Offering jaw-dropping views over the scenic mountains &amp; unspoilt natural environment, Saruni Samburu is ideal for romantics &amp; nature-loving families looking for an off-the-beaten-track &amp; stylish safari experience. Accommodation comprises 6 luxury villas, all built into the volcanic rock-face &amp; some even extending over several levels.  Four of these villas are ideal for families as they each have 2 en-suite bedrooms.","image":"optimized-images/safaris/kenya/samburu-national-reserve/saruni-samburu/1sarunisamburu-small.webp","folderName":"safaris/kenya/samburu-national-reserve/saruni-samburu","created":null},{"title":"SaSaab Camp","description":"The Moroccan-inspired SaSaab Camp is set above the Easo Nyiro River in Samburu National Reserve &amp; offers jaw-dropping views over the Samburu plains towards Mount Kenya. The reserve is home to an abundance of wildlife, including classic savannah animals &amp; some of northern Kenya’s more unusual species. SaSaab’s camelback safaris &amp; fly-camping adventures are wonderful ways of exploring the pristine wilderness – &amp; activities that should be added to everyone’s bucket list!","image":"optimized-images/safaris/kenya/samburu-national-reserve/sasaab-camp/1sasaabcamp-small.webp","folderName":"safaris/kenya/samburu-national-reserve/sasaab-camp","created":null}],"parentCards":[{"title":"Amboseli National Park","image":"optimized-images/safaris/kenya/amboseli-national-park/1amboseli-small.webp","folderName":"safaris/kenya/amboseli-national-park","isCurrentFolder":false},{"title":"Masai Mara","image":"optimized-images/safaris/kenya/masai-mara/1masaimara-small.webp","folderName":"safaris/kenya/masai-mara","isCurrentFolder":false},{"title":"Nairobi","image":"optimized-images/safaris/kenya/nairobi/1nairobi-small.webp","folderName":"safaris/kenya/nairobi","isCurrentFolder":false},{"title":"Samburu National Reserve","image":"optimized-images/safaris/kenya/samburu-national-reserve/1samburu-small.webp","folderName":"safaris/kenya/samburu-national-reserve","isCurrentFolder":true}],"h1Title":"Larsen's Tented Camp","h2Title":"Samburu National Reserve","h3Title":"Larsen's Tented Camp","whatWeLoveItems":["Beautiful river setting","Game drives in Samburu National Reserve","Spacious tents with private verandas & river views","Superb Big 5 game viewing","Riverside dinners under the stars","Walking safaris to spot the diverse birdlife"],"params":{"slug":["safaris","kenya","samburu-national-reserve","larsens-tented-camp"]},"level":4},"__N_SSG":true}