{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","canon":true,"lodges":"?\nVOLCANOES NATIONAL PARK\nBWINDI IMPENETRABLE NATIONAL PARK\n"},"content":"<p>GO GORILLA-TREKKING</p>\n<p>Talking about Bucket List adventures?  Look no further, because trekking through the jungles of Africa &amp; coming face to face with endangered mountain gorillas is as good as it gets!<br>The fact that gorillas as a species are on the verge of extinction &amp; treks are a highly restricted activity, puts gorilla-trekking on top of the list when it comes to once-in-a-lifetime travel experiences.<br>The rainforest is a challenging environment, so if you want to trek, you need to be fairly fit, in good health &amp; equipped for humid, muddy conditions.  Even in the dry season, the steep slopes &amp; thick vegetation can be challenging for some, but if you’re up for the hike, it is worth every moment.<br>Gorillas are susceptible to human illnesses, but don’t have our immunities – so a common cold can be fatal to a gorilla family, which means that you won’t be able to trek if you are unwell.<br>You are not allowed to use a flash when taking a picture &amp; have to wear a protective face mask when approaching the gorillas to prevent spreading viral &amp; bacterial diseases from humans to primates.<br>Each group (a maximum of 6 guests) is led by a professional guide &amp; tracker that will take you into the thick of the forest, in search of a habituation gorilla family.  Once found, you’ll be able to spend an hour with the gorillas, watching the adults groom each other &amp; the babies tumble &amp; play.<br>Those wishing to spend more time with the gorillas can purchase a Gorilla Habituation permit, which will allow them – along with researchers &amp; park rangers – to help train gorillas to get used to people.  Gorilla Habituation may take between 2 to 3 years to be completed, so being able to actively engage in conservation is an experience of a lifetime.<br>Chimp-trekking is quite different to gorilla-trekking.  Although the trekking conditions are much easier, they are wary of humans &amp; a little harder to find.  Chimps &amp; other primate species can also be seen on a gorilla-trek – but there are several other superb chimpanzee trekking destinations like Uganda’s Kibale Forest, Queen Elizabeth National Park &amp; Murchison Falls National Park or Rwanda’s Nyungwe Forest National Park.  You can also spot them in Tanzania’s Mahale Mountains National Park &amp; Gombe Stream National Park.<br>If you are coming all the way to Africa, you may as well add a gorilla safari to your itinerary.  After all, it is a once-in-a-lifetime experience that will leave you with lasting memories.<br>For the best gorilla-trekking adventure, visit one of the following African destinations.</p>\n<ol>\n<li>Volcanoes National Park – Rwanda<br>The beautiful Volcanoes National Park in north-western Rwanda is Rwanda’s prime rainforest &amp; home to 5 of 8 volcanoes in the Virunga Mountains range.  The park was also the base for the revolutionary primatologist, Dian Fossey, &amp; is home to a staggering amount of mountain gorillas, rare golden monkeys &amp; a variety of forest birds.  </li>\n<li>Bwindi Impenetrable National Park – Uganda<br>The mountain gorillas of Uganda can be found in Bwindi Impenetrable Forest National Park – a World Heritage Site of both montane &amp; lowland forest that is home to 120 species of mammals, 350 bird species &amp; 220 butterfly species.  Hosting half of the world’s population of mountain gorillas, Bwindi also offers thrilling encounters with colobus monkeys &amp; chimpanzees.</li>\n</ol>\n","images":["optimized-images/bucket-list/5go-gorilla-trekking/1gogorilla-trekking-large.webp","optimized-images/bucket-list/5go-gorilla-trekking/2gogorilla-trekking-large.webp","optimized-images/bucket-list/5go-gorilla-trekking/3gogorilla-trekking-large.webp","optimized-images/bucket-list/5go-gorilla-trekking/4gogorilla-trekking-large.webp","optimized-images/bucket-list/5go-gorilla-trekking/5gogorilla-trekking-large.webp","optimized-images/bucket-list/5go-gorilla-trekking/6gogorilla-trekking-large.webp","optimized-images/bucket-list/5go-gorilla-trekking/7gogorilla-trekking-large.webp","optimized-images/bucket-list/5go-gorilla-trekking/8gogorilla-trekking-large.webp"],"subfolders":[{"title":"1Tick Off The Big 5","description":"TICK OFF THE BIG 5  Coming to Africa without seeing the Big 5 is like visiting Paris without catching a glimpse of the Eiffel Tower!  ","image":"optimized-images/bucket-list/1tick-off-the-big-5/1tickoffthebig5-small.webp","folderName":"bucket-list/1tick-off-the-big-5","created":null},{"title":"2Sleep In a Treehouse","description":"SLEEP IN A TREEHOUSE An African holiday is all about making (childhood) dreams a reality.  When we grow up, we sometimes forget that life is still full of fantasy, mystery &amp; fun.","image":"optimized-images/bucket-list/2sleep-in-a-treehouse/1sleepinatreehouse-small.webp","folderName":"bucket-list/2sleep-in-a-treehouse","created":null},{"title":"3Enjoy a Water-based Safari","description":"ENJOY A WATER-BASED SAFARI Africa offers a wide range of exciting safari activities – but not all safaris take place on land!  Some can be enjoyed from the comfort of a canoe, a boat or even a traditional mokoro (dug-out canoe).  ","image":"optimized-images/bucket-list/3enjoy-a-water-based-safari/1enjoyawater-basedsafari-small.webp","folderName":"bucket-list/3enjoy-a-water-based-safari","created":null},{"title":"4Float In a Hot Air Balloon","description":"FLOAT IN A HOT AIR BALLOON Everyone around the world – regardless of your age, gender or ethnicity has probably dreamt about flying.  We’re not just talking about stepping onto an aeroplane, fastening your seatbelt &amp; flying across the ocean to another country…Of course, that is a given.  ","image":"optimized-images/bucket-list/4float-in-a-hot-air-balloon/1floatinahotairballoon-small.webp","folderName":"bucket-list/4float-in-a-hot-air-balloon","created":null},{"title":"5Go Gorilla-Trekking","description":"GO GORILLA-TREKKING Talking about Bucket List adventures?  Look no further, because trekking through the jungles of Africa &amp; coming face to face with endangered mountain gorillas is as good as it gets!","image":"optimized-images/bucket-list/5go-gorilla-trekking/1gogorilla-trekking-small.webp","folderName":"bucket-list/5go-gorilla-trekking","created":null},{"title":"6Stay On a Private Island","description":"STAY ON A PRIVATE ISLAND Nothing screams luxury quite like private island living.  And Africa’s Indian Ocean offers you a selection of private islands, each boasting pristine beaches, crystal-clear water &amp; total exclusivity. ","image":"optimized-images/bucket-list/6stay-on-a-private-island/1stayonaprivateisland-small.webp","folderName":"bucket-list/6stay-on-a-private-island","created":null}],"parentCards":[{"title":"Bucket List","image":"optimized-images/bucket-list/1thebucketlist-small.webp","folderName":"bucket-list","isCurrentFolder":true}],"h1Title":"5Go Gorilla-Trekking","h2Title":"Bucket List","h3Title":"5Go Gorilla-Trekking","whatWeLoveItems":[],"params":{"slug":["bucket-list","5go-gorilla-trekking"]},"level":2},"__N_SSG":true}