{"pageProps":{"frontmatter":{"title":"","subtitle":"","article_title":"","created":"1 September 2022","category":"We Say","canon":true},"content":"<p>Apart from seeing the Big 5 on safari, there are 2 things that get most travellers excited:  Wine &amp; Whales – in no particular order!</p>\n<p>But we are not most people.  My husband &amp; I don’t even drink wine (please don’t judge us!) – but we decided to investigate 2 of the most popular self-drive routes in South Africa to see if they are truly as spectacular as everyone says.<br>Nestled between sun-kissed vineyards &amp; majestic mountains, the picturesque valleys of the Wine Route (also referred to as the Cape Winelands) are renowned for their exquisite wines, grand old estates, pretty towns &amp; award-winning restaurants.<br>Within only a 60-minute drive from vibrant Cape Town, you reach one of the most breathtaking regions in South Africa where Alpine-style views, art galleries &amp; quaint side-walk cafes are seen from almost every street.<br>So off we went…<br>The Cape Winelands generally refers to the 3 most popular wine-growing regions surrounding Cape Town: Franschhoek, Stellenbosch &amp; Paarl, each countryside setting as beautiful as the next.  But we decided to go a little off-the-beaten-track to the outskirts of Wellington &amp; make Grand Dedale Country House our first stop.<br>Set along a dirt road at the foot of the Bainskloof Pass on Doolhof, a working wine estate, Grand Dedale is surrounded by majestic mountains &amp; lush vineyards.<br>We were excited to see that the country house is small &amp; intimate, boasting only 6 individually styled rooms &amp; a double volume honeymoon cottage that stands quietly amid the paddocks &amp; gardens.<br>Our room enjoyed gorgeous views over the pool &amp; included a private dining area where romantic dinners can be enjoyed by candlelight.<br>We quickly learned that this is the kind of property to take advantage of – there is no need to get back into a car or transfer vehicle, because everything you need is under one roof!  Not only is the cuisine out of this world – we enjoyed 4-course dinners each evening…&amp; it was incredible!  Food is important at Grand Dedale &amp; every afternoon, high tea buffets &amp; sundowner drinks are served around the pool or lounge area.<br>They can even arrange romantic picnic baskets lunches that can be enjoyed at one of the mountain viewpoints.<br>We are normally very adventurous travellers &amp; love to do as many activities as possible, but for some or other reason, we decided that relaxation was our top priority this time around! (Perhaps it was because our twins were still babies when we visited…&amp; we thought it is best to catch up on some R&amp;R while we had the time…And all the parents say: “Yes, please!”)<br>But even if our trip seems too laid-back for you – there are plenty of things to keep you busy – without ever having to leave the property.<br>On-site outdoor activities include hiking, mountain biking, horse riding &amp; fishing.  But my personal favourite on the ‘to do’ list is relaxing spa treatments in one of the opulent suites.  Nearby, you can enjoy hot air ballooning, clay pigeon shooting &amp; quad biking.<br>Wine lovers will be delighted to know that they can taste the full range of Doolhof’s award-winning wines in the Tasting Room &amp; private wine cellar tours can also be arranged on request.<br>Each day, we explored the farm by taking hikes up the mountain – it was wonderful to be able to connect with nature right on our doorstep!  And when we returned to the country house…it was time for a delicious alfresco lunch on the veranda, followed by a dip in the pool.  We ended off the day with sundowner drinks &amp; a romantic candlelight dinner in the comfort of our own suite.<br>But you know how they say:  When one door closes, another one opens!  Even though we were sad to leave Grand Dedale Country House, we knew our next stop would be one for the books!<br>So off we went.<br>“Welcome to Babylonstoren,” we thought to ourselves as we arrived at one of the oldest – yet most elegant &amp; simplistic - Cape Dutch farms in the country.  I leaned over to my husband &amp; said: “This is luxurious farm living at its best!”  He agreed.<br>Babylonstoren is set at the foot of Simonsberg in the Franschhoek wine valley &amp; has put the farm-to-table kitchen concept on the map.  We were so excited to taste food prepared fresh from their garden!<br>After a warm welcome, we were taken to our beautiful suite with white-washed walls, thatched roof &amp; clean, contemporary interiors.  High ceilings, white décor &amp; hand-picked furniture give the rooms a modern feel while maintaining the historical flair.<br>“Happy?” my husband asked.  The answer was obvious!<br>I was so excited to explore the farm &amp; see why Babylonstoren remains a favourite amongst international &amp; local travellers.<br>So, let’s first talk about Babylonstoren’s heart &amp; soul.  The Garden.  This floral wonderland can be explored via guided tours or self-exploration.  Surrounded by lush greenery as far as the eye can see, organic fruit &amp; vegetables, a beautiful farm dam (restored reservoir) &amp; majestic mountains – we were in our element!<br>Providing an interactive farm-experience, Babylonstoren encourages guests to get involved in harvesting fruit or picking the vines.  Other exciting activities include rowing at the dam, wine tasting &amp; cellar tours, as well as hiking, swimming, fishing &amp; cycling.<br>For those travelling with kids – get ready for more fun! The little ones can feed the donkeys, collect eggs, help harvest fruit &amp; vegetables, go on scavenger hunts &amp; even assist the chef in kneading &amp; baking delicious farm bread.<br>We loved walking around the farm, exploring at our own pace &amp; enjoying everything nature has to offer.<br>Once we explored the farm, we decided it is time to explore the food!  (And all the foodies in the world say: ‘Let’s go!’)<br>Babylonstoren boasts 3 amazing restaurants.  Babel - with its seasonal farm-to-fork philosophy &amp; unconventional flavour combinations, Greenhouse – tucked away in the garden, with its picnic-style food &amp; wood-fired breads, &amp; The Bakery – a family friendly option where guests dish up for themselves from wooden boards placed on their tables.<br>I can write an entire blog post just on their food…but I won’t.  Because if I start typing, I won’t stop…<br>Many people describe Babylonstoren cusine as “out of this world” – but I don’t agree.  Because the term “out of this world” means that it is so far removed from reality (on earth) that we can’t even comprehend how wonderful it really is…but the fact remains:  This food is so close to the earth, it is picked from their own garden &amp; freshly prepared…from farm to table.  So, I will rather say it is authentically outstanding.<br>During our stay at Babylostoren, we got in touch with nature, tasted world-class food &amp; enjoyed a cosy evening by the fireplace…Not bad.  Not bad at all.<br>The next day, we sadly checked out &amp; headed to Hermanus, a quaint fishing village along the scenic Whale Route.<br>Here’s a fun fact – Did you know that Hermanus offers the best land-based whale watching in the world?  Pretty amazing, right?<br>Each year between July &amp; November, Southern Right whales &amp; Humpback whales migrate here to calve &amp; mate, so visitors can marvel at these gentle giants from one of the walking paths overlooking the ocean or from the comfort of a boat.<br>For the ultimate whale watching experience, avid photographers can also take to the skies for a spectacular bird’s eye view of the whales while capturing an incredible shot of mothers with their newborn calves, or large mating groups.<br>But whales are not the only reason to visit. The Whale Route has so much to offer – from majestic mountains &amp; beautiful beaches to nature reserves &amp; charming seaside towns.<br>Needless to say…we were excited!<br>Upon arrival at Birkenhead House, we were blown away by the idyllic location.  Set on dramatic cliffs in Hermanus, with stunning views of Walker Bay, we knew that this opulent &amp; luxurious beachfront retreat will offer the best in elegant seaside luxury.<br>And we were right!<br>Birkenhead House is a honeymooner’s paradise - offering breathtaking views, relaxing spa treatments, sublime cuisine, impeccable service &amp; romantic turn-downs.<br>An all-inclusive rate allows guests to indulge from morning to evening while relaxing days can be spent at one of the elegant swimming pools – one located in a beautiful courtyard &amp; the other overlooking the ocean.<br>Each day, we felt like we woke up in a dream.  We strolled down to the breakfast areas overlooking the ocean, &amp; while we were eating or swimming in the infinity pool, we saw whales frolicking in the ocean.  Just below the retreat, there is a hiking path that will take you straight to the beach, or the harbour – so you can continue to walk for miles on end while enjoying some of the best land-based whale watching in the world.  (You can also rent a boat for up-close-&amp;-personal encounters!)<br>I enjoyed getting massages at the spa, while my husband relaxed by the pool reading a book.  There is a word for this….Bliss!<br>Other exciting nearby activities include golfing, horse-back excursions, fishing, bird watching, &amp; exploring the town of Hermanus with its many restaurants, shops &amp; markets.  Thrill-seekers can also go shark-cage diving in Gansbaai, a 30-minute drive away.<br>One of our favourite Birkenhead memories, was the food!  What is better than eating fresh seafood while overlooking the deep blue waters of the Indian Ocean?<br>Days were spent relaxing in the sun, dipping in the pool, hiking, going to the beach, getting spa treatments &amp; watching the gentle giants of the sea frolicking in the bay below.<br>“This is our happy place,” we thought.<br>On our way back home, my husband &amp; I were talking about our favourite travel moments – as we usually do - when we realised that this trip had too many to count.<br>The proof is in the pudding: Wine &amp; Whales should go together. (Even if you don’t drink wine – like us!)<br>There is a reason that people from across the globe come far &amp; wide to experience our food, our scenery &amp; our wildlife.<br>This is South Africa!  And we love it!</p>\n","images":["optimized-images/blog/we-say/wine-whales/1wine-whales-large.webp","optimized-images/blog/we-say/wine-whales/2wine-whales-large.webp","optimized-images/blog/we-say/wine-whales/3wine-whales-large.webp","optimized-images/blog/we-say/wine-whales/4wine-whales-large.webp","optimized-images/blog/we-say/wine-whales/5wine-whales-large.webp","optimized-images/blog/we-say/wine-whales/6wine-whales-large.webp","optimized-images/blog/we-say/wine-whales/7wine-whales-large.webp","optimized-images/blog/we-say/wine-whales/8wine-whales-large.webp"],"subfolders":[{"title":"Family Fun","description":"OK, Let’s be honest – traveling with kids can be fun (or not).  It all depends on one crucial holiday ingredient:  activities! “What are we going to do today?” is often the one question parents hear while on holiday - &amp; often repetitively. So, I made it my mission to find a holiday that offers of a bagful of fun for the whole family – including Mum &amp; Dad. OK, Let’s be honest – traveling with kids can be fun (or not).  It all depends on one crucial holiday ingredient:  activities!","image":"optimized-images/blog/we-say/family-fun/1familyfun-small.webp","folderName":"blog/we-say/family-fun"},{"title":"Island Extraordinaire","description":"There are two things that excite me when it comes to travel:  Islands &amp; luxury…And for some reason, these two things are like cookies &amp; cream – they create the perfect balance to a holiday. So, from now on I will refer to this term (Islands + Luxury) as ‘Island Extraordinaire’, because if you continue to read until the end, you’ll understand why our recent trip to Mozambique was exactly that - Extraordinary!","image":"optimized-images/blog/we-say/island-extraordinaire/1islandextraordinaire-small.webp","folderName":"blog/we-say/island-extraordinaire"},{"title":"Mother City","description":"Everyone loves Cape Town.  Full stop.  This article is finished. The only reason I continue to write, is because there is so much to say about South Africa’s most beautiful city.  You may think I am biased since I was born here & grew up here – but then I meet people from other countries around the world who agree with me - & I realise, I am right! (She said humbly.)","image":"optimized-images/blog/we-say/mother-city/1mothercity-small.webp","folderName":"blog/we-say/mother-city"},{"title":"Spa Surprise","description":"If you know me well, you’ll know that I get excited about these 3 things:  People, travel &amp; spa treatments! So, when our friends decided to spoil us with a spa day, we could not refuse.  (Everyone needs friends like ours!)","image":"optimized-images/blog/we-say/spa-surprise/1spasurprise-small.webp","folderName":"blog/we-say/spa-surprise"},{"title":"Sunny Safari","description":"“Wow, I am excited about this trip!” I thought while packing. Safari outfits?  Check.  Camera?  Check.  Swim gear?  Check.  After I have packed these three essentials, I almost felt like the rest of the things on my list were suddenly not so important anymore.  (But with kids, you always need to pack more!  So I did.)","image":"optimized-images/blog/we-say/sunny-safari/1sunnysafari-small.webp","folderName":"blog/we-say/sunny-safari"},{"title":"Wine & Whales","description":"Apart from seeing the Big 5 on safari, there are 2 things that get most travellers excited:  Wine &amp; Whales – in no particular order! But we are not most people.  My husband &amp; I don’t even drink wine (please don’t judge us!) – but we decided to investigate 2 of the most popular self-drive routes in South Africa to see if they are truly as spectacular as everyone says.","image":"optimized-images/blog/we-say/wine-whales/1wine-whales-small.webp","folderName":"blog/we-say/wine-whales"}],"parentCards":[{"title":"All Things Africa","image":"optimized-images/blog/all-things-africa/1-all-things-africa-small.webp","folderName":"blog/all-things-africa","isCurrentFolder":false},{"title":"Our Clients Say","image":"optimized-images/blog/our-clients-say/1-clients-say-small.webp","folderName":"blog/our-clients-say","isCurrentFolder":false},{"title":"We Say","image":"optimized-images/blog/we-say/1-we-say-small.webp","folderName":"blog/we-say","isCurrentFolder":true}],"h1Title":"Wine & Whales","h2Title":"We Say","h3Title":"Wine & Whales","whatWeLoveItems":[],"params":{"slug":["blog","we-say","wine-whales"]},"level":3},"__N_SSG":true}